{
  "head": {
    "title": "การเพิ่มลายเซ็นรูปภาพไปยังไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ใส่ลายเซ็นรูปภาพลงในไฟล์ {{FileFormatUp}} สำหรับ {{EnvNameShort}} โดยใช้โค้ดเพียงไม่กี่บรรทัด ใช้ API {{ProdFullName}} เพื่อเพิ่มรูปภาพ."
  },
  "header": {
    "title": "ลงนามไฟล์ {{FileFormatUp}} ด้วยลายเซ็นรูปภาพ",
    "description": "ใช้ {{ProdFullName}} ในการแทรกรูปภาพลงในรูปแบบเอกสารสำนักงานต่างๆ รวมถึง PDF, Word, Excel และไฟล์รูปภาพ รูปภาพที่มีลายเซ็นของหัวหน้าสามารถเพิ่มความน่าเชื่อถือได้อย่างน่าประทับใจ!",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "ค้นพบ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีความสามารถในการเพิ่มลายเซ็นรูปภาพในทุกหน้าและตำแหน่งภายในเอกสารธุรกิจ ปรับปรุงกระบวนการทำงานของคุณโดยการเพิ่มรูปภาพใน PDF, เอกสาร Word, สเปรดชีต Excel, งานนำเสนอ PowerPoint และรูปแบบภาพที่เป็นที่นิยม."
  },
  "more_features": {
    "title": "โซลูชันการลงนามเอกสารที่ครบถ้วน",
    "description": "API ของเรารองรับคุณสมบัติการลงนามที่หลากหลาย ทำให้คุณสามารถเพิ่ม แก้ไข ลบ ค้นหา และตรวจสอบประเภทลายเซ็นหลายประเภท รวมถึงลายเซ็นรูปภาพ.",
    "image_description": "การลงนามด้วยรูปภาพ",
    "feature_1": {
      "title": "แทรกรูปภาพลงในเอกสารสำนักงาน",
      "content": "วางลายเซ็นรูปภาพในตำแหน่งใดก็ได้ในเอกสารได้อย่างไม่ยุ่งยาก เสริมเนื้อหาของคุณด้วยข้อความ รูปภาพ บาร์โค้ด ข้อมูลเมตา และใบรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "ค้นหาและตรวจสอบลายเซ็น",
      "content": "ตรวจสอบความถูกต้องของลายเซ็นในเอกสารที่ลงนามได้อย่างง่ายดาย รับรายการลายเซ็นทั้งหมดภายในเอกสารและตรวจสอบข้อมูลรายละเอียดเกี่ยวกับแต่ละลายเซ็น."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็น",
      "content": "อัปเดตเนื้อหา ลักษณะ ขนาด หรือที่ตั้งของลายเซ็นที่ได้เพิ่มไว้ในเอกสารก่อนหน้านี้ API ของเราช่วยให้การปรับเปลี่ยนลายเซ็นเป็นเรื่องง่ายและมีประสิทธิภาพ."
    },
    "feature_4": {
      "title": "ลบลายเซ็นที่ไม่จำเป็น",
      "content": "API ของเรารองรับการทำงาน CRUD เต็มรูปแบบสำหรับลายเซ็นส่วนใหญ่ คุณสามารถลบลายเซ็นจากเอกสารที่รองรับได้เกือบทั้งหมดเมื่อจำเป็น."
    }
  },
  "formats": {
    "title": "เพิ่มรูปภาพในรูปแบบไฟล์อื่นๆ",
    "description": "ด้วย API {{EnvName}} คุณสามารถแทรกรูปแบบรูปภาพที่รองรับลงในเอกสารต่างๆ ได้อย่างง่ายดาย ปรับขนาด เลือกตำแหน่ง และเพิ่มลายเซ็นรูปภาพในเอกสารของคุณ."
  },
  "operations": {
    "title": "มาดูคุณสมบัติหลักของเรา",
    "description": "เรายินดีที่จะแนะนำเครื่องมือและการทำงานของลายเซ็นที่หลากหลาย."
  },
  "examples": {
    "comment_1": "สร้างอินสแตนซ์ของ {{TextSignature}} พร้อมกับเส้นทางเอกสาร",
    "comment_2": "สร้าง {{ImageSignOptions}} โดยใช้รูปภาพสำหรับลายเซ็น",
    "comment_3": "วางรูปภาพในมุมซ้ายบนของทุกหน้า",
    "comment_4": "บันทึกเอกสารที่ลงนาม"
  },
  "steps": {
    "title": "ขั้นตอนการเพิ่มรูปภาพในตำแหน่งใดก็ได้ของไฟล์ {{FileFormatUp}} ผ่าน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยเพิ่มความสามารถให้กับแอปพลิเคชัน {{EnvName}} ในการเพิ่มลายเซ็นไปยังทุกหน้าในเอกสาร {{FileFormatUp}} ได้อย่างแม่นยำ ปรับปรุงฟังก์ชันการทำงานของผลิตภัณฑ์ของคุณด้วยการรวมไลบรารีของเรา.",
      "step_1": "สร้างอินสแตนซ์ของ {{TextSignature}} พร้อมกับเอกสาร {{FileFormatUp}}.",
      "step_2": "ใช้ {{ImageSignOptions}} เพื่อกำหนดรูปภาพลายเซ็น.",
      "step_3": "วางรูปภาพในตำแหน่งใดก็ได้ของหน้าใดก็ได้.",
      "step_4": "บันทึกเอกสารที่ลงนามไปยังตำแหน่งใหม่."
    }
  },
  "code_1": {
    "title": "ปรับปรุงเนื้อหาเอกสารด้วยลายเซ็นรูปภาพ",
    "content": "เรียนรู้วิธีการเพิ่มรูปภาพลงในเอกสารธุรกิจเพื่อให้ข้อมูลเพิ่มเติม.",
    "comment_1": "เลือกเอกสารที่จะลงนาม",
    "comment_2": "สร้างตัวเลือกของรูปภาพด้วยเส้นทางที่ไปยังรูปภาพ",
    "comment_3": "ตั้งค่าขนาดของลายเซ็นรูปภาพ",
    "comment_4": "วางรูปภาพในมุมล่างขวา",
    "comment_5": "ใช้พื้นที่ว่างจากมุมหน้าเพจถ้าจำเป็น",
    "comment_6": "เพิ่มกรอบที่กำหนดเองให้กับรูปภาพหากต้องการ",
    "comment_7": "หมุนลายเซ็นเพื่อตรงกับแนวที่ดีกว่า",
    "comment_8": "บันทึกเอกสารที่อัปเดตไปยังตำแหน่งใดก็ได้"
  }
}