{
  "head": {
    "title": "Додавання зображень-підписів до файлів {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Помістіть зображення-підпис на файл {{FileFormatUp}} для {{EnvNameShort}}, використовуючи кілька рядків коду. Використовуйте API {{ProdFullName}} для додавання зображень."
  },
  "header": {
    "title": "Додайте зображення-підпис до файлів {{FileFormatUp}}",
    "description": "Використовуйте {{ProdFullName}}, щоб безперешкодно інтегрувати зображення в широкий спектр форматів офісних документів, включаючи PDF, Word, Excel і зображення. Додавання зображення підпису вашого керівника може справити враження професіоналізму, підвищуючи візуальну привабливість і автентичність ваших документів.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Безкоштовно скачати"
  },
  "about": {
    "title": "Ознайомтесь з {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує всебічні можливості для вбудовування зображень-підписів у будь-якому місці на будь-якій сторінці ваших бізнес-документів. Покращте свої робочі процеси, інтегруючи зображення в PDF, документи Word, електронні таблиці Excel, презентації PowerPoint і в різноманітні популярні формати зображень за допомогою нашої надійної бібліотеки."
  },
  "more_features": {
    "title": "Комплексні рішення для підписування документів",
    "description": "Ми раді представити широкий спектр функцій підпису, що підтримуються нашим API. Легко додавайте, змінюйте, видаляйте, шукайте та перевіряйте різні типи підписів, включаючи підписи на основі зображень.",
    "image_description": "Підписування зображеннями",
    "feature_1": {
      "title": "Вбудовуйте зображення в офісні документи",
      "content": "Безперешкодно вставляйте електронні підписи та зображення в будь-яке визначене місце на будь-якій сторінці документа. Підвищуйте функціональність і безпеку вашого документа за допомогою тексту, зображень, штрих-кодів, метаданих або цифрових сертифікатів."
    },
    "feature_2": {
      "title": "Пошук та перевірка підписів",
      "content": "Керуйте підписаними документами, перевіряючи автентичність та цілісність підписів. Отримуйте всебічний список всіх підписів у документі та розглядайте їх специфічні атрибути."
    },
    "feature_3": {
      "title": "Змінюйте підписи",
      "content": "Іноді підписи в документах можуть потребувати оновлення. Легко коригуйте вміст, зовнішній вигляд, розмір або положення існуючих підписів відповідно до змінюваних вимог."
    },
    "feature_4": {
      "title": "Видаляйте зайві підписи",
      "content": "Наш API забезпечує повні CRUD-операції для більшості типів підписів. Ви можете ефективно видаляти підписи з майже всіх підтримуваних форматів документів за потреби."
    }
  },
  "formats": {
    "title": "Інтегруйте зображення в різноманітні формати файлів",
    "description": "Використовуйте API {{EnvName}}, щоб додати підтримувані формати зображень до великої кількості документів. Легко змінюйте розмір, позиціюйте, обирайте конкретні сторінки та застосовуйте підписи на основі зображень до своїх документів."
  },
  "operations": {
    "title": "Ознайомтеся з нашими функціональними можливостями",
    "description": "Досліджуйте різноманітний набір типів підписів та потужних операцій, що надаються нашою платформою."
  },
  "examples": {
    "comment_1": "Ініціалізуйте {{TextSignature}} з шляхом до документа",
    "comment_2": "Налаштуйте {{ImageSignOptions}}, використовуючи зображення для підпису",
    "comment_3": "Розмістіть зображення у верхньому лівому куті всіх сторінок",
    "comment_4": "Збережіть підписаний документ"
  },
  "steps": {
    "title": "Як додати зображення в будь-яке місце файлу {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "Використовуйте [{{ProdShortName}}]({{PlatformLink}}), щоб надати можливості додаткам {{EnvName}} точно вбудовувати підписи на будь-якій сторінці документів {{FileFormatUp}}. Безперешкодно підвищте можливості вашого продукту, інтегруючи наше рішення.",
      "step_1": "Інстанціюйте клас {{TextSignature}} з документом {{FileFormatUp}}.",
      "step_2": "Використовуйте {{ImageSignOptions}}, щоб вказати зображення підпису.",
      "step_3": "Точно розмістіть зображення на будь-якому бажаному місці сторінки.",
      "step_4": "Збережіть новий підписаний документ у вказаному місці."
    }
  },
  "code_1": {
    "title": "Захистіть вміст документа за допомогою зображеневих підписів",
    "content": "Досліджуйте, як збагачувати бізнес-документи, вбудовуючи зображення, забезпечуючи додаткову інформацію.",
    "comment_1": "Виберіть документ, який потрібно підписати",
    "comment_2": "Створіть параметри зображення з вказаним шляхом до зображення",
    "comment_3": "Визначте розміри зображення підпису",
    "comment_4": "Розмістіть зображення у нижньому правому куті",
    "comment_5": "Застосуйте необхідні відступи від країв сторінки",
    "comment_6": "За бажанням, додайте рамку до зображення",
    "comment_7": "Поверніть підпис для оптимального вирівнювання",
    "comment_8": "Збережіть оновлений документ у бажаному місці"
  }
}