{
  "head": {
    "title": "Добавление изображений подписей в файл {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "Поместите изображение подписи в файл {{FileFormatUp}} для {{EnvNameShort}} с помощью нескольких строк кода. Используйте API {{ProdFullName}} для добавления изображений."
  },
  "header": {
    "title": "Добавьте изображение подписи в файлы {{FileFormatUp}}",
    "description": "Используйте {{ProdFullName}} для плавной интеграции изображений в широкий ассортимент офисных форматов документов, включая PDF, Word, Excel и файлы изображений. Добавление изображения подписи вашего начальника может создать впечатляющий профессиональный эффект, повышая визуальную привлекательность и подлинность ваших документов.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать бесплатно"
  },
  "about": {
    "title": "Откройте для себя {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предлагает обширные возможности для встраивания изображений подписей в любое место на любой странице ваших бизнес-документов. Улучшите свои рабочие процессы, интегрируя изображения в PDF-файлы, документы Word, электронные таблицы Excel, презентации PowerPoint и различные популярные форматы изображений с помощью нашей надежной библиотеки."
  },
  "more_features": {
    "title": "Комплексные решения для подписания документов",
    "description": "Мы рады представить широкий спектр функциональных возможностей для подписания, поддерживаемых нашим API. Легко добавляйте, модифицируйте, удаляйте, ищите и проверяйте различные типы подписей, включая подписи на основе изображений.",
    "image_description": "Подписание изображениями",
    "feature_1": {
      "title": "Встраивайте изображения в офисные документы",
      "content": "Легко вставляйте электронные подписи и изображения в любое заданное место на любой странице документа. Увеличьте функциональность и безопасность вашего документа, добавив текст, изображения, штрих-коды, метаданные или цифровые сертификаты."
    },
    "feature_2": {
      "title": "Поиск и проверка подписей",
      "content": "Управляйте подписанными документами, проверяя подлинность и целостность подписей. Получите исчерпывающий список всех подписей в документе и изучите их специфические характеристики."
    },
    "feature_3": {
      "title": "Изменение подписей",
      "content": "Иногда подписи в документах могут требовать обновлений. Легко подкорректируйте содержимое, внешний вид, размер или положение существующих подписей для удовлетворения меняющихся требований."
    },
    "feature_4": {
      "title": "Удаление избыточных подписей",
      "content": "Наш API поддерживает полные CRUD-операции для большинства типов подписей. Вы можете эффективно удалять подписи почти из всех поддерживаемых форматов документов по мере необходимости."
    }
  },
  "formats": {
    "title": "Интеграция изображений в различные форматы файлов",
    "description": "Используйте API {{EnvName}} для добавления поддерживаемых форматов изображений в широкий ассортимент документов. Легко изменяйте размер, позицию, выбирайте конкретные страницы и применяйте подписи на основе изображений к вашим документам."
  },
  "operations": {
    "title": "Изучите наши предлагаемые функции",
    "description": "Исследуйте разнообразные типы подписей и мощные операции, предлагаемые нашей платформой."
  },
  "examples": {
    "comment_1": "Инициализируйте {{TextSignature}} с путем к документу",
    "comment_2": "Настройте {{ImageSignOptions}} с использованием изображения для подписи",
    "comment_3": "Разместите изображение в верхнем левом углу всех страниц",
    "comment_4": "Сохраните подписанный документ"
  },
  "steps": {
    "title": "Как добавить изображение в любое место файла {{FileFormatUp}} с помощью {{ProgLang}}",
    "content": {
      "title": "Используйте [{{ProdShortName}}]({{PlatformLink}}) для расширения возможностей приложений {{EnvName}} на точное встраивание подписей на любую страницу документов {{FileFormatUp}}. Плавно улучшите функционал вашего продукта, интегрировав наше решение.",
      "step_1": "Создайте экземпляр класса {{TextSignature}} с документом {{FileFormatUp}}.",
      "step_2": "Используйте {{ImageSignOptions}} для указания изображения подписки.",
      "step_3": "Точно разместите изображение в любое желаемое место на странице.",
      "step_4": "Сохраните вновь подписанный документ по указанному пути."
    }
  },
  "code_1": {
    "title": "Защитите содержимое документа с помощью изображений подписей",
    "content": "Узнайте, как обогатить бизнес-документы, интегрируя изображения и предоставляя дополнительную информацию.",
    "comment_1": "Выберите документ для подписи",
    "comment_2": "Создайте параметры изображения с указанным путем к изображению",
    "comment_3": "Определите размеры изображения подписи",
    "comment_4": "Разместите изображение в правом нижнем углу",
    "comment_5": "Примените необходимый отступ от краев страницы",
    "comment_6": "При необходимости добавьте пользовательскую рамку к изображению",
    "comment_7": "Поверните подпись для оптимального выравнивания",
    "comment_8": "Сохраните обновленный документ в указанное место"
  }
}