{
  "head": {
    "title": "Add Metadata to {{FileFormatUp}} Files in {{ProgLang}} Applications",
    "description": "{{ProgLang}} metadata processing API to add metadata information to {{FileFormatUp}} files. Work with metadata standards XMP, EXIF, IPTC, ID3 etc."
  },
  "header": {
    "title": "Adding Metadata To {{FileFormatUp}} In {{ProgLang}}",
    "description": "Add custom metadata properties to a wide range of business documents, images, audio & video file formats using {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download Free Trial"
  },
  "about": {
    "title": "About {{ProdFullName}} API",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is an advanced metadata fields management and manipulation solution to easily view, update, remove, find, compare, exchange and export metadata information from images and document formats without using any external software. Add metadata details to Word documents, Excel spreadsheets, PowerPoint presentations, Outlook emails, OneNote, Visio, Project, PDF, AutoCAD, ZIp, Audio and Video file formats along with the support for working with many other metadata processing features."
  },
  "formats": {
    "title": "Adding Metadata Properties To Other File Formats",
    "description": "Multi format documents and images metadata addition API for {{EnvName}}. Retrieve metadata of some of the popular file formats as stated below."
  },
  "examples": {
    "comment_1": "Instantiate {{TextSignature}} with the document path",
    "comment_2": "Create {{ImageSignOptions}} using an image for the signature",
    "comment_3": "Position the image in the top left corner of all pages",
    "comment_4": "Save the signed document"
  },
  "steps": {
    "title": "Steps for Adding an Image to Any Page of a {{FileFormatUp}} Document via {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) enhances {{EnvName}} applications with the capability to add signatures to any page of {{FileFormatUp}} documents precisely. Easily boost your product's functionality by integrating our library.",
      "step_1": "Create an instance of {{TextSignature}} with the {{FileFormatUp}} document.",
      "step_2": "Use {{ImageSignOptions}} to specify the signature image.",
      "step_3": "Place the image on any location of any page.",
      "step_4": "Save the signed document to a new location."
    }
  },
  "more_features": {
    "title": "Document Metadata Management",
    "description": "Our comprehensive API streamlines managing document metadata. Access, edit, and manipulate various document properties for improved organization and searchability.",
    "image_description": "Metadata Functionality",
    "feature_1": {
      "title": "Metadata Access",
      "content": "Effortlessly retrieve and process a document's metadata. Gain insights into properties like author, creation date, and many others."
    },
    "feature_2": {
      "title": "Metadata Editing",
      "content": "Modify document metadata directly. Update properties for better organization, searchability, and information accuracy."
    },
    "feature_3": {
      "title": "Advanced Metadata Management",
      "content": "Perform complex operations on document metadata. Efficiently handle tasks like adding custom properties, deleting irrelevant data, and ensuring data consistency."
    },
    "code_1": {
      "title": "Enhance Document Content with Image Signatures",
      "content": "Learn how to append images to business documents to provide additional information.",
      "comment_1": "Select a document to be signed",
      "comment_2": "Create image options with the path to the image",
      "comment_3": "Set the size of the image signature",
      "comment_4": "Place the image in the bottom right corner",
      "comment_5": "Apply padding from the page corners if necessary",
      "comment_6": "Add a custom border to the image if desired",
      "comment_7": "Rotate the signature for better alignment",
      "comment_8": "Save the updated document to any location"
    }
  }
}