{
  "head": {
    "title": "แทรกรูปภาพลายเซ็นในแฟ้ม {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "แทรกรูปภาพลายเซ็นในเอกสาร {{FileFormatUp}} สำหรับ {{EnvNameShort}} โดยใช้โค้ดเพียงไม่กี่บรรทัด ใช้ API {{ProdFullName}} เพื่อเพิ่มลายเซ็นที่ใช้รูปภาพได้อย่างราบรื่น"
  },
  "header": {
    "title": "เพิ่มลายเซ็นรูปภาพลงใน {{FileFormatUp}}",
    "description": "ใช้ {{ProdFullName}} เพื่อบูรณาการลายเซ็นรูปภาพเข้ากับรูปแบบเอกสารออฟฟิศต่าง ๆ รวมถึง PDF, Word, Excel และไฟล์รูปภาพ การเพิ่มภาพลายเซ็นของผู้จัดการของคุณช่วยเสริมความเป็นมืออาชีพ เพิ่มผลกระทบด้านภาพและความถูกต้องของเอกสาร",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "สำรวจ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีตัวเลือกที่หลากหลายสำหรับการฝังลายเซ็นรูปภาพทุกที่ในเอกสารทางธุรกิจของคุณ ปฏิรูปกระบวนการทำงานโดยการเพิ่มภาพลงใน PDF, เอกสาร Word, แผ่นงาน Excel, งานนำเสนอ PowerPoint และรูปแบบภาพที่ได้รับความนิยมผ่านไลบรารีที่ทรงพลังของเรา"
  },
  "more_features": {
    "title": "ฟีเจอร์การลงนามเอกสารที่ครบถ้วน",
    "description": "API ของเรารองรับฟังก์ชันการลงนามที่หลากหลาย คุณสามารถเพิ่ม, อัปเดต, ลบ, ค้นหา และตรวจสอบลายเซ็นประเภทต่าง ๆ รวมถึงลายเซ็นที่ใช้รูปภาพได้อย่างมีประสิทธิภาพ",
    "image_description": "การบูรณาการลายเซ็นรูปภาพ",
    "feature_1": {
      "title": "แทรกรูปภาพลงในเอกสารออฟฟิศ",
      "content": "ฝังลายเซ็นอิเล็กทรอนิกส์และรูปภาพที่จุดใดก็ได้ในเอกสาร เสริมเอกสารของคุณด้วยภาพ, บาร์โค้ด, ข้อความ, เมตาดาตา หรือใบรับรองดิจิทัลเพื่อปรับปรุงความสามารถและความปลอดภัย"
    },
    "feature_2": {
      "title": "ค้นหาและตรวจสอบลายเซ็น",
      "content": "รับประกันความสมบูรณ์ของเอกสารโดยการตรวจสอบความถูกต้องของลายเซ็น สร้างรายการรายละเอียดของลายเซ็นทั้งหมดในเอกสารและประเมินคุณสมบัติแต่ละรายการ"
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็นที่มีอยู่",
      "content": "อัปเดตเนื้อหา, รูปลักษณ์, ขนาด หรือตำแหน่งของลายเซ็นในเอกสารของคุณเพื่อตอบสนองความต้องการที่เปลี่ยนแปลง"
    },
    "feature_4": {
      "title": "ลบลายเซ็นที่ไม่จำเป็น",
      "content": "API ของเรามีการควบคุมอย่างเต็มที่ช่วยให้คุณลบลายเซ็นจากรูปแบบไฟล์ที่รองรับส่วนใหญ่เมื่อใดก็ได้ที่ต้องการ"
    }
  },
  "formats": {
    "title": "แทรกรูปภาพในหลายรูปแบบไฟล์",
    "description": "ใช้ API {{EnvName}} เพื่อแทรกรูปภาพในรูปแบบเอกสารต่าง ๆ ปรับขนาด, วางตำแหน่ง, เลือกหน้าที่เฉพาะ และใช้ลายเซ็นที่ใช้รูปภาพได้ ทำให้คุณควบคุมการจัดวางเอกสารของคุณได้อย่างครบถ้วน"
  },
  "operations": {
    "title": "สำรวจฟีเจอร์ของเรา",
    "description": "ค้นพบประเภทลายเซ็นและการดำเนินงานที่แพลตฟอร์มของเรามีให้"
  },
  "examples": {
    "comment_1": "เริ่มต้น {{TextSignature}} ด้วยเส้นทางเอกสาร",
    "comment_2": "ตั้งค่า {{ImageSignOptions}} ด้วยภาพที่เลือกสำหรับลายเซ็น",
    "comment_3": "วางตำแหน่งภาพที่มุมซ้ายบนของแต่ละหน้า",
    "comment_4": "บันทึกเอกสารที่มีลายเซ็น"
  },
  "steps": {
    "title": "วิธีการแทรกลายเซ็นรูปภาพลงในไฟล์ {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "ใช้ [{{ProdShortName}}]({{PlatformLink}}) เพื่อให้แอปพลิเคชัน {{EnvName}} มีความสามารถในการเพิ่มลายเซ็นรูปภาพได้อย่างถูกต้องในเอกสาร {{FileFormatUp}} เสริมผลิตภัณฑ์ของคุณด้วยการบูรณาการโซลูชันของเรา",
      "step_1": "สร้างอินสแตนซ์ {{TextSignature}} ด้วยเอกสาร {{FileFormatUp}}",
      "step_2": "ตั้งค่า {{ImageSignOptions}} ด้วยภาพที่ต้องการสำหรับลายเซ็น",
      "step_3": "วางภาพที่ตำแหน่งที่เลือกในเอกสาร",
      "step_4": "บันทึกเอกสารที่ลงนามไปยังตำแหน่งที่ระบุ"
    }
  },
  "code_1": {
    "title": "ปรับปรุงเอกสารด้วยลายเซ็นรูปภาพ",
    "content": "เรียนรู้วิธีการฝังลายเซ็นรูปภาพในเอกสารทางธุรกิจของคุณเพื่อช่วยเสริมเนื้อหา",
    "comment_1": "เลือกเอกสารที่จะลงนาม",
    "comment_2": "ตั้งค่าตัวเลือกภาพด้วยเส้นทางไฟล์ภาพ",
    "comment_3": "ระบุขนาดของลายเซ็นรูปภาพ",
    "comment_4": "วางภาพที่มุมล่างขวาของหน้า",
    "comment_5": "ปรับแต่งระยะห่างจากขอบหน้าให้เหมาะสม",
    "comment_6": "หากต้องการ ให้เพิ่มขอบรอบ ๆ รูปภาพ",
    "comment_7": "หมุนภาพเพื่อให้จัดเรียงได้อย่างถูกต้อง",
    "comment_8": "บันทึกเอกสารที่ปรับปรุงแล้ว"
  }
}