{
  "head": {
    "title": "Генерация и добавление штампов в {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "Используйте возможности {{ProdShortName}} и {{ProgLang}} для создания и размещения пользовательских штампов на любой странице ваших документов {{FileFormatUp}}."
  },
  "header": {
    "title": "Вставка индивидуализированных штампов в файлы {{FileFormatUp}}",
    "description": "Используйте {{ProdFullName}} для генерации специализированных штампов и их вставки в любое место ваших документов. Наша платформа предлагает обширные возможности для персонализации штампов в соответствии с вашими конкретными бизнес-требованиями.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Бесплатная пробная версия"
  },
  "about": {
    "title": "Что такое {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предоставляет мощное и универсальное решение для подписи документов. Он позволяет пользователям добавлять штампы и другие типы подписей более чем в 60 различных форматах, таких как PDF, Word, Excel, изображения и ZIP-файлы. Платформа позволяет вставлять текстовые, графические, штрих-коды, QR-коды, метаданные, цифровые сертификаты и штамповые подписи. Кроме подписи вы можете искать, подтверждать, изменять или удалять любые подписи, присутствующие в ваших документах."
  },
  "more_features": {
    "title": "Усильте безопасность документов с помощью подписей",
    "description": "С помощью {{ProdFullName}} вы можете добавлять, редактировать, проверять или удалять штампы и другие типы подписей во всех популярных форматах документов. API упрощает процесс управления подписями для повышения целостности документов и возможности их настройки.",
    "image_description": "Особенности {{ProdShortName}}",
    "feature_1": {
      "title": "Индивидуальная подпись документов",
      "content": "Применяйте подписи, такие как текст, изображения, штрих-коды, QR-коды и штампы, к любой части вашего документа. Этот инструмент также позволяет включать скрытые метаданные и цифровые сертификаты для дополнительной защиты вашего контента от несанкционированных изменений."
    },
    "feature_2": {
      "title": "Поиск и проверка подписей",
      "content": "После подписи документа используйте нашу систему проверки для обеспечения целостности подписей. Кроме того, наша платформа позволяет вам искать и получать подробную информацию обо всех подписях, примененных к документу."
    },
    "feature_3": {
      "title": "Изменение подписей по мере необходимости",
      "content": "Регулируйте и обновляйте ранее примененные подписи. Будь то изменение содержимого, цвета, размера или позиции подписи, {{ProdFullName}} предлагает полные возможности для настройки."
    },
    "feature_4": {
      "title": "Удаление ненужных подписей",
      "content": "Легко удаляйте любые ненужные подписи из ваших документов. Наш API поддерживает удаление широкого спектра типов подписей, включая штампы и цифровые сертификаты, предоставляя вам полную гибкость в управлении вашими документами."
    }
  },
  "formats": {
    "title": "Применение подписей с штампами для нескольких типов файлов",
    "description": "API {{ProdShortName}} поддерживает подписи штампами в более чем 60 форматах файлов, позволяя пользователям размещать индивидуализированные штампы на любой странице или области, улучшая доступность и безопасность документов."
  },
  "operations": {
    "title": "Изучите ключевые функции",
    "description": "Наше решение предлагает различные инструменты для создания, управления и удаления различных типов подписей, предоставляя пользователям полный контроль над их рабочими процессами документов."
  },
  "examples": {
    "comment_1": "Свяжите путь к документу с экземпляром {{TextSignature}}",
    "comment_2": "Создайте {{StampSignOptions}} с необходимым содержанием подписи",
    "comment_3": "Включите одну или несколько строк штампа",
    "comment_4": "Сохраните документ с примененным штампом"
  },
  "steps": {
    "title": "Руководство по вставке штампов в {{FileFormatUp}} с использованием {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) предоставляет мощный инструмент для создания и вставки штампов, который может значительно улучшить приложения {{EnvName}}. Используйте эту функцию для создания и применения индивидуализированных штампов к страницам ваших документов.",
      "step_1": "Введите документ {{FileFormatUp}}, который требует штамповки.",
      "step_2": "Разверните {{StampSignOptions}} для определения всех необходимых параметров.",
      "step_3": "Вставьте столько строк штампа, сколько необходимо.",
      "step_4": "Примените штамп и сохраните завершенный документ."
    }
  },
  "code_1": {
    "title": "Интеграция пользовательских штампов в документы",
    "content": "Узнайте, как создать и применить индивидуализированные штампы, содержащие важный текст, к вашим документам.",
    "comment_1": "Предоставьте документ для штамповки",
    "comment_2": "Настройте параметры штампа с желаемыми настройками",
    "comment_3": "Укажите размеры и положение штампа на странице",
    "comment_4": "Добавьте внешние круговые линии с пользовательским текстом",
    "comment_5": "При необходимости добавьте внутренние квадратные линии",
    "comment_6": "Сохраните документ с нанесенным штампом"
  }
}