{
  "head": {
    "title": "{{ProgLang}}を使用して{{FileFormatUp}}にスタンプを生成して追加する",
    "description": "{{ProdShortName}}と{{ProgLang}}の力を活用して、あなたの{{FileFormatUp}}ドキュメント内の任意のページにカスタムスタンプを生成して配置します。"
  },
  "header": {
    "title": "{{FileFormatUp}}ファイルにカスタマイズされたスタンプを挿入する",
    "description": "{{ProdFullName}}を利用して、要求に応じたスタンプを生成し、ドキュメント内の任意の位置に挿入します。当社のプラットフォームは、特定のビジネス要件に応じてスタンプをパーソナライズするための広範なオプションを提供します。",
    "subtitle": "{{ProdFullName}}",
    "action_title": "無料トライアル"
  },
  "about": {
    "title": "{{ProdFullName}}とは？",
    "content": "[{{ProdFullName}}]({{PlatformLink}})は、ドキュメント署名のための堅牢で多用途のソリューションを提供します。これは、PDF、Word、Excel、画像ファイル、ZIPファイルなど、60以上の異なるフォーマットでスタンプや他の署名タイプを追加するユーザーを可能にします。このプラットフォームでは、テキスト、画像、バーコード、QRコード、メタデータ、デジタル証明書、およびスタンプ署名を挿入できます。署名に加えて、ドキュメント内の署名を検索、検証、修正、または削除することも可能です。"
  },
  "more_features": {
    "title": "署名でドキュメントのセキュリティを強化する",
    "description": "{{ProdFullName}}を使用すれば、すべての一般的なドキュメントフォーマット内でスタンプおよび他の署名タイプを追加、編集、検証、または削除できます。APIは署名管理のプロセスを簡素化し、ドキュメントの整合性とカスタマイズ性を向上させます。",
    "image_description": "{{ProdShortName}}の機能",
    "feature_1": {
      "title": "カスタムドキュメント署名",
      "content": "テキスト、画像、バーコード、QRコード、スタンプなどの署名をドキュメントの任意の部分に適用します。このツールでは、未公開のメタデータやデジタル証明書を含めて、コンテンツを不正な変更からさらに保護することもできます。"
    },
    "feature_2": {
      "title": "署名の検索と検証",
      "content": "ドキュメントに署名した後、検証システムを使用して署名の整合性を確保します。さらに、当社のプラットフォームを使用すると、ドキュメントに適用されたすべての署名の詳細情報を検索して取得することが可能です。"
    },
    "feature_3": {
      "title": "必要に応じて署名を修正",
      "content": "以前に適用された署名を調整および更新できます。署名の内容、色、サイズ、または位置を変更することが簡単にできる、{{ProdFullName}}は完全なカスタマイズオプションを提供します。"
    },
    "feature_4": {
      "title": "不要な署名を削除",
      "content": "ドキュメントから不要な署名を簡単に削除します。私たちのAPIは、スタンプやデジタル証明書を含むさまざまな署名タイプの削除をサポートし、ドキュメント管理において完全な柔軟性を提供します。"
    }
  },
  "formats": {
    "title": "複数のファイルタイプにスタンプ署名を適用",
    "description": "{{ProdShortName}} APIは、60以上のファイルフォーマットでスタンプ署名をサポートしており、ユーザーが任意のページやエリアにカスタマイズされたスタンプを配置でき、ドキュメントのアクセシビリティとセキュリティを向上させます。"
  },
  "operations": {
    "title": "主要な機能を探る",
    "description": "当社のソリューションは、さまざまな署名タイプを作成、管理、および削除するための多くのツールを提供し、ユーザーにドキュメントワークフローの完全な制御を可能にします。"
  },
  "examples": {
    "comment_1": "{{TextSignature}}インスタンスにドキュメントパスを関連付ける",
    "comment_2": "必要な署名内容を持つ{{StampSignOptions}}を作成する",
    "comment_3": "1つ以上のスタンプラインを組み込む",
    "comment_4": "適用されたスタンプでドキュメントを保存する"
  },
  "steps": {
    "title": "{{ProgLang}}を使用して{{FileFormatUp}}にスタンプを埋め込むためのガイド",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}})は、スタンプを作成して埋め込むための強力なツールを提供し、{{EnvName}}アプリケーションを大幅に向上させます。この機能を使用して、ドキュメントページにカスタムスタンプを設計して適用します。",
      "step_1": "{{FileFormatUp}}ドキュメントを入力します。",
      "step_2": "{{StampSignOptions}}を展開して、すべての重要なパラメータを定義します。",
      "step_3": "必要に応じて、スタンプラインを挿入します。",
      "step_4": "スタンプを適用して、最終的なドキュメントを保存します。"
    }
  },
  "code_1": {
    "title": "ドキュメントにカスタムスタンプを統合する",
    "content": "ドキュメントに重要なテキストを含むカスタマイズされたスタンプを設計し、適用する方法を学びます。",
    "comment_1": "スタンプ用のドキュメントを提供する",
    "comment_2": "希望の設定でスタンプオプションをセットアップする",
    "comment_3": "ページ上のスタンプのサイズと位置を指定する",
    "comment_4": "カスタムテキスト付きの外部円形線を含む",
    "comment_5": "必要に応じて内部の四角形線を追加する",
    "comment_6": "スタンプされたドキュメントを保存する"
  }
}