{
  "head": {
    "title": "Генерація та додавання штампів до {{FileFormatUp}} через {{ProgLang}}",
    "description": "Скористайтеся потужністю {{ProdShortName}} та {{ProgLang}}, щоб генерувати та розміщувати індивідуальні штампи на будь-якій сторінці ваших документів {{FileFormatUp}}."
  },
  "header": {
    "title": "Вставка налаштованих штампів у файли {{FileFormatUp}}",
    "description": "Використовуйте {{ProdFullName}}, щоб створювати індивідуальні штампи та вставляти їх у будь-якому місці ваших документів. Наша платформа надає широкі можливості для персоналізації штампів відповідно до ваших бізнес-вимог.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Безкоштовний пробний період"
  },
  "about": {
    "title": "Що таке {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує надійне та універсальне рішення для підписання документів. Це дозволяє користувачам додавати штампи та інші типи підписів у понад 60 різних форматах, таких як PDF, Word, Excel, зображення та ZIP файли. Платформа дозволяє вставляти текст, зображення, штрих-коди, QR-коди, метадані, цифрові сертифікати та підписи зі штампами. Окрім підписування, ви можете шукати, перевіряти, змінювати або видаляти всі підписи, що містяться у ваших документах."
  },
  "more_features": {
    "title": "Зміцніть безпеку документів за допомогою підписів",
    "description": "З {{ProdFullName}} ви можете додавати, редагувати, перевіряти або видаляти штампи та інші типи підписів у всіх популярних форматах документів. API спрощує процес управління підписами для покращення цілісності документів та їх налаштування.",
    "image_description": "Особливості {{ProdShortName}}",
    "feature_1": {
      "title": "Індивідуальне підписання документів",
      "content": "Наносьте підписи, такі як текст, зображення, штрих-коди, QR-коди та штампи, на будь-яку частину вашого документа. Цей інструмент також дозволяє включати приховані метадані та цифрові сертифікати для подальшого захисту вашого контенту від несанкціонованих змін."
    },
    "feature_2": {
      "title": "Пошук та перевірка підписів",
      "content": "Після підписання документа скористайтеся нашою системою перевірки, щоб забезпечити цілісність підписів. Крім того, наша платформа дозволяє шукати та отримувати детальну інформацію про всі підписи, нанесені на документ."
    },
    "feature_3": {
      "title": "Зміна підписів за потреби",
      "content": "Регулюйте та оновлюйте раніше нанесені підписи. Чи потрібно змінити вміст, колір, розмір або положення підпису, {{ProdFullName}} пропонує повні параметри налаштування."
    },
    "feature_4": {
      "title": "Видалення небажаних підписів",
      "content": "Легко видаліть будь-які непотрібні підписи з ваших документів. Наш API підтримує видалення широкого спектра типів підписів, включаючи штампи та цифрові сертифікати, надаючи вам повну гнучкість у управлінні вашими документами."
    }
  },
  "formats": {
    "title": "Застосування підписів зі штампом у кількох типах файлів",
    "description": "API {{ProdShortName}} підтримує штампові підписи у понад 60 форматах файлів, що дозволяє користувачам розміщувати індивідуальні штампи на будь-якій сторінці чи області, покращуючи доступність та безпеку документів."
  },
  "operations": {
    "title": "Ознайомтеся з ключовими функціями",
    "description": "Наше рішення пропонує різноманітні інструменти для створення, управління та видалення різних типів підписів, даючи користувачам повний контроль над їхніми робочими процесами з документами."
  },
  "examples": {
    "comment_1": "Прив'яжіть шлях до документа до екземпляра {{TextSignature}}",
    "comment_2": "Створіть {{StampSignOptions}} з необхідним підписним вмістом",
    "comment_3": "Включіть один або кілька рядків штампа",
    "comment_4": "Збережіть документ із застосованим штампом"
  },
  "steps": {
    "title": "Посібник з вбудовування штампів у {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) пропонує потужний інструмент для створення та вбудовування штампів, які можуть значно покращити {{EnvName}} програми. Використовуйте цю функцію, щоб створити та застосувати індивідуальні штампи до сторінок ваших документів.",
      "step_1": "Введіть документ {{FileFormatUp}}, який потребує штампування.",
      "step_2": "Використовуйте {{StampSignOptions}}, щоб визначити всі необхідні параметри.",
      "step_3": "Додайте потрібну кількість рядків штампа.",
      "step_4": "Застосуйте штамп і збережіть готовий документ."
    }
  },
  "code_1": {
    "title": "Інтегруйте індивідуальні штампи в документи",
    "content": "Дізнайтеся, як створювати та застосовувати налаштовані штампи, що містять важливий текст, до ваших документів.",
    "comment_1": "Надайте документ для штампування",
    "comment_2": "Налаштуйте параметри штампа з бажаними конфігураціями",
    "comment_3": "Визначте розміри та позицію штампа на сторінці",
    "comment_4": "Додайте зовнішні круглі лінії з індивідуальним текстом",
    "comment_5": "Додайте внутрішні квадратні лінії за необхідності",
    "comment_6": "Збережіть документ із штампом"
  }
}