{
  "head": {
    "title": "اضافه کردن مهر به {{FileFormatUp}} با استفاده از {{ProgLang}}",
    "description": "از [[{{ProdShortName}}]({{PlatformLink}})] و {{ProgLang}} برای ایجاد مهرهای سفارشی و قرار دادن آنها در هر صفحه از اسناد {{FileFormatUp}} استفاده کنید."
  },
  "header": {
    "title": "اضافه کردن مهرهای سفارشی به {{FileFormatUp}}",
    "description": "طراحی و اعمال مهرهای گرد یا چهارگوش به هر بخش از اسناد خود با استفاده از {{ProdFullName}}. راه‌حل ما گزینه‌های سفارشی‌سازی زیادی را برای پاسخگویی به تمام نیازهای تجاری شما ارائه می‌دهد.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "دانلود رایگان"
  },
  "about": {
    "title": "درباره {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ابزاری قوی است که به شما امکان می‌دهد امضای مهرهای مختلف را به اسناد اضافه کنید. این ابزار از بیش از 60 فرمت مختلف فایل، از جمله PDF، ورد، اکسل، تصاویر و فایل‌های ZIP پشتیبانی می‌کند. می‌توانید امضای متنی، تصویری، بارکد، متادیتا، گواهی دیجیتال و امضای مهر را اعمال کنید. علاوه بر اضافه کردن امضاها، می‌توانید آنها را جستجو، تأیید، ویرایش و حذف کنید."
  },
  "more_features": {
    "title": "محافظت از محتوای سند خود با امضاها",
    "description": "کتابخانه {{ProdFullName}} برای امضا و مدیریت امضاها در فرمت‌های فایل محبوب طراحی شده است. به‌راحتی مهرها و دیگر انواع امضاها را اضافه، ویرایش، تأیید یا حذف کنید.",
    "image_description": "امضای مهر با {{ProdShortName}}",
    "feature_1": {
      "title": "امضا کردن اسناد خود",
      "content": "امضاهای سفارشی را به هر قسمت از سند خود اعمال کنید. از انواع مختلف امضا، از جمله متن، تصاویر، بارکدها، QR کدها و مهرها انتخاب کنید. علاوه بر این، متادیتای مخفی می‌تواند برای افزایش امنیت سند اضافه یا ویرایش شود."
    },
    "feature_2": {
      "title": "جستجو و اعتبارسنجی امضاها",
      "content": "هنگامی که یک سند امضا شده است، از ابزارهای تأیید ما استفاده کنید تا اطمینان حاصل کنید که محتوای امضا معتبر است. جستجو کرده و لیستی از تمام امضاها را برای پردازش‌های بعدی بازیابی کنید."
    },
    "feature_3": {
      "title": "به‌روزرسانی امضاها در صورت نیاز",
      "content": "به‌راحتی می‌توانید طیف گسترده‌ای از امضاهای اعمال‌شده روی یک سند را ویرایش کنید. خصوصیات مانند اندازه، رنگ، موقعیت، محتوا و موارد دیگر را به‌روز کنید."
    },
    "feature_4": {
      "title": "حذف امضاها",
      "content": "نیاز به حذف امضاها از یک سند دارید؟ API ما به‌طور کامل از حذف امضاها پشتیبانی می‌کند و مدیریت اسناد شما را آسان می‌کند."
    }
  },
  "formats": {
    "title": "اضافه کردن مهر به چندین فرمت فایل",
    "description": "API {{ProdShortName}} از قرار دادن مهر به اسناد در بیش از 60 فرمت پشتیبانی می‌کند. مهرها را در هر صفحه یا ناحیه قرار دهید تا مدیریت و سفارشی‌سازی سند را بهبود ببخشید."
  },
  "operations": {
    "title": "ویژگی‌های اصلی ما را کشف کنید",
    "description": "از طیف وسیعی از گزینه‌ها برای اضافه کردن، مدیریت و حذف امضاها استفاده کنید."
  },
  "examples": {
    "comment_1": "از مسیر سند با شی {{TextSignature}} استفاده کنید",
    "comment_2": "شی {{StampSignOptions}} را با متن امضای مورد نظر ایجاد کنید",
    "comment_3": "یک یا چند خط مهر اضافه کنید",
    "comment_4": "سند مهر خورده را ذخیره کنید"
  },
  "steps": {
    "title": "مراحل برای اضافه کردن مهر به {{FileFormatUp}} با استفاده از {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) یک سازنده مهر فراهم می‌کند که می‌تواند برای برنامه‌های {{EnvName}} بسیار مفید باشد. از آن برای ایجاد مهرهای به خوبی سفارشی‌شده برای صفحات سند خود استفاده کنید.",
      "step_1": "سند {{FileFormatUp}} که قرار است مهر شود را ارائه دهید.",
      "step_2": "از {{StampSignOptions}} برای پیکربندی تمام پارامترهای لازم استفاده کنید.",
      "step_3": "به تعداد مورد نیاز خط اضافه کنید.",
      "step_4": "مهر را اعمال کرده و سند را ذخیره کنید."
    }
  },
  "code_1": {
    "title": "اضافه کردن مهرهای سفارشی به اسناد با استفاده از امضاهای ویژه",
    "content": "بیاموزید که چگونه مهرهای سفارشی با اطلاعات متنی مهم را به اسناد خود تولید و اضافه کنید.",
    "comment_1": "سند مورد نظر برای مهر را ارائه دهید",
    "comment_2": "شی گزینه‌های مهر را ایجاد کنید",
    "comment_3": "اندازه و موقعیت بر روی صفحه را تنظیم کنید",
    "comment_4": "یک یا چند خط گرد بیرونی با متن اضافه کنید",
    "comment_5": "یک یا چند خط مربعی داخلی اضافه کنید",
    "comment_6": "سند مهر خورده را ذخیره کنید"
  }
}