{
  "head": {
    "title": "Створення круглих та квадратних штампів у {{FileFormatUp}} з використанням {{ProgLang}}",
    "description": "Генеруйте та вставляйте персоналізовані штампи у файли {{FileFormatUp}} за допомогою API {{ProdFullName}}."
  },
  "header": {
    "title": "Створення штампів для {{FileFormatUp}}",
    "description": "Додайте нестандартні штампи до будь-якої частини ваших документів за допомогою {{ProdFullName}}, що забезпечує велику гнучкість щодо розміщення та налаштувань відповідно до ваших бізнес-потреб.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажити безкоштовно"
  },
  "about": {
    "title": "Огляд {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — це всебічний інструмент, який дозволяє вставляти різні типи підписів у документи, включаючи нестандартні штампи. Підтримуючи більше 60 форматів файлів — від PDF та Word документів до зображень і ZIP-файлів — ви можете покращити свої документи текстом, зображеннями, штрих-кодами, метаданими, цифровими сертифікатами та штампами. Ви також маєте повний контроль для пошуку, перевірки, редагування або видалення будь-яких застосованих підписів."
  },
  "more_features": {
    "title": "Використовуйте підписи для захисту та покращення цілісності документів",
    "description": "З бібліотекою {{ProdFullName}} ви можете безперешкодно додавати функціональність підпису до своїх документів. Легко створюйте, модифікуйте, перевіряйте або видаляйте нестандартні штампи та інші типи підписів, забезпечуючи гнучкість і безпеку для ваших документів.",
    "image_description": "Штампові підписи, забезпечені {{ProdShortName}}",
    "feature_1": {
      "title": "Повне підписання документів",
      "content": "Підвищте якість ваших документів, додаючи підписи у вигляді тексту, зображень, штрих-кодів, QR-кодів та штампів на будь-якій сторінці. Керуйте вбудованими метаданими та застосовуйте цифрові сертифікати для захисту від несанкціонованих змін."
    },
    "feature_2": {
      "title": "Ефективний пошук і перевірка підписів",
      "content": "Після підписання використовуйте розширені інструменти пошуку, щоб знайти всі вбудовані підписи. Легко перевіряйте або керуйте даними підписів, щоб забезпечити цілісність документів."
    },
    "feature_3": {
      "title": "Редагування та налаштування підписів",
      "content": "Вносьте зміни до раніше доданих підписів без проблем. Незалежно від того, чи потрібно змінити вміст, розташування, розмір чи колір, {{ProdFullName}} надає вам повний контроль для налаштування підписів на ваш розсуд."
    },
    "feature_4": {
      "title": "Легке видалення підписів",
      "content": "Якщо вам потрібно видалити підписи, {{ProdFullName}} пропонує всі необхідні інструменти для видалення будь-якого типу, включаючи штампи та цифрові сертифікати, що допомагає вам підтримувати актуальність і відповідність ваших документів."
    }
  },
  "formats": {
    "title": "Застосування штампів до різних форматів документів",
    "description": "З API {{ProdShortName}} ви можете вставляти нестандартні штампи у більше ніж 60 стандартних типів файлів. Легко застосовуйте штампи в будь-якій частині ваших документів для покращення персоналізації та відстеження."
  },
  "operations": {
    "title": "Ознайомтеся з основними функціями",
    "description": "Знайдіть широкий спектр опцій для створення, керування та видалення підписів, який надає вам повний контроль над документними процесами."
  },
  "examples": {
    "comment_1": "Прикріпіть шлях до документа до екземпляра {{TextSignature}}",
    "comment_2": "Налаштуйте {{StampSignOptions}} з необхідними деталями штампа",
    "comment_3": "Додайте одну або більше ліній до штампа",
    "comment_4": "Збережіть документ з застосованим штампом"
  },
  "steps": {
    "title": "Як додати штамп до {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) надає потужні інструменти для створення штампів, щоб покращити програми {{EnvName}}. Використовуйте це для дизайну та реалізації нестандартних штампів для ваших документів.",
      "step_1": "Надайте документ {{FileFormatUp}}, який ви хочете штампувати.",
      "step_2": "Використовуйте {{StampSignOptions}} для налаштування всіх необхідних параметрів.",
      "step_3": "При необхідності додайте кілька рядків штампа.",
      "step_4": "Застосуйте штамп і збережіть оновлений документ."
    }
  },
  "code_1": {
    "title": "Як додати нестандартні штампи до документів",
    "content": "Цей приклад показує, як створити та вставити нестандартні штампи з конкретними текстовими деталями в документ.",
    "comment_1": "Надайте документ, який ви хочете штампувати",
    "comment_2": "Налаштуйте параметри штампа з вашими бажаними налаштуваннями",
    "comment_3": "Визначте розміри та розташування штампа на сторінці",
    "comment_4": "Додайте зовнішні круглі лінії з текстом",
    "comment_5": "Опціонально, додайте внутрішні квадратні лінії",
    "comment_6": "Завершіть й збережіть документ з штампом"
  }
}