{
  "head": {
    "title": "สร้างและเพิ่มตราประทับใน {{FileFormatUp}} ผ่าน {{ProgLang}}",
    "description": "ใช้พลังของ {{ProdShortName}} และ {{ProgLang}} เพื่อสร้างและวางตราประทับที่กำหนดเองบนหน้าใดก็ได้ในเอกสาร {{FileFormatUp}} ของคุณ."
  },
  "header": {
    "title": "ใส่ตราประทับที่กำหนดเองในไฟล์ {{FileFormatUp}}",
    "description": "ใช้ {{ProdFullName}} เพื่อสร้างตราประทับที่ปรับให้เหมาะสมและแทรกลงในเอกสารของคุณในตำแหน่งใดก็ได้ แพลตฟอร์มของเราให้ตัวเลือกมากมายในการปรับแต่งตราประทับตามความต้องการทางธุรกิจของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ทดลองใช้ฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ให้บริการโซลูชั่นที่แข็งแกร่งและหลากหลายสำหรับการลงลายมือชื่อในเอกสาร มันช่วยให้ผู้ใช้สามารถเพิ่มตราประทับและประเภทลายมือชื่ออื่น ๆ ในรูปแบบต่างๆ มากกว่า 60 รูปแบบ เช่น PDFs, Word, Excel, ไฟล์ภาพ และไฟล์ ZIP แพลตฟอร์มนี้อนุญาตให้คุณแทรกข้อความ, ภาพ, บาร์โค้ด, รหัส QR, เมตาดาต้า, ใบรับรองดิจิตอล และลายมือชื่อแบบตราประทับ นอกจากการลงลายมือชื่อแล้ว คุณยังสามารถค้นหา, ตรวจสอบ, แก้ไข หรือลบลายมือใส่ที่มีอยู่ในเอกสารของคุณได้."
  },
  "more_features": {
    "title": "เสริมความปลอดภัยของเอกสารด้วยลายมือชื่อ",
    "description": "ด้วย {{ProdFullName}} คุณสามารถเพิ่ม, แก้ไข, ตรวจสอบความถูกต้อง หรือกำจัดตราประทับและประเภทลายมือชื่ออื่น ๆ ในรูปแบบเอกสารที่ได้รับความนิยมทั้งหมด API ทำให้การจัดการลายมือชื่อเป็นเรื่องง่ายเพื่อเสริมสร้างความสมบูรณ์ของเอกสารและการปรับแต่ง.",
    "image_description": "ฟีเจอร์ของ {{ProdShortName}}",
    "feature_1": {
      "title": "การลงลายมือชื่อเอกสารที่กำหนดเอง",
      "content": "ใช้ลายมือชื่อ เช่น ข้อความ, รูปภาพ, บาร์โค้ด, รหัส QR และตราประทับในส่วนใด ๆ ของเอกสารของคุณ เครื่องมือนี้ยังอนุญาตให้รวมเมตาดาต้าที่ซ่อนอยู่และใบรับรองดิจิตอลเพื่อต่อสู้กับการแก้ไขที่ไม่ได้รับอนุญาต."
    },
    "feature_2": {
      "title": "การค้นหาและตรวจสอบลายมือชื่อ",
      "content": "หลังจากที่เอกสารได้รับการลงลายมือชื่อแล้ว ใช้ระบบการตรวจสอบของเราเพื่อให้แน่ใจว่าลายมือชื่อมีความถูกต้อง นอกจากนี้ แพลตฟอร์มของเรายังช่วยให้คุณค้นหาและเรียกคืนข้อมูลที่ละเอียดเกี่ยวกับลายมือชื่อทั้งหมดที่ใช้กับเอกสาร."
    },
    "feature_3": {
      "title": "ปรับแต่งลายมือชื่อได้ตามต้องการ",
      "content": "ปรับเปลี่ยนและอัปเดตลายมือที่ลงไปก่อนหน้านี้ได้ตามต้องการ ไม่ว่าจะเป็นการเปลี่ยนเนื้อหา, สี, ขนาด หรือสถานที่ของลายมือชื่อ {{ProdFullName}} มอบตัวเลือกการปรับแต่งเต็มรูปแบบ."
    },
    "feature_4": {
      "title": "ลบลายมือชื่อที่ไม่ต้องการ",
      "content": "กำจัดลายมือชื่อที่ไม่จำเป็นจากเอกสารของคุณได้ง่าย ๆ API ของเรารองรับการลบหลากหลายประเภทของลายมือชื่อ รวมถึงตราประทับและใบรับรองดิจิตอล ทำให้คุณมีความยืดหยุ่นในการจัดการเอกสารของคุณ."
    }
  },
  "formats": {
    "title": "ใช้ลายมือชื่อที่ตราประทับในหลายประเภทไฟล์",
    "description": "API ของ {{ProdShortName}} รองรับลายมือชื่อที่ตราประทับในกว่า 60 รูปแบบไฟล์ อนุญาตให้ผู้ใช้วางตราประทับที่กำหนดเองในหน้าใดก็ได้หรือในพื้นที่ใดในเอกสาร ปรับปรุงการเข้าถึงและความปลอดภัยของเอกสาร."
  },
  "operations": {
    "title": "สำรวจฟีเจอร์หลัก",
    "description": "โซลูชั่นของเรามีเครื่องมือหลากหลายสำหรับการสร้าง, จัดการ, และลบประเภทลายมือชื่อที่แตกต่างกัน ทำให้ผู้ใช้มีอำนาจเต็มในการจัดการกระบวนการทำงานของเอกสาร."
  },
  "examples": {
    "comment_1": "เชื่อมโยงเส้นทางเอกสารเข้ากับตัวอย่าง {{TextSignature}}",
    "comment_2": "สร้าง {{StampSignOptions}} ด้วยเนื้อหาลายมือที่จำเป็น",
    "comment_3": "รวมแถบตราประทับหนึ่งหรือมากกว่าตามที่ต้องการ",
    "comment_4": "บันทึกเอกสารพร้อมตราที่ใช้"
  },
  "steps": {
    "title": "คู่มือการฝังตราประทับใน {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) มอบเครื่องมือที่ทรงพลังสำหรับการสร้างและฝังตราประทับ ซึ่งสามารถเพิ่มคุณค่าให้กับแอปพลิเคชัน {{EnvName}} ของคุณ ใช้ฟีเจอร์นี้ในการสร้างและใช้ตราประทับที่กำหนดเองในเอกสารของคุณ.",
      "step_1": "กรอกเอกสาร {{FileFormatUp}} ที่ต้องการการตราประทับ.",
      "step_2": "ใช้ {{StampSignOptions}} เพื่อตั้งค่าพารามิเตอร์ที่จำเป็นทั้งหมด.",
      "step_3": "แทรกแถบตราประทับจำนวนเท่าใดก็ได้ตามต้องการ.",
      "step_4": "ใช้ตราประทับและบันทึกเอกสารสุดท้าย."
    }
  },
  "code_1": {
    "title": "รวมตราประทับที่กำหนดเองในเอกสาร",
    "content": "เรียนรู้วิธีออกแบบและใช้ตราประทับที่กำหนดเองที่มีข้อความสำคัญในเอกสารของคุณ.",
    "comment_1": "จัดเตรียมเอกสารสำหรับการตราประทับ",
    "comment_2": "ตั้งค่าสิทธิ์ตราประทับด้วยการกำหนดค่าที่ต้องการ",
    "comment_3": "กำหนดขนาดและตำแหน่งของตราประทับบนหน้า",
    "comment_4": "รวมเส้นรอบนอกวงกลมพร้อมข้อความที่กำหนดเอง",
    "comment_5": "เพิ่มเส้นสี่เหลี่ยมด้านในตามที่ต้องการ",
    "comment_6": "บันทึกเอกสารที่มีตราประทับ"
  }
}