{
  "head": {
    "title": "เพิ่มตราประทับลงใน {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ใช้ {{ProdShortName}} และ {{ProgLang}} เพื่อสร้างตราประทับที่กำหนดเองและวางลงในเอกสาร {{FileFormatUp}} ทุกหน้า."
  },
  "header": {
    "title": "เพิ่มตราประทับที่กำหนดเองลงใน {{FileFormatUp}}",
    "description": "ออกแบบและใช้ตราประทับกลมหรือสี่เหลี่ยมในทุกส่วนของเอกสารของคุณโดยใช้ {{ProdFullName}} โซลูชันของเรามีตัวเลือกการปรับแต่งที่หลากหลายเพื่อตอบสนองทุกความต้องการทางธุรกิจของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือที่ทรงพลังที่ช่วยให้คุณเพิ่มลายเซ็นตราประทับที่หลากหลายลงในเอกสาร มันรองรับรูปแบบไฟล์มากกว่า 60 รูปแบบ รวมถึง PDF, Word, Excel, รูปภาพ และไฟล์ ZIP คุณสามารถใช้ลายเซ็นข้อความ รูปภาพ บาร์โค้ด เมตาดาทา ใบรับรองดิจิตอล และลายเซ็นตราประทับ นอกจากนี้ยังสามารถค้นหา ตรวจสอบ แก้ไข และลบลายเซ็นได้."
  },
  "more_features": {
    "title": "ปกป้องเนื้อหาเอกสารของคุณด้วยลายเซ็น",
    "description": "ห้องสมุด {{ProdFullName}} ถูกออกแบบมาเพื่อใช้ในการลงลายเซ็นและจัดการลายเซ็นทั่วรูปแบบไฟล์ยอดนิยม เพิ่ม แก้ไข ตรวจสอบ หรือ ลบตราประทับและลายเซ็นประเภทอื่นได้โดยง่าย.",
    "image_description": "ลายเซ็นตราประทับด้วย {{ProdShortName}}",
    "feature_1": {
      "title": "ลงลายเซ็นในเอกสารของคุณ",
      "content": "ใช้ลายเซ็นที่ปรับแต่งได้ในทุกส่วนของเอกสารของคุณ เลือกจากลายเซ็นประเภทต่างๆ เช่น ข้อความ รูปภาพ บาร์โค้ด รหัส QR และตราประทับ นอกจากนี้ยังสามารถเพิ่มหรือแก้ไขเมตาดาทาที่ซ่อนอยู่เพื่อเพิ่มความปลอดภัยให้กับเอกสาร."
    },
    "feature_2": {
      "title": "ค้นหาและตรวจสอบลายเซ็น",
      "content": "เมื่อเอกสารได้รับการลงลายเซ็นแล้ว ใช้เครื่องมือการตรวจสอบของเราเพื่อให้แน่ใจว่าข้อมูลลายเซ็นนั้นถูกต้อง ค้นหาและดึงคืนรายชื่อทั้งหมดของลายเซ็นเพื่อการประมวลผลเพิ่มเติม."
    },
    "feature_3": {
      "title": "ปรับปรุงลายเซ็นตามต้องการ",
      "content": "แก้ไขลายเซ็นที่หลากหลายที่ถูกใช้ในเอกสารได้โดยไม่ยุ่งยาก ปรับปรุงคุณสมบัติเช่น ขนาด สี ตำแหน่ง เนื้อหา และอื่น ๆ."
    },
    "feature_4": {
      "title": "ลบลายเซ็น",
      "content": "ต้องการลบลายเซ็นออกจากเอกสารหรือไม่? API ของเราสนับสนุนการลบลายเซ็นอย่างเต็มที่ ทำให้การจัดการเอกสารของคุณมีประสิทธิภาพ."
    }
  },
  "formats": {
    "title": "เพิ่มตราประทับในรูปแบบไฟล์หลายประเภท",
    "description": "API {{ProdShortName}} สนับสนุนการสร้างตราประทับในเอกสารกว่า 60 รูปแบบ วางตราประทับในทุกหน้า หรือพื้นที่ใดก็ได้เพื่อปรับปรุงการจัดการและการปรับแต่งเอกสาร."
  },
  "operations": {
    "title": "สำรวจฟีเจอร์หลักของเรา",
    "description": "ใช้ตัวเลือกที่หลากหลายสำหรับการเพิ่ม จัดการ และลบลายเซ็น."
  },
  "examples": {
    "comment_1": "ใช้เส้นทางเอกสารร่วมกับอ็อบเจ็กต์ {{TextSignature}}",
    "comment_2": "สร้างอ็อบเจ็กต์ {{StampSignOptions}} ด้วยข้อความลายเซ็นที่ต้องการ",
    "comment_3": "เพิ่มหนึ่งหรือหลายบรรทัดตราประทับ",
    "comment_4": "บันทึกเอกสารที่มีตราประทับ"
  },
  "steps": {
    "title": "ขั้นตอนในการเพิ่มตราประทับลงใน {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) มีคอนสตรัคเตอร์ตราประทับที่สามารถเป็นประโยชน์มากสำหรับแอปพลิเคชัน {{EnvName}} ใช้เพื่อสร้างตราประทับที่ปรับแต่งได้ดีสำหรับหน้าเอกสารของคุณ.",
      "step_1": "จัดเตรียมเอกสาร {{FileFormatUp}} ที่ต้องการตราประทับ.",
      "step_2": "ใช้ {{StampSignOptions}} เพื่อกำหนดพารามิเตอร์ที่จำเป็นทั้งหมด.",
      "step_3": "เพิ่มจำนวนบรรทัดตามที่ต้องการ.",
      "step_4": "นำตราประทับไปใช้และบันทึกเอกสาร."
    }
  },
  "code_1": {
    "title": "เพิ่มตราประทับที่กำหนดเองลงในเอกสารโดยใช้ลายเซ็นพิเศษ",
    "content": "เรียนรู้วิธีการสร้างและเพิ่มตราประทับที่กำหนดเองซึ่งมีข้อมูลข้อความสำคัญลงในเอกสารของคุณ.",
    "comment_1": "จัดเตรียมเอกสารที่จะตราประทับ",
    "comment_2": "สร้างอ็อบเจ็กต์ตัวเลือกตราประทับ",
    "comment_3": "กำหนดขนาดและตำแหน่งบนหน้า",
    "comment_4": "เพิ่มบรรทัดกลมภายนอกหนึ่งหรือหลายบรรทัดพร้อมกับข้อความ",
    "comment_5": "เพิ่มบรรทัดสี่เหลี่ยมภายในหนึ่งหรือหลายบรรทัด",
    "comment_6": "บันทึกเอกสารที่มีตราประทับ"
  }
}