{
  "head": {
    "title": "Округлі та квадратні штампи {{FileFormatUp}} через {{ProgLang}}",
    "description": "Використовуйте {{ProdFullName}} для генерації та встраювання персоналізованих штампів у файли {{FileFormatUp}}."
  },
  "header": {
    "title": "Генеруйте штампи для файлів {{FileFormatUp}}",
    "description": "Безшовно інтегруйте штампи з індивідуальним дизайном у будь-яку частину ваших документів за допомогою {{ProdFullName}}, що пропонує значну гнучкість для розташування та налаштування штампів, відповідно до ваших бізнес-потреб.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Отримайте безкоштовне завантаження"
  },
  "about": {
    "title": "Огляд {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) – це універсальний інструмент, що дозволяє вставляти кілька типів підписів у документи, включаючи налаштовувані штампи. Підтримуючи вражаючі 60 форматів файлів, від PDF та документів Word до зображень і ZIP-файлів, ви можете збагачувати свої документи текстом, зображеннями, штрих-кодами, метаданими, цифровими сертифікатами та штампами. Крім того, у вас є повний контроль для пошуку, валідації, модифікації або видалення будь-яких підписів, застосованих до ваших файлів."
  },
  "more_features": {
    "title": "Використовуйте підписи для забезпечення та покращення цілісності документів",
    "description": "З бібліотекою {{ProdFullName}} ви можете безшовно інтегрувати функціональність підпису у свої документи. Легко додавайте, модифікуйте, перевіряйте або видаляйте індивідуальні штампи та інші типи підписів, забезпечуючи гнучкість та точність для безпечного управління документами.",
    "image_description": "Штамп підписів на основі {{ProdShortName}}",
    "feature_1": {
      "title": "Комплексне підписування документів",
      "content": "Покращуйте свої документи, розміщуючи підписи, включаючи текст, зображення, штрих-коди, QR-коди та штампи, у будь-якій позиції чи на сторінці у файлі. Додатково керуйте вбудованими метаданими та застосовуйте цифрові сертифікати для захисту від несанкціонованих змін."
    },
    "feature_2": {
      "title": "Ефективний пошук і валідація підписів",
      "content": "Після підписання перевіряйте автентичність і цілісність підписів документів. Використовуйте розширену функцію пошуку для отримання та управління всіма даними підпису, вбудованими в документ."
    },
    "feature_3": {
      "title": "Модифікація та налаштування підписів",
      "content": "Налаштовуйте раніше вставлені підписи без особливих зусиль. Незалежно від того, чи потрібно змінити вміст, позицію, розмір чи колір, наше рішення пропонує повну гнучкість для модифікації підписів."
    },
    "feature_4": {
      "title": "Легко видаляйте підписи",
      "content": "Коли підписи потрібно видалити, {{ProdFullName}} надає повний набір інструментів для видалення будь-якого типу підпису, включаючи штампи, цифрові сертифікати та інше, забезпечуючи актуальність і відповідність ваших документів."
    }
  },
  "formats": {
    "title": "Застосовуйте штампи в різних форматах документів",
    "description": "API {{ProdShortName}} дозволяє вбудовувати штампи у понад 60 стандартних типів файлів галузі. Легко застосовуйте індивідуальні штампи у будь-якому місці ваших документів, що сприяє покращенню відстеження та персоналізації документів."
  },
  "operations": {
    "title": "Досліджуйте основні функції",
    "description": "Відкрийте для себе широкий спектр можливостей створення, управління та видалення різних типів підписів, забезпечуючи повний контроль над вашими робочими процесами документів."
  },
  "examples": {
    "comment_1": "Інтегруйте шлях до документа з екземпляром {{TextSignature}}",
    "comment_2": "Ініціалізуйте {{StampSignOptions}} з необхідним вмістом підпису",
    "comment_3": "Включіть одну або кілька рядків штампа",
    "comment_4": "Збережіть документ з застосованим штампом"
  },
  "steps": {
    "title": "Як вбудувати штамп у {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) пропонує потужну функцію створення штампів, ідеальну для покращення {{EnvName}} програм. Використовуйте цей інструмент для проектування та реалізації надзвичайно індивідуалізованих штампів на сторінках ваших документів.",
      "step_1": "Надайте документ {{FileFormatUp}}, що підлягає штампуванню.",
      "step_2": "Використовуйте {{StampSignOptions}}, щоб ретельно налаштувати всі необхідні параметри.",
      "step_3": "Додайте кілька рядків штампа відповідно до ваших вимог.",
      "step_4": "Застосуйте налаштований штамп і збережіть змінений документ."
    }
  },
  "code_1": {
    "title": "Впровадження індивідуальних штампів у документи",
    "content": "Досліджуйте, як створити і інтегрувати індивідуальні штампи з важливими текстовими деталями у ваші документи.",
    "comment_1": "Надайте документ, що підлягає штампуванню",
    "comment_2": "Ініціалізуйте параметри штампа з бажаними налаштуваннями",
    "comment_3": "Визначте розміри та позицію штампа на сторінці",
    "comment_4": "Додайте зовнішні круглі лінії з текстом",
    "comment_5": "Включіть внутрішні квадратні лінії за необхідності",
    "comment_6": "Завершіть і збережіть документ зі штампом"
  }
}