{
  "head": {
    "title": "ایجاد و افزودن مهرها به {{FileFormatUp}} از طریق {{ProgLang}}",
    "description": "از قدرت {{ProdShortName}} و {{ProgLang}} بهره ببرید تا مهرهای سفارشی را بر روی هر صفحه‌ای از مدارک {{FileFormatUp}} خود ایجاد و قرار دهید."
  },
  "header": {
    "title": "ادغام مهرهای سفارشی در فایل‌های {{FileFormatUp}}",
    "description": "از {{ProdFullName}} برای ایجاد مهرهای اختصاصی و افزودن آن‌ها در هر مکان از مدارک خود بهره ببرید. پلتفرم ما گزینه‌های وسیعی را برای سفارشی‌سازی مهرها بر اساس نیازهای خاص کسب‌وکار شما فراهم می‌کند.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "آزمون رایگان"
  },
  "about": {
    "title": "{{ProdFullName}} چیست؟",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) یک راه‌حل قوی و چندمنظوره برای امضای مدارک فراهم می‌کند. این ابزار به کاربران امکان می‌دهد تا با استفاده از بیش از 60 فرمت مختلف، شامل PDF، Word، Excel، فایل‌های تصویری و فایل‌های ZIP، مهرها و سایر نوع‌های امضا را اضافه کنند. پلتفرم به شما اجازه می‌دهد تا متن، تصویر، بارکد، کد QR، متادیتا، گواهی‌های دیجیتال و امضاهای مهر را وارد کنید. علاوه بر امضا، می‌توانید هر امضای موجود در مدارک خود را جستجو، تأیید، ویرایش یا حذف کنید."
  },
  "more_features": {
    "title": "تقویت امنیت مدارک با امضاها",
    "description": "با کمک {{ProdFullName}} می‌توانید مهرها و سایر نوع‌های امضا را در تمام فرمت‌های مدارک محبوب اضافه، ویرایش، تأیید یا حذف کنید. API این پلتفرم فرآیند مدیریت امضاها را ساده‌سازی می‌کند تا یکپارچگی و سفارشی‌سازی مدارک بهبود یابد.",
    "image_description": "ویژگی‌های {{ProdShortName}}",
    "feature_1": {
      "title": "امضای سفارشی مدارک",
      "content": "امضاهایی مانند متن، تصویر، بارکد، کد QR و مهر را به هر قسمت از مدارک خود اعمال کنید. این ابزار همچنین اجازه می‌دهد تا متادیتای پنهان و گواهی‌های دیجیتال برای محافظت بیشتر محتوای شما از تغییرات غیرمجاز اضافه شود."
    },
    "feature_2": {
      "title": "جستجو و تأیید امضا",
      "content": "بعد از امضای یک سند، از سیستم تأیید ما برای اطمینان از یکپارچگی امضاها استفاده کنید. علاوه بر این، پلتفرم ما این امکان را به شما می‌دهد تا با جستجو، اطلاعات دقیقی درباره تمام امضاهای اعمال شده بر روی یک سند را بازیابی کنید."
    },
    "feature_3": {
      "title": "ویرایش امضاها به نیاز",
      "content": "امضاهای قبلاً اعمال شده را بر اساس نیازتان تنظیم و به‌روزرسانی کنید. چه بخواهید محتوا، رنگ، اندازه یا موقعیت امضا را تغییر دهید، {{ProdFullName}} گزینه‌های کامل سفارشی‌سازی را ارائه می‌دهد."
    },
    "feature_4": {
      "title": "حذف امضاهای غیرضروری",
      "content": "به راحتی هر امضای غیرضروری را از مدارک خود حذف کنید. API ما از حذف طیف وسیعی از نوع‌های امضا، از جمله مهرها و گواهی‌های دیجیتال، پشتیبانی می‌کند و به شما انعطاف‌پذیری کامل برای مدیریت مدارکتان را می‌دهد."
    }
  },
  "formats": {
    "title": "اعمال امضای مهر بر روی انواع مختلف فایل",
    "description": "API {{ProdShortName}} از امضای مهر در بیش از 60 فرمت فایل پشتیبانی می‌کند و به کاربران اجازه می‌دهد تا مهرهای سفارشی را بر روی هر صفحه یا منطقه‌ای قرار دهند و دسترسی و امنیت مدارک را بهبود ببخشند."
  },
  "operations": {
    "title": "ویژگی‌های کلیدی را کاوش کنید",
    "description": "راه‌حل ما مجموعه‌ای از ابزارها را برای ایجاد، مدیریت، و حذف انواع مختلف امضاها ارائه می‌دهد و کنترل کامل بر روی گردش کار مدارک را به کاربران می‌دهد."
  },
  "examples": {
    "comment_1": "مسیر سند را با نمونه {{TextSignature}} مرتبط کنید",
    "comment_2": "ایجاد {{StampSignOptions}} با محتوای امضای ضروری",
    "comment_3": "یک یا چند خط مهر را درج کنید",
    "comment_4": "سند را با مهر اعمال شده ذخیره کنید"
  },
  "steps": {
    "title": "راهنمای افزودن مهرها به {{FileFormatUp}} با استفاده از {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ابزاری قدرتمند برای ایجاد و افزودن مهرها به مدارک فراهم می‌کند که می‌تواند برنامه‌های {{EnvName}} را به طور قابل توجهی بهبود بخشد. از این ویژگی برای طراحی و اعمال مهرهای سفارشی بر روی صفحات مدارک خود استفاده کنید.",
      "step_1": "مدرکی از نوع {{FileFormatUp}} که نیاز به مهر دارد را وارد کنید.",
      "step_2": "از {{StampSignOptions}} برای تعریف تمام پارامترهای ضروری استفاده کنید.",
      "step_3": "به تعداد مورد نیاز خطوط مهر را وارد کنید.",
      "step_4": "مهر را اعمال کرده و سند نهایی را ذخیره کنید."
    }
  },
  "code_1": {
    "title": "ادغام مهرهای سفارشی در مدارک",
    "content": "یاد بگیرید که چگونه مهرهای سفارشی با متن‌های ضروری را برای مدارک خود طراحی و اعمال کنید.",
    "comment_1": "مدرک را برای مهر زدن فراهم کنید",
    "comment_2": "گزینه‌های مهر را با پیکربندی‌های مورد نظر تنظیم کنید",
    "comment_3": "ابعاد و موقعیت مهر را بر روی صفحه مشخص کنید",
    "comment_4": "خطوط دایره‌ای بیرونی با متن سفارشی اضافه کنید",
    "comment_5": "خطوط داخلی مربع را در صورت نیاز اضافه کنید",
    "comment_6": "مدرک مهرخورده را ذخیره کنید"
  }
}