{
  "head": {
    "title": "Круглые и квадратные штампы {{FileFormatUp}} через {{ProgLang}}",
    "description": "Используйте {{ProdFullName}} для генерации и внедрения персонализированных штампов в файлы {{FileFormatUp}}."
  },
  "header": {
    "title": "Генерация штампов для файлов {{FileFormatUp}}",
    "description": "Бесшовно интегрируйте индивидуально разработанные штампы в любой раздел ваших документов с помощью {{ProdFullName}}, предлагая широкую гибкость для размещения и настройки штампов в соответствии с вашими бизнес-потребностями.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Получите бесплатную загрузку"
  },
  "about": {
    "title": "Обзор {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — это универсальный инструмент, позволяющий вставлять несколько типов подписей в документы, включая настраиваемые штампы. Поддерживает более 60 форматов файлов, от PDF и документов Word до изображений и ZIP-файлов, вы можете обогатить ваши документы текстом, изображениями, штрих-кодами, метаданными, цифровыми сертификатами и штампами. Более того, у вас есть полный контроль для поиска, проверки, модификации или удаления любых подписей, примененных к вашим файлам."
  },
  "more_features": {
    "title": "Используйте подписи для обеспечения безопасности и повышения целостности документов",
    "description": "С библиотекой {{ProdFullName}} вы можете бесшовно интегрировать функциональные возможности подписи в ваши документы. Добавляйте, модифицируйте, проверяйте или удаляйте пользовательские штампы и другие типы подписей, обеспечивая гибкость и точность для безопасного управления документами.",
    "image_description": "Штамповые подписи на базе {{ProdShortName}}",
    "feature_1": {
      "title": "Всеобъемлющее подписание документов",
      "content": "Улучшите ваши документы, размещая подписи, включая текст, изображения, штрих-коды, QR-коды и штампы, в любом месте или на любой странице в файле. Кроме того, управляйте встроенными метаданными и применяйте цифровые сертификаты для защиты от несанкционированных изменений."
    },
    "feature_2": {
      "title": "Эффективный поиск и проверка подписей",
      "content": "После подписания проверьте подлинность и целостность подписей документа. Используйте расширенные функции поиска для извлечения и управления всеми данными подписи, встроенными в документ."
    },
    "feature_3": {
      "title": "Модификация и настройка подписей",
      "content": "Легко изменяйте ранее вставленные подписи. Независимо от того, требуется ли изменить содержимое, позицию, размер или цвет, наше решение предлагает полную гибкость для модификации подписей."
    },
    "feature_4": {
      "title": "Удаление подписей без усилий",
      "content": "Когда необходимо удалить подписи, {{ProdFullName}} предоставляет полный набор инструментов для удаления любого типа подписи, включая штампы, цифровые сертификаты и многое другое, обеспечивая актуальность и соответствие ваших документов."
    }
  },
  "formats": {
    "title": "Применение штампов в различных форматах документов",
    "description": "API {{ProdShortName}} позволяет встраивать штампы в более чем 60 стандартных типов файлов. Легко применяйте пользовательские штампы в любом месте ваших документов, обеспечивая улучшенное отслеживание и персонализацию документов."
  },
  "operations": {
    "title": "Изучите основные функции",
    "description": "Откройте для себя широкий спектр возможностей для создания, управления и удаления различных типов подписей, обеспечивая полный контроль над вашими рабочими процессами документов."
  },
  "examples": {
    "comment_1": "Интегрируйте путь к документу с экземпляром {{TextSignature}}",
    "comment_2": "Инициализируйте {{StampSignOptions}} с необходимым содержимым подписи",
    "comment_3": "Включите одну или несколько строк штампа",
    "comment_4": "Сохраните документ с примененным штампом"
  },
  "steps": {
    "title": "Как встроить штамп в {{FileFormatUp}} с помощью {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) предлагает мощную функцию создания штамповых подписей, идеально подходящую для улучшения приложений {{EnvName}}. Используйте этот инструмент для проектирования и реализации высоко индивидуализированных штампов на страницах ваших документов.",
      "step_1": "Предоставьте документ {{FileFormatUp}}, который нужно подписать.",
      "step_2": "Используйте {{StampSignOptions}} для тщательной настройки всех необходимых параметров.",
      "step_3": "Добавьте несколько строк штампа в соответствии с вашими требованиями.",
      "step_4": "Примените настроенный штамп и сохраните измененный документ."
    }
  },
  "code_1": {
    "title": "Реализация пользовательских штампов в документах",
    "content": "Узнайте, как создавать и интегрировать пользовательские штампы с важными текстовыми данными в ваши документы.",
    "comment_1": "Укажите документ, который необходимо подпечатать",
    "comment_2": "Инициализируйте параметры штампа с желаемыми настройками",
    "comment_3": "Определите размеры и положение штампа на странице",
    "comment_4": "Включите внешние круговые линии с текстом",
    "comment_5": "Интегрируйте внутренние квадратные линии при необходимости",
    "comment_6": "Завершите и сохраните документ со штампом"
  }
}