{
  "head": {
    "title": "สร้างตราประทับกลมและสี่เหลี่ยมใน {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "สร้างและแทรกตราประทับส่วนบุคคลลงในไฟล์ {{FileFormatUp}} ด้วย API {{ProdFullName}}."
  },
  "header": {
    "title": "สร้างตราประทับสำหรับ {{FileFormatUp}}",
    "description": "เพิ่มตราประทับที่ออกแบบเองลงในเอกสารของคุณได้จากทุกส่วนด้วย {{ProdFullName}} ซึ่งนำเสนอความยืดหยุ่นในการวางและการกำหนดค่าตามความต้องการทางธุรกิจของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดได้ฟรี"
  },
  "about": {
    "title": "ภาพรวมของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือที่ครบถ้วนซึ่งช่วยให้คุณแทรกประเภทลายเซ็นต่าง ๆ ลงในเอกสาร รวมถึงตราประทับที่กำหนดเอง รองรับกว่า 60 รูปแบบไฟล์ - ตั้งแต่ PDFs และเอกสาร Word จนถึงรูปภาพและไฟล์ ZIP - คุณสามารถเสริมเอกสารของคุณด้วยข้อความ, รูปภาพ, บาร์โค้ด, เมตาดาต้า, ใบรับรองดิจิทัล และตราประทับ คุณยังมีการควบคุมแบบเต็มที่ในการค้นหา, ตรวจสอบ, แก้ไข, หรือลบลายเซ็นที่ใช้แล้ว."
  },
  "more_features": {
    "title": "ใช้ลายเซ็นในการรักษาความปลอดภัยและปรับปรุงความสมบูรณ์ของเอกสาร",
    "description": "ด้วยไลบรารี {{ProdFullName}} คุณสามารถเพิ่มฟังก์ชันการลงนามลงในเอกสารของคุณได้อย่างราบรื่น สร้าง, แก้ไข, ตรวจสอบ หรือ ลบตราประทับและประเภทลายเซ็นอื่น ๆ ได้อย่างง่ายดาย มอบความยืดหยุ่นและความปลอดภัยให้กับกระบวนการทำงานเอกสารของคุณ.",
    "image_description": "ลายเซ็นตราประทับที่ขับเคลื่อนโดย {{ProdShortName}}",
    "feature_1": {
      "title": "การลงนามเอกสารครบถ้วน",
      "content": "ยกระดับเอกสารของคุณด้วยการเพิ่มลายเซ็นเช่น ข้อความ, รูปภาพ, บาร์โค้ด, รหัส QR, และตราประทับในตำแหน่งใด ๆ บนหน้าใดก็ได้ จัดการเมตาดาต้าที่ฝังอยู่และใช้ใบรับรองดิจิทัลเพื่อป้องกันไม่ให้มีการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต."
    },
    "feature_2": {
      "title": "การค้นหาและตรวจสอบลายเซ็นที่มีประสิทธิภาพ",
      "content": "หลังจากการลงนาม ใช้เครื่องมือค้นหาขั้นสูงในการค้นหาลายเซ็นที่ฝังอยู่ทั้งหมด ตรวจสอบหรืจัดการข้อมูลลายเซ็นเพื่อให้มั่นใจในความสมบูรณ์ของเอกสาร."
    },
    "feature_3": {
      "title": "แก้ไขและปรับแต่งลายเซ็น",
      "content": "ทำการเปลี่ยนแปลงต่อไปยังลายเซ็นที่เพิ่มเข้าไปได้อย่างง่ายดาย ไม่ว่าคุณจะต้องการเปลี่ยนเนื้อหา, ตำแหน่ง, ขนาด, หรือสี {{ProdFullName}} จะให้การควบคุมแบบเต็มที่แก่คุณในการปรับแต่งลายเซ็นตามต้องการ."
    },
    "feature_4": {
      "title": "ลบลายเซ็นได้อย่างง่ายดาย",
      "content": "หากคุณจำเป็นต้องลบลายเซ็น {{ProdFullName}} มีเครื่องมือทุกอย่างที่จำเป็นในการลบทุกประเภท รวมถึงตราประทับและใบรับรองดิจิทัล เพื่อช่วยให้เอกสารของคุณทันสมัยและสอดคล้อง."
    }
  },
  "formats": {
    "title": "ประยุกต์ใช้ตราประทับกับรูปแบบเอกสารต่าง ๆ",
    "description": "ด้วย API {{ProdShortName}} คุณสามารถแทรกตราประทับแบบกำหนดเองลงในไฟล์มาตรฐานมากกว่า 60 ประเภท ประยุกต์ใช้ตราประทับได้ทุกที่ในเอกสารของคุณ เพื่อเพิ่มความสามารถในการปรับแต่งและติดตาม."
  },
  "operations": {
    "title": "สำรวจฟีเจอร์หลัก",
    "description": "ค้นหาหมายเลขตัวเลือกในการสร้าง, จัดการ, และลบลายเซ็น เพื่อมอบการควบคุมแบบเต็มที่ต่อกระบวนการทำงานเอกสาร."
  },
  "examples": {
    "comment_1": "แนบเส้นทางเอกสารไปยังอินสแตนซ์ {{TextSignature}}",
    "comment_2": "ตั้งค่า {{StampSignOptions}} ด้วยรายละเอียดตราประทับที่ต้องการ",
    "comment_3": "เพิ่มบรรทัดหนึ่งหรือหลายบรรทัดลงในตราประทับ",
    "comment_4": "บันทึกเอกสารพร้อมตราประทับที่ใช้"
  },
  "steps": {
    "title": "วิธีการเพิ่มตราประทับลงใน {{FileFormatUp}} ด้วย {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ให้เครื่องมือการสร้างตราประทับที่แข็งแกร่งสำหรับการปรับปรุงแอปพลิเคชัน {{EnvName}} ของคุณ ใช้เพื่อออกแบบและนำตราประทับที่กำหนดเองไปยังหน้าสมุดของเอกสารของคุณ.",
      "step_1": "จัดเตรียมเอกสาร {{FileFormatUp}} ที่คุณต้องการจะติดตราประทับ.",
      "step_2": "ใช้ {{StampSignOptions}} เพื่อกำหนดการตั้งค่าทั้งหมดที่จำเป็น.",
      "step_3": "เพิ่มบรรทัดตราประทับซํ้าหากจำเป็น.",
      "step_4": "นำตราประทับไปใช้และบันทึกรายละเอียดเอกสาร."
    }
  },
  "code_1": {
    "title": "วิธีการเพิ่มตราประทับแบบกำหนดเองลงในเอกสาร",
    "content": "ตัวอย่างนี้แสดงวิธีการสร้างและแทรกตราประทับที่กำหนดเองพร้อมรายละเอียดข้อความเฉพาะลงในเอกสาร.",
    "comment_1": "กำหนดเอกสารที่คุณต้องการจะติดตราประทับ",
    "comment_2": "ตั้งค่าตัวเลือกตราประทับด้วยการตั้งค่าที่คุณต้องการ",
    "comment_3": "กำหนดขนาดและตำแหน่งของตราประทับบนหน้า",
    "comment_4": "เพิ่มเส้นวงกลมภายนอกพร้อมข้อความ",
    "comment_5": "เพิ่มเส้นสี่เหลี่ยมภายในถ้าต้องการ",
    "comment_6": "ทำให้เสร็จสิ้นและบันทึกเอกสารที่มีตราประทับแล้ว"
  }
}