{
  "head": {
    "title": "Создайте круглые и квадратные штампы в {{FileFormatUp}} с использованием {{ProgLang}}",
    "description": "Генерируйте и вставляйте персонализированные штампы в файлы {{FileFormatUp}} с помощью API {{ProdFullName}}."
  },
  "header": {
    "title": "Создайте штампы для {{FileFormatUp}}",
    "description": "Добавьте индивидуально разработанные штампы в любую часть ваших документов с помощью {{ProdFullName}}, обеспечивая большую гибкость в размещении и настройке в соответствии с вашими бизнес-требованиями.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать бесплатно"
  },
  "about": {
    "title": "Обзор {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — это обширный инструмент, который позволяет вставлять различные типы подписей в документы, включая индивидуальные штампы. Поддерживая более 60 форматов файлов — от PDF и Word до изображений и ZIP — вы можете улучшать свои документы с помощью текста, изображений, штрих-кодов, метаданных, цифровых сертификатов и штампов. У вас также есть полный контроль для поиска, проверки, редактирования или удаления любых примененных подписей."
  },
  "more_features": {
    "title": "Используйте подписи для обеспечения безопасности и повышения целостности документов",
    "description": "С библиотекой {{ProdFullName}} вы можете бесшовно добавлять функциональность подписи в ваши документы. Создавайте, изменяйте, проверяйте или удаляйте индивидуальные штампы и другие типы подписей, обеспечивая гибкость и безопасность для ваших документальных процессов.",
    "image_description": "Подписи-штампы на основе {{ProdShortName}}",
    "feature_1": {
      "title": "Полная подпись документов",
      "content": "Улучшите свои документы, добавляя подписи, такие как текст, изображения, штрих-коды, QR-коды и штампы, в любое место на любой странице. Управляйте встроенными метаданными и применяйте цифровые сертификаты, чтобы защитить от несанкционированных изменений."
    },
    "feature_2": {
      "title": "Эффективный поиск и проверка подписей",
      "content": "После подписания используйте продвинутые инструменты поиска, чтобы найти все встроенные подписи. Легко проверяйте или управляйте данными подписи для обеспечения целостности документа."
    },
    "feature_3": {
      "title": "Редактирование и настройка подписей",
      "content": "Внесите изменения в ранее добавленные подписи. Будь то изменение содержимого, размещения, размера или цвета, {{ProdFullName}} предоставляет полный контроль для настройки подписей по мере необходимости."
    },
    "feature_4": {
      "title": "Легкое удаление подписей",
      "content": "Если вам нужно удалить подписи, {{ProdFullName}} предлагает все необходимые инструменты для удаления любого типа, включая штампы и цифровые сертификаты, что помогает поддерживать ваши документы в актуальном состоянии и соответствующими требованиям."
    }
  },
  "formats": {
    "title": "Применение штампов к различным форматам документов",
    "description": "С API {{ProdShortName}} вы можете вставлять индивидуальные штампы в более чем 60 стандартных типов файлов. Легко применяйте штампы в любом месте в ваших документах, улучшая персонализацию и отслеживание."
  },
  "operations": {
    "title": "Изучите ключевые функции",
    "description": "Найдите широкий спектр опций для создания, управления и удаления подписей, что даст вам полный контроль над процессами документов."
  },
  "examples": {
    "comment_1": "Прикрепите путь к документу к экземпляру {{TextSignature}}",
    "comment_2": "Настройте {{StampSignOptions}} с необходимыми деталями штампа",
    "comment_3": "Добавьте одну или несколько строк к штампам",
    "comment_4": "Сохраните документ с примененным штампом"
  },
  "steps": {
    "title": "Как добавить штамп к {{FileFormatUp}} с использованием {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) предоставляет мощные инструменты для создания штампов для улучшения приложений {{EnvName}}. Используйте их для разработки и внедрения индивидуальных штампов для страниц вашего документа.",
      "step_1": "Предоставьте документ {{FileFormatUp}}, который вы хотите обозначить.",
      "step_2": "Используйте {{StampSignOptions}} для настройки всех необходимых параметров.",
      "step_3": "При необходимости добавьте несколько строк штамп.",
      "step_4": "Примените штамп и сохраните обновленный документ."
    }
  },
  "code_1": {
    "title": "Как добавить индивидуальные штампы в документы",
    "content": "В этом примере показано, как создать и вставить индивидуальные штампы с конкретными текстовыми деталями в документ.",
    "comment_1": "Предоставьте документ, который вы хотите обозначить",
    "comment_2": "Настройте параметры штампа с желаемыми настройками",
    "comment_3": "Определите размер и размещение штампа на странице",
    "comment_4": "Добавьте внешние круговые линии с текстом",
    "comment_5": "При желании добавьте внутренние квадратные линии",
    "comment_6": "Завершите и сохраните документ с штампом"
  }
}