{
  "head": {
    "title": "Додайте штампи до {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Використовуйте {{ProdShortName}} та {{ProgLang}} для створення індивідуальних штампів і розміщення їх на будь-якій сторінці документів {{FileFormatUp}}."
  },
  "header": {
    "title": "Додайте індивідуальні штампи до {{FileFormatUp}}",
    "description": "Розробіть і застосуйте круглі або квадратні штампи до будь-якої частини ваших документів за допомогою {{ProdFullName}}. Наше рішення пропонує широкі можливості налаштування для задоволення всіх ваших бізнес-потреб.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажити безкоштовно"
  },
  "about": {
    "title": "Про {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — це потужний інструмент, який дозволяє додавати різноманітні штамповані сигнатури до документів. Він підтримує понад 60 різних форматів файлів, включаючи PDF, Word, Excel, зображення та ZIP-файли. Ви можете застосовувати текстові, зображення, штрих-коди, метадані, цифрові сертифікати та штамповані сигнатури. Окрім додавання сигнатур, ви можете шукати, перевіряти, змінювати та видаляти їх."
  },
  "more_features": {
    "title": "Захистіть вміст вашого документа за допомогою сигнатур",
    "description": "Бібліотека {{ProdFullName}} призначена для підписування та управління сигнатурами в популярних форматах файлів. Легко додавайте, модифікуйте, перевіряйте або видаляйте штампи та інші типи сигнатур.",
    "image_description": "Штамповані сигнатури з {{ProdShortName}}",
    "feature_1": {
      "title": "Підписуйте свої документи",
      "content": "Застосовуйте настроювані сигнатури до будь-якої частини документа. Вибирайте з різних типів сигнатур, включаючи текст, зображення, штрих-коди, QR-коди та штампи. Додатково можна додавати або змінювати приховані метадані для покращення безпеки документа."
    },
    "feature_2": {
      "title": "Шукайте та перевіряйте сигнатури",
      "content": "Після підписання документа використовуйте наші інструменти перевірки для забезпечення дійсності вмісту сигнатури. Шукайте та отримуйте список усіх сигнатур для подальшої обробки."
    },
    "feature_3": {
      "title": "Оновлюйте сигнатури за потреби",
      "content": "Легко змінюйте широкий спектр сигнатур, застосованих до документа. Оновлюйте такі властивості, як розмір, колір, положення, вміст тощо."
    },
    "feature_4": {
      "title": "Видаляйте сигнатури",
      "content": "Потрібно видалити сигнатури з документа? Наш API повністю підтримує видалення сигнатур, що значно полегшує управління вашими документами."
    }
  },
  "formats": {
    "title": "Додайте штампи в різні формати файлів",
    "description": "API {{ProdShortName}} підтримує штампування документів у понад 60 форматах. Розміщуйте штампи на будь-якій сторінці або ділянці для покращення управління документами та її налаштування."
  },
  "operations": {
    "title": "Досліджуйте наші основні функції",
    "description": "Використовуйте широкий спектр можливостей для додавання, управління та видалення сигнатур."
  },
  "examples": {
    "comment_1": "Використовуйте шлях документа з об'єктом {{TextSignature}}",
    "comment_2": "Створіть екземпляр {{StampSignOptions}} з бажаним текстом сигнатури",
    "comment_3": "Додайте одну або кілька ліній штампу",
    "comment_4": "Збережіть документ зі штампом"
  },
  "steps": {
    "title": "Кроки для додавання штампів до {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) надає конструктор штампів, який може бути вкрай корисним для додатків {{EnvName}}. Використовуйте його для створення добре настроєних штампів для сторінок ваших документів.",
      "step_1": "Надайте документ {{FileFormatUp}}, який потрібно штампувати.",
      "step_2": "Використовуйте {{StampSignOptions}} для налаштування всіх необхідних параметрів.",
      "step_3": "Додайте скільки завгодно ліній.",
      "step_4": "Застосуйте штамп і збережіть документ."
    }
  },
  "code_1": {
    "title": "Додайте індивідуальні штампи до документів за допомогою спеціальних сигнатур",
    "content": "Дізнайтеся, як генерувати й додавати індивідуальні штампи з важливою текстовою інформацією до ваших документів.",
    "comment_1": "Надайте документ для штампування",
    "comment_2": "Створіть екземпляр об'єкта параметрів штампу",
    "comment_3": "Встановіть розмір і положення на сторінці",
    "comment_4": "Додайте одну або кілька зовнішніх круглих ліній з текстом",
    "comment_5": "Додайте одну або кілька внутрішніх квадратних ліній",
    "comment_6": "Збережіть документ зі штампом"
  }
}