{
  "head": {
    "title": "ตราประทับกลมและสี่เหลี่ยม {{FileFormatUp}} ผ่าน {{ProgLang}}",
    "description": "ใช้ {{ProdFullName}} ในการสร้างและฝังตราประทับที่ปรับแต่งได้ในไฟล์ {{FileFormatUp}}."
  },
  "header": {
    "title": "สร้างตราประทับสำหรับไฟล์ {{FileFormatUp}}",
    "description": "บูรณาการตราประทับที่ออกแบบเองอย่างไร้รอยต่อในเอกสารของคุณโดยใช้ {{ProdFullName}} ซึ่งนำเสนอความยืดหยุ่นสูงสำหรับการวางตำแหน่งและการปรับแต่งตราประทับเพื่อตอบสนองความต้องการทางธุรกิจของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรีของคุณ"
  },
  "about": {
    "title": "ภาพรวมของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือที่หลากหลายซึ่งช่วยให้สามารถใส่ประเภทลายเซ็นหลายประเภทลงในเอกสาร รวมถึงตราประทับที่ปรับแต่งได้ รองรับไฟล์มากกว่า 60 รูปแบบ ตั้งแต่ PDF และเอกสาร Word ไปจนถึงภาพและไฟล์ ZIP คุณสามารถเพิ่มคุณค่าทำให้เอกสารของคุณในรูปแบบข้อความ รูปภาพ บาร์โค้ด ข้อมูลเมตา ใบรับรองดิจิทัล และตราประทับ นอกจากนี้ คุณยังสามารถค้นหา ตรวจสอบ แก้ไข หรือเอาลายเซ็นที่ใช้บังคับไปแล้วออกจากไฟล์ของคุณได้อย่างเต็มที่."
  },
  "more_features": {
    "title": "ใช้ลายเซ็นเพื่อรักษาความปลอดภัยและเพิ่มความสมบูรณ์ของเอกสาร",
    "description": "ด้วยไลบรารี {{ProdFullName}} คุณสามารถบูรณาการฟังก์ชันการลงนามอย่างไร้รอยต่อในเอกสารของคุณ ได้อย่างสะดวกสบายในการเพิ่ม แก้ไข ตรวจสอบ หรือเอาลายเซ็นประเภทอื่นและตราประทับแบบกำหนดเองออกให้ความยืดหยุ่นและความแม่นยำในการจัดการเอกสารอย่างปลอดภัย.",
    "image_description": "ตราประทับที่ลงนาม ด้วยเทคโนโลยีจาก {{ProdShortName}}",
    "feature_1": {
      "title": "การลงนามเอกสารที่ครอบคลุม",
      "content": "เพิ่มมูลค่าให้กับเอกสารของคุณโดยการวางลายเซ็น รวมถึงข้อความ รูปภาพ บาร์โค้ด QR โค้ด และตราประทับ ในตำแหน่งหรือหน้าที่ใดก็ได้ในไฟล์ นอกจากนี้ยังสามารถจัดการข้อมูลเมตาที่ฝังไว้และใช้ใบรับรองดิจิทัลเพื่อป้องกันการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต."
    },
    "feature_2": {
      "title": "การค้นหาและตรวจสอบลายเซ็นที่มีประสิทธิภาพ",
      "content": "หลังจากการลงนาม ตรวจสอบความถูกต้องและความสมบูรณ์ของลายเซ็นในเอกสาร ใช้ฟังก์ชันค้นหาที่ทันสมัยเพื่อดึงและจัดการข้อมูลลายเซ็นทั้งหมดที่ฝังอยู่ในเอกสาร."
    },
    "feature_3": {
      "title": "ปรับแต่งและปรับเปลี่ยนลายเซ็น",
      "content": "ปรับเปลี่ยนลายเซ็นที่ถูกใส่ก่อนหน้านี้ได้อย่างง่ายดาย ไม่ว่าคุณจะต้องการเปลี่ยนเนื้อหา ตำแหน่ง ขนาด หรือสี โซลูชันของเรามอบความยืดหยุ่นเต็มที่สำหรับการปรับเปลี่ยนลายเซ็น."
    },
    "feature_4": {
      "title": "ลบลายเซ็นได้อย่างราบรื่น",
      "content": "เมื่อจำเป็นต้องลบลายเซ็น {{ProdFullName}} จะให้ชุดเครื่องมือที่ครบถ้วนในการลบลายเซ็นประเภทใดก็ได้ รวมถึงตราประทับ ใบรับรองดิจิทัล และอื่น ๆ เพื่อให้เอกสารของคุณทันสมัยและสอดคล้อง."
    }
  },
  "formats": {
    "title": "ใช้ตราประทับในรูปแบบเอกสารที่หลากหลาย",
    "description": "API ของ {{ProdShortName}} ช่วยให้คุณฝังตราประทับในไฟล์ประเภทมาตรฐานในอุตสาหกรรมกว่า 60 ประเภท สามารถประยุกต์ใช้ตราประทับที่กำหนดเองในตำแหน่งใดก็ได้ภายในเอกสารของคุณ ทำให้สามารถติดตามและปรับแต่งเอกสารได้ดีขึ้น."
  },
  "operations": {
    "title": "สำรวจฟังก์ชันหลัก",
    "description": "ค้นพบโอกาสมากมายในการสร้าง จัดการ และลบประเภทลายเซ็นต่างๆ เพื่อให้แน่ใจว่าคุณสามารถควบคุมการทำงานของเอกสารได้อย่างครบถ้วน."
  },
  "examples": {
    "comment_1": "รวมเส้นทางเอกสารกับอินสแตนซ์ {{TextSignature}}",
    "comment_2": "เริ่มต้น {{StampSignOptions}} ด้วยเนื้อหาลายเซ็นที่จำเป็น",
    "comment_3": "นำเสนอสายในตราที่กำหนดเองหนึ่งหรือหลายสายในครั้งเดียว",
    "comment_4": "เก็บรักษาเอกสารพร้อมกับตราที่ใช้แล้ว"
  },
  "steps": {
    "title": "วิธีฝังตราในไฟล์ {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) นำเสนอฟีเจอร์การสร้างตราที่มีประสิทธิภาพ เหมาะสำหรับการเพิ่มประสิทธิภาพแอพพลิเคชั่น {{EnvName}} ใช้เครื่องมือนี้ในการออกแบบและเพิ่มตราประทับที่ปรับแต่งสูงในหน้าของเอกสารของคุณ.",
      "step_1": "ให้เอกสาร {{FileFormatUp}} ที่ต้องการเพิ่มตรา.",
      "step_2": "ใช้ {{StampSignOptions}} เพื่อกำหนดค่าพารามิเตอร์ที่จำเป็นทั้งหมด.",
      "step_3": "เพิ่มหลายสายในตราตามที่คุณต้องการ.",
      "step_4": "ใช้ตราที่กำหนดค่าแล้วและบันทึกเอกสารที่แก้ไขแล้ว."
    }
  },
  "code_1": {
    "title": "นำเข้าตราประทับแบบกำหนดเองในเอกสาร",
    "content": "ค้นพบวิธีการสร้างและรวมตราประทับแบบกำหนดเองที่มีรายละเอียดทางข้อความสำคัญลงในเอกสารของคุณ.",
    "comment_1": "จัดเตรียมเอกสารที่จะเพิ่มตรา",
    "comment_2": "เริ่มต้นตัวเลือกตราด้วยการตั้งค่าที่ต้องการ",
    "comment_3": "กำหนดขนาดและตำแหน่งของตราบนหน้า",
    "comment_4": "เพิ่มเส้นวงกลมด้านนอกพร้อมข้อความ",
    "comment_5": "รวมเส้นสี่เหลี่ยมด้านในหากจำเป็น",
    "comment_6": "เสร็จสิ้นและบันทึกเอกสารที่มีตรา"
  }
}