{
  "head": {
    "title": "ลงนามไฟล์ {{FileFormatUp}} ด้วยลายเซ็นอิเล็กทรอนิกส์ใน {{ProgLang}}",
    "description": "ใช้ความสามารถของ API {{ProgLang}} ในการลงนามดิจิทัลและปกป้องไฟล์ {{FileFormatUp}} รวมถึง PDF, เอกสาร Word, แผ่น Excel, การนำเสนอ และรูปแบบภาพต่างๆ"
  },
  "header": {
    "title": "ลงนามไฟล์ {{FileFormatUp}} ด้วยอิเล็กทรอนิกส์",
    "description": "ใช้ {{ProdFullName}} เพื่อแทรกลายเซ็นดิจิทัลที่หลากหลายลงในเอกสารของคุณ เพื่อความสมบูรณ์ของข้อมูลและความสอดคล้องสำหรับไฟล์ เช่น PDF, Word, Excel, การนำเสนอ และรูปแบบภาพต่างๆ",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรีตอนนี้"
  },
  "about": {
    "title": "ภาพรวมของ API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มาพร้อมกับชุดเครื่องมือที่แข็งแกร่งสำหรับการเพิ่มลายเซ็นอิเล็กทรอนิกส์ ด้วย API ที่ใช้งานง่าย คุณสามารถลงนาม ค้นหา ยืนยัน แก้ไข และลบลายเซ็นจากประเภทไฟล์ต่างๆ ได้อย่างไม่มีสะดุด โดยไม่ต้องใช้ซอฟต์แวร์ภายนอก สนับสนุนการลงนามที่ไร้รอยต่อสำหรับไฟล์ PDF, เอกสาร Word, สเปรดชีต Excel, สไลด์ PowerPoint และรูปแบบภาพต่างๆ"
  },
  "more_features": {
    "title": "ความสามารถในการลงนามดิจิทัลขั้นสูง",
    "description": "API ขั้นสูงของเราช่วยให้การดำเนินงานทางธุรกิจเป็นไปอย่างราบรื่น โดยอำนวยความสะดวกในการลงนาม ตรวจสอบ แก้ไข และจัดการลายเซ็นอิเล็กทรอนิกส์สำหรับเอกสารหลายประเภท",
    "image_description": "ฟีเจอร์ลายเซ็นดิจิทัล",
    "feature_1": {
      "title": "การลงนามดิจิทัลสำหรับไฟล์สำนักงาน",
      "content": "เพิ่มลายเซ็นดิจิทัลไปยังหน้าใดก็ได้หรือที่ตำแหน่งใดก็ได้ในเอกสาร ปรับแต่งลายเซ็นของคุณด้วยตัวเลือกต่างๆ เช่น ใบรับรองดิจิทัล เมตาดาต้า บาร์โค้ด หรือองค์ประกอบภาพเพื่อเสริมความปลอดภัยและความสมบูรณ์ของเอกสาร"
    },
    "feature_2": {
      "title": "การควบคุมลายเซ็นอย่างครบถ้วน",
      "content": "เมื่อเอกสารถูกลงนาม คุณสามารถจัดการลายเซ็นได้อย่างง่ายดาย ดึงรายการลายเซ็นทั้งหมด เพื่อให้คุณสามารถทำการปรับปรุงหรือเอาออกเมื่อจำเป็น"
    },
    "feature_3": {
      "title": "เสริมความปลอดภัยของเอกสาร",
      "content": "ใช้ใบรับรองดิจิทัลเพื่อปกป้องเอกสารจากการดัดแปลง คุณสามารถฝังหรือดึงเมตาดาต้าเพื่อเสริมการติดตามและการตรวจสอบ เพื่อให้มั่นใจในความสอดคล้องและความถูกต้องของเอกสาร"
    }
  },
  "formats": {
    "title": "ลงนามไฟล์หลายประเภทด้วยวิธีดิจิทัล",
    "description": "API {{EnvName}} ช่วยให้คุณสามารถนำลายเซ็นดิจิทัลไปใช้กับไฟล์กว่า 60 รูปแบบ ให้คุณมีความยืดหยุ่นสูงในการปกป้องเอกสารที่สำคัญต่อธุรกิจของคุณ"
  },
  "operations": {
    "title": "ดูความสามารถที่หลากหลายของเรา",
    "description": "เรามีลายเซ็นหลายประเภทและฟังก์ชันที่เต็มไปด้วยฟีเจอร์"
  },
  "examples": {
    "comment_1": "นำเข้าเอกสารเข้าไปในอินสแตนซ์ {{TextSignature}}",
    "comment_2": "สร้างวัตถุ {{QrCodeSignOptions}}",
    "comment_3": "ระบุค่าออปชันที่ต้องการทั้งหมด",
    "comment_4": "บันทึกเอกสารที่ลงนามลงในดิสก์ท้องถิ่น"
  },
  "steps": {
    "title": "ขั้นตอนในการลงนาม {{FileFormatUp}} ด้วย {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้กระบวนการเพิ่มลายเซ็นที่ปรับแต่งได้ลงในไฟล์ {{FileFormatUp}} เป็นไปอย่างราบรื่น นักพัฒนา {{EnvName}} สามารถรวมฟังก์ชันการลงนามเข้ากับแอปพลิเคชันของพวกเขาได้อย่างไม่มีสะดุด",
      "step_1": "โหลดเอกสาร {{FileFormatUp}} ลงในอินสแตนซ์ {{TextSignature}}",
      "step_2": "กำหนดค่า {{SignOptions}} เพื่อกำหนดลักษณะของลายเซ็น",
      "step_3": "ปรับแต่งคุณสมบัติเช่น ขนาด สี และเนื้อหาตามที่ต้องการ",
      "step_4": "บันทึกเอกสารที่ลงนามไปยังตำแหน่งที่ระบุ"
    }
  },
  "code_1": {
    "title": "วิธีการนำลายเซ็นภาพไปใช้กับเอกสาร",
    "content": "คู่มือนี้แสดงรายละเอียดกระบวนการสำหรับการติดตั้งลายเซ็นภาพไปยังหน้าที่กำหนดในเอกสาร",
    "comment_1": "ให้เอกสารต้นฉบับเป็นพารามิเตอร์นำเข้า",
    "comment_2": "ระบุเส้นทางไฟล์ภาพในออปชันการกำหนดค่าลายเซ็น",
    "comment_3": "กำหนดขนาดและระบุหน้าที่ต้องการสำหรับลายเซ็น",
    "comment_4": "ดำเนินการนำลายเซ็นไปใช้กับเอกสาร"
  }
}