{
  "head": {
    "title": "ลงนามไฟล์ {{FileFormatUp}} ด้วยแอป {{ProgLang}}",
    "description": "ใช้ API {{ProgLang}} ในการจัดการไฟล์ {{FileFormatUp}} และนำไปใช้กับประเภทของลายเซ็นต่างๆ รวมถึง PDF, Word, Excel, งานนำเสนอ และภาพ."
  },
  "header": {
    "title": "ลายเซ็นอิเล็กทรอนิกส์สำหรับ {{FileFormatUp}}",
    "description": "เพิ่มลายเซ็นอิเล็กทรอนิกส์ที่หลากหลายด้วย {{ProdFullName}} ให้กับฟอร์แมตทางธุรกิจยอดนิยมทั้งหมด รวมถึง PDF, Word, Excel, งานนำเสนอ และภาพ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีฟีเจอร์การลงนามอิเล็กทรอนิกส์ขั้นสูง ใช้เพื่อเพิ่ม ค้นหา ตรวจสอบ แก้ไข และลบประเภทของลายเซ็นอิเล็กทรอนิกส์ต่างๆ ในเอกสารและภาพ โดยไม่จำเป็นต้องใช้ซอฟต์แวร์ภายนอก ลงนาม PDF, เอกสาร Word, สเปรดชีต Excel, งานนำเสนอ PowerPoint และฟอร์แมตภาพยอดนิยมอย่างมีประสิทธิภาพ."
  },
  "more_features": {
    "title": "ลายเซ็นอิเล็กทรอนิกส์ในเอกสาร",
    "description": "API สำหรับการลงนามของเราทำให้กระบวนการทางธุรกิจเป็นไปได้อย่างราบรื่น ลงนาม ค้นหา อัปเดต ลบ และตรวจสอบลายเซ็นต่างๆ ได้อย่างเป็นระบบ.",
    "image_description": "ลายเซ็นอิเล็กทรอนิกส์",
    "feature_1": {
      "title": "ลงนามเอกสารสำนักงาน",
      "content": "กำหนดตำแหน่งลายเซ็นอิเล็กทรอนิกส์ได้อย่างอิสระในเอกสารในทุกๆ หน้า เพิ่มเนื้อหาในเอกสารด้วยข้อความ รูปภาพ บาร์โค้ด ข้อมูลเมตา หรือตัวรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "การจัดการลายเซ็น",
      "content": "หลังจากที่ลงนาม เอกสารสามารถดำเนินการต่อได้ ดึงข้อมูลลายเซ็นทั้งหมดที่มีอยู่ แก้ไข หรือหากไม่ต้องการสามารถลบได้ตามความจำเป็น."
    },
    "feature_3": {
      "title": "การควบคุมเนื้อหาขั้นสูง",
      "content": "ป้องกันเอกสารทางธุรกิจจากการเปลี่ยนแปลงที่ไม่ได้รับอนุญาตด้วยตัวรับรองดิจิทัลของบริษัท เพิ่มหรือนำเข้าข้อมูลเมตาที่ซ่อนอยู่ซึ่งมีอยู่ในทุกประเภทเอกสาร."
    }
  },
  "formats": {
    "title": "ลงนามในฟอร์แมตไฟล์ยอดนิยมด้วยลายเซ็นอิเล็กทรอนิกส์",
    "description": "API สำหรับการลงนามอิเล็กทรอนิกส์สำหรับ {{EnvName}} ทำให้สามารถจัดการกับฟอร์แมตไฟล์และเอกสารธุสรกิจที่ทันสมัยทั้งหมด."
  },
  "operations": {
    "title": "สำรวจฟีเจอร์หลักของเรา",
    "description": "เราภูมิใจในการเสนอการรองรับลายเซ็นและการดำเนินการอย่างหลากหลาย."
  },
  "examples": {
    "comment_1": "โหลดเอกสารเข้าสู่ตัวอย่าง {{TextSignature}}",
    "comment_2": "สร้างวัตถุ {{QrCodeSignOptions}}",
    "comment_3": "กำหนดค่าทุกตัวเลือกที่ต้องการ",
    "comment_4": "บันทึกไฟล์ที่มี QR code เพิ่มเติมลงในดิสก์ท้องถิ่น"
  },
  "steps": {
    "title": "ขั้นตอนการลงนาม {{FileFormatUp}} ด้วย {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) อนุญาตให้เพิ่มลายเซ็นที่กำหนดเองไปยังไฟล์ {{FileFormatUp}} นักพัฒนา {{EnvName}} สามารถรวมฟังก์ชันการลงนามเข้ากับแอปพลิเคชันของตนได้โดยใช้ซอฟต์แวร์ของเรา.",
      "step_1": "จัดเตรียมไฟล์ {{FileFormatUp}} ที่จะลงนามให้กับตัวอย่าง {{TextSignature}}.",
      "step_2": "ใช้ {{SignOptions}} เพื่อกำหนดรายละเอียดของลายเซ็น.",
      "step_3": "ปรับแต่งคุณสมบัติต่างๆ เช่น ขนาด สี และเนื้อหา.",
      "step_4": "บันทึกไฟล์ที่ลงนามในที่ตั้งที่ต้องการ."
    }
  },
  "code_1": {
    "title": "วิธีเพิ่มลายเซ็นรูปภาพในเอกสาร",
    "content": "ตัวอย่างนี้แสดงให้เห็นถึงวิธีการวางลายเซ็นรูปภาพบนหน้าที่เฉพาะของเอกสาร.",
    "comment_1": "จัดเตรียมเอกสารต้นทางเป็นพารามิเตอร์",
    "comment_2": "ระบุเส้นทางของภาพในตัวเลือกลายเซ็น",
    "comment_3": "ตั้งค่าขนาดและหน้าที่ต้องการสำหรับลายเซ็น",
    "comment_4": "นำลายเซ็นไปใช้กับเอกสาร"
  }
}