{
  "head": {
    "title": "Sign {{FileFormatUp}} via {{ProgLang}} electronically",
    "description": "Utilize {{FileFormatUp}} to add a range of electronic signature types to documents, ensuring security and compliance across formats like PDF, Word, Excel, Presentations, and Images."
  },
  "header": {
    "title": "Electronic signing of {{FileFormatUp}} files",
    "description": "Embed a variety of electronic signatures into your documents using {{ProdFullName}}, ensuring compliance and integrity for formats such as PDFs, Word, Excel, Presentations, and Images.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download for free"
  },
  "about": {
    "title": "About {{ProdFullName}} API",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) offers a comprehensive suite of electronic signing capabilities. With it, you can seamlessly add, search, verify, update, and remove digital signatures across a wide array of document types, without the need for third-party tools. It supports signing PDF files, Word documents, Excel sheets, PowerPoint presentations, and various image formats effortlessly."
  },
  "more_features": {
    "title": "Advanced document electronic signatures",
    "description": "Our sophisticated e-signing API enhances business workflows, enabling efficient signing, validation, modification, and management of electronic signatures with full automation capabilities.",
    "image_description": "Electronic signature capabilities",
    "feature_1": {
      "title": "Electronic signing for office documents",
      "content": "Seamlessly insert electronic signatures at any position within a document. Customize and enrich content with digital certificates, metadata, barcodes, or visual elements, while ensuring authenticity and security."
    },
    "feature_2": {
      "title": "Comprehensive signature management",
      "content": "Once signed, documents can be further processed with ease. Access a complete overview of existing signatures, enabling precise updates or deletion of signatures where necessary."
    },
    "feature_3": {
      "title": "Enhanced content security",
      "content": "Protect the integrity of your documents using digital certificates. Embed or extract metadata for enhanced document tracking and auditing, ensuring compliance and content authenticity."
    }
  },
  "formats": {
    "title": "Digitally sign a wide range of file formats",
    "description": "The {{EnvName}} API empowers you to electronically sign over 60 industry-standard file formats, offering unparalleled flexibility in securing your business documents."
  },
  "operations": {
    "title": "Explore the full scope of our features",
    "description": "We’re proud to offer a vast array of signature options and associated operations"
  },
  "examples": {
    "comment_1": "Load the document into a {{TextSignature}} instance",
    "comment_2": "Create a new {{QrCodeSignOptions}} object",
    "comment_3": "Configure all the necessary options",
    "comment_4": "Persist the signed document to local storage"
  },
  "steps": {
    "title": "Steps for signing {{FileFormatUp}} using {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) facilitates the incorporation of customized signatures into {{FileFormatUp}} files. {{EnvName}} developers can seamlessly integrate signing functionality into their applications using our software.",
      "step_1": "Provide the {{FileFormatUp}} file to the {{TextSignature}} instance for signing.",
      "step_2": "Utilize {{SignOptions}} to specify the signature parameters.",
      "step_3": "Configure attributes such as size, color, and content.",
      "step_4": "Save the signed file to the desired destination."
    }
  },
  "code_1": {
    "title": "How to add an image signature to a document",
    "content": "This example illustrates the procedure for applying an image signature to a specific page within a document.",
    "comment_1": "Provide the source document as an argument",
    "comment_2": "Specify the path to the image in the signature configuration",
    "comment_3": "Define the dimensions and target pages for the signature",
    "comment_4": "Execute the application of the signature to the document"
  }
}