{
  "head": {
    "title": "Підписуйте {{FileFormatUp}} електронними підписами у {{ProgLang}}",
    "description": "Використовуйте можливості API {{ProgLang}} для цифрового підпису та захисту файлів {{FileFormatUp}}, включаючи PDF, документи Word, таблиці Excel, презентації та формати зображень."
  },
  "header": {
    "title": "Електронний підпис файлів {{FileFormatUp}}",
    "description": "Використовуйте {{ProdFullName}} для вставки різноманітних цифрових підписів у ваші документи, забезпечуючи цілісність даних та відповідність для файлів, таких як PDF, Word, Excel, презентації та формати зображень.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачайте зараз безкоштовно"
  },
  "about": {
    "title": "Огляд API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує потужний набір інструментів для додавання електронних підписів. Завдяки інтуїтивно зрозумілому API ви можете безперешкодно підписувати, шукати, перевіряти, змінювати та видаляти підписи з різних типів файлів без необхідності у сторонньому програмному забезпеченні. Він підтримує легкий процес підписання PDF, документів Word, електронних таблиць Excel, слайдів PowerPoint та численних форматів зображень."
  },
  "more_features": {
    "title": "Розширені можливості цифрового підпису",
    "description": "Наш розширений API оптимізує бізнес-операції, полегшуючи автоматизацію підпису, перевірки, модифікації та управління електронними підписами для різних документів.",
    "image_description": "Функції цифрового підпису",
    "feature_1": {
      "title": "Цифровий підпис для офісних файлів",
      "content": "Додавайте цифрові підписи на будь-яку сторінку або у вибране місце документа. Налаштуйте свої підписи з допомогою таких опцій, як цифрові сертифікати, метадані, штрих-коди або візуальні елементи для покращення безпеки та цілісності документа."
    },
    "feature_2": {
      "title": "Всебічне управління підписами",
      "content": "Після підписання документа ви можете без зусиль управляти його підписами. Отримуйте повний список усіх підписів, що дозволяє вам вносити зміни або видаляти їх за потреби."
    },
    "feature_3": {
      "title": "Посилення безпеки документа",
      "content": "Використовуйте цифрові сертифікати для захисту ваших документів від підробок. Ви можете вбудовувати або видобувати метадані, щоб поліпшити трасування та аудит, забезпечуючи відповідність документів та їхню автентичність."
    }
  },
  "formats": {
    "title": "Цифровий підпис для кількох типів файлів",
    "description": "API {{EnvName}} дозволяє застосовувати цифрові підписи до понад 60 форматів файлів, надаючи вам велику гнучкість у забезпеченні безпеки ваших критично важливих документів."
  },
  "operations": {
    "title": "Ознайомтесь з нашими широкими можливостями",
    "description": "Ми пропонуємо широкий спектр типів підписів та функціональних операцій."
  },
  "examples": {
    "comment_1": "Імпортуйте документ у екземпляр {{TextSignature}}",
    "comment_2": "Створіть об'єкт {{QrCodeSignOptions}}",
    "comment_3": "Вкажіть усі необхідні параметри",
    "comment_4": "Збережіть підписаний документ на локальний диск"
  },
  "steps": {
    "title": "Кроки для підписання {{FileFormatUp}} з використанням {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) спрощує процес додавання налаштованих підписів до файлів {{FileFormatUp}}. Розробники {{EnvName}} можуть безперешкодно інтегрувати функціональність підписання у свої додатки.",
      "step_1": "Завантажте документ {{FileFormatUp}} в екземпляр {{TextSignature}}.",
      "step_2": "Задайте {{SignOptions}} для визначення атрибутів підпису.",
      "step_3": "Налаштуйте властивості, такі як розмір, колір і вміст за потреби.",
      "step_4": "Збережіть підписаний документ за вказаною адресою."
    }
  },
  "code_1": {
    "title": "Як застосувати зображення підпису до документа",
    "content": "Цей посібник описує процес накладання зображення підпису на вказану сторінку в документі.",
    "comment_1": "Вкажіть вихідний документ як вхідний параметр",
    "comment_2": "Вкажіть шлях до зображення у параметрах налаштування підпису",
    "comment_3": "Налаштуйте розміри та вкажіть цільові сторінки для підпису",
    "comment_4": "Реалізуйте застосування підпису до документа"
  }
}