{
  "head": {
    "title": "ลงนามอิเล็กทรอนิกส์ในเอกสาร {{FileFormatUp}} ด้วยแอปพลิเคชัน {{ProgLang}}",
    "description": "ใช้พลังของ API {{ProgLang}} เพื่อทำการลงนามอิเล็กทรอนิกส์และรักษาความปลอดภัยของเอกสาร {{FileFormatUp}} เช่น PDF, ไฟล์ Word, แผ่น Excel, การนำเสนอ และภาพถ่าย"
  },
  "header": {
    "title": "ลงนามอิเล็กทรอนิกส์ใน {{FileFormatUp}}",
    "description": "ใช้ {{ProdFullName}} เพื่อฝังลายเซ็นอิเล็กทรอนิกส์ที่หลากหลายลงในเอกสารของคุณ เพื่อประกันการปฏิบัติตามและความถูกต้องของข้อมูลผ่านรูปแบบต่าง ๆ เช่น PDF, Word, Excel, การนำเสนอ และภาพถ่าย",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "ภาพรวมของ API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มอบชุดเครื่องมือครบวงจรสำหรับการเพิ่มลายเซ็นอิเล็กทรอนิกส์ในเอกสาร ไม่ว่าจะต้องการลงนาม ค้นหา ตรวจสอบ อัปเดต หรือถอนลายเซ็นดิจิทัล {{ProdFullName}} ทำได้ง่ายในหลายรูปแบบ—PDF, เอกสาร Word, แผ่น Excel, การนำเสนอ PowerPoint และรูปภาพต่าง ๆ—โดยไม่ต้องใช้ซอฟต์แวร์ของบุคคลที่สาม"
  },
  "more_features": {
    "title": "ฟีเจอร์การลงนามอิเล็กทรอนิกส์ขั้นสูงสำหรับเอกสาร",
    "description": "API สำหรับการลงนามอิเล็กทรอนิกส์ของเราช่วยให้กระบวนการธุรกิจลื่นไหล โดยมีวิธีการที่มีประสิทธิภาพในการลงนาม ยืนยัน แก้ไข และจัดการลายเซ็นอิเล็กทรอนิกส์พร้อมการสนับสนุนการทำงานอัตโนมัติอย่างเต็มรูปแบบ",
    "image_description": "ฟีเจอร์การลงนามอิเล็กทรอนิกส์",
    "feature_1": {
      "title": "ลงนามในเอกสารสำนักงาน",
      "content": "วางลายเซ็นอิเล็กทรอนิกส์ในจุดใดก็ได้ในเอกสารของคุณ ปรับแต่งเนื้อหาของคุณด้วยใบรับรองดิจิทัล รหัส QR เมตาพารามิเตอร์ และองค์ประกอบภาพ โดยยังคงรักษาความปลอดภัยและความถูกต้องของเอกสาร"
    },
    "feature_2": {
      "title": "การจัดการลายเซ็นอย่างเต็มรูปแบบ",
      "content": "เมื่อเอกสารถูกลงนามแล้ว คุณสามารถดูและจัดการลายเซ็นทั้งหมด คุณสามารถทำการอัปเดตหรือถอนลายเซ็นตามความจำเป็น เพื่อให้แน่ใจว่าคุณควบคุมเอกสารได้อย่างครบถ้วน"
    },
    "feature_3": {
      "title": "เพิ่มความปลอดภัยให้เอกสาร",
      "content": "ปกป้องเอกสารของคุณด้วยใบรับรองดิจิทัล ฝังหรือเรียกคืนเมตาดาต้าเพื่อปรับปรุงการติดตาม การตรวจสอบ และการปฏิบัติตาม ก่อให้เกิดความถูกต้องของเนื้อหาของคุณ"
    }
  },
  "formats": {
    "title": "ลงนามในรูปแบบไฟล์ที่หลากหลาย",
    "description": "ด้วย API {{EnvName}} คุณสามารถลงนามอิเล็กทรอนิกส์ในรูปแบบมาตรฐานอุตสาหกรรมกว่า 60 รูปแบบ มอบความยืดหยุ่นที่ไม่มีใครเทียบในการรักษาความปลอดภัยให้กับเอกสารธุรกิจของคุณ"
  },
  "operations": {
    "title": "สำรวจฟีเจอร์ทั้งหมดของเรา",
    "description": "เรามีตัวเลือกลายเซ็นและการดำเนินการที่หลากหลายสำหรับความต้องการทั้งหมดของคุณในการลงนามอิเล็กทรอนิกส์"
  },
  "examples": {
    "comment_1": "โหลดเอกสารลงในอินสแตนซ์ {{TextSignature}}",
    "comment_2": "สร้างวัตถุ {{QrCodeSignOptions}} ใหม่",
    "comment_3": "ตั้งค่าตัวเลือกที่จำเป็นทั้งหมด",
    "comment_4": "บันทึกเอกสารที่ลงนามในระบบของคุณ"
  },
  "steps": {
    "title": "ขั้นตอนในการลงนาม {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "ด้วย [{{ProdShortName}}]({{PlatformLink}}) นักพัฒนา {{EnvName}} สามารถรวมฟังก์ชันการลงนามเข้ากับเอกสาร {{FileFormatUp}} ได้อย่างราบรื่น เพิ่มลายเซ็นที่ปรับแต่งได้ในแอปพลิเคชันของคุณ",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} ลงในอินสแตนซ์ {{TextSignature}}",
      "step_2": "ใช้ {{SignOptions}} เพื่อกำหนดการตั้งค่าลายเซ็น",
      "step_3": "ปรับแต่งคุณสมบัติลายเซ็น เช่น ขนาด สี และเนื้อหา",
      "step_4": "บันทึกเอกสารที่ลงนามไปยังตำแหน่งที่ต้องการ"
    }
  },
  "code_1": {
    "title": "วิธีการเพิ่มลายเซ็นภาพในเอกสาร",
    "content": "ตัวอย่างนี้แสดงวิธีการใช้ลายเซ็นภาพในหน้าที่เฉพาะของเอกสาร",
    "comment_1": "โหลดเอกสารที่คุณต้องการลงนาม",
    "comment_2": "กำหนดเส้นทางไปยังภาพในตัวเลือกลายเซ็น",
    "comment_3": "กำหนดขนาดและตำแหน่งของลายเซ็นในหน้าที่ต้องการ",
    "comment_4": "ใช้ลายเซ็นและบันทึกเอกสารที่ลงนาม"
  }
}