{
  "head": {
    "title": "Електронний підпис {{FileFormatUp}} через {{ProgLang}}",
    "description": "Використовуйте {{FileFormatUp}}, щоб додати різноманітні види електронних підписів до документів, забезпечуючи безпеку та відповідність для форматів, таких як PDF, Word, Excel, Презентації та зображення."
  },
  "header": {
    "title": "Електронне підписання файлів {{FileFormatUp}}",
    "description": "Вбудуйте різноманітні електронні підписи в свої документи за допомогою {{ProdFullName}}, забезпечуючи відповідність та цілісність для форматів, таких як PDF, Word, Excel, Презентації та зображення.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачати безкоштовно"
  },
  "about": {
    "title": "Про API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує комплексний набір можливостей електронного підписання. За допомогою цього інструмента ви можете безперешкодно додавати, шукати, перевіряти, оновлювати та видаляти цифрові підписи для широкого спектра типів документів, без необхідності використовувати сторонні інструменти. Він підтримує підписання PDF-файлів, документів Word, таблиць Excel, презентацій PowerPoint та різних форматів зображень."
  },
  "more_features": {
    "title": "Просунуті електронні підписи документів",
    "description": "Наш складний API електронного підписання покращує бізнес-процеси, дозволяючи ефективно підписувати, перевіряти, модифікувати та управляти електронними підписами з повними можливостями автоматизації.",
    "image_description": "Можливості електронного підпису",
    "feature_1": {
      "title": "Електронне підписання для офісних документів",
      "content": "Безперешкодно вставляйте електронні підписи у будь-яке місце документу. Налаштовуйте і збагачуйте контент цифровими сертифікатами, метаданими, штрих-кодами або візуальними елементами, забезпечуючи достовірність та безпеку."
    },
    "feature_2": {
      "title": "Комплексне управління підписами",
      "content": "Після підписання документи можна додатково обробляти без зусиль. Отримуйте повний огляд існуючих підписів, що дозволяє точно оновлювати або видаляти підписи за необхідності."
    },
    "feature_3": {
      "title": "Покращена безпека контенту",
      "content": "Захистіть цілісність своїх документів за допомогою цифрових сертифікатів. Вбудовуйте або витягуйте метадані для поліпшеного відстеження та аудитування документів, забезпечуючи відповідність і достовірність контенту."
    }
  },
  "formats": {
    "title": "Цифрове підписання широкого спектру форматів файлів",
    "description": "API {{EnvName}} дає вам можливість електронно підписувати понад 60 стандартних форматів файлів, пропонуючи безпрецедентну гнучкість у захисті ваших бізнес-документів."
  },
  "operations": {
    "title": "Досліджуйте весь спектр наших можливостей",
    "description": "Ми раді запропонувати широкий вибір варіантів підпису та супутніх операцій."
  },
  "examples": {
    "comment_1": "Завантажте документ у екземпляр {{TextSignature}}",
    "comment_2": "Створіть новий об'єкт {{QrCodeSignOptions}}",
    "comment_3": "Налаштуйте всі необхідні параметри",
    "comment_4": "Збережіть підписаний документ на локальному зберіганні"
  },
  "steps": {
    "title": "Кроки для підписання {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) полегшує включення користувацьких підписів у файли {{FileFormatUp}}. Розробники {{EnvName}} можуть безперешкодно інтегрувати функціональність підписання у свої програми, використовуючи наше програмне забезпечення.",
      "step_1": "Надайте файл {{FileFormatUp}} екземпляру {{TextSignature}} для підписання.",
      "step_2": "Використовуйте {{SignOptions}} для вказівки параметрів підпису.",
      "step_3": "Налаштуйте атрибути, такі як розмір, колір і вміст.",
      "step_4": "Збережіть підписаний файл у бажаному місці."
    }
  },
  "code_1": {
    "title": "Як додати зображення підпису до документа",
    "content": "Цей приклад ілюструє процедуру нанесення зображення підпису на певну сторінку документа.",
    "comment_1": "Надайте вихідний документ як аргумент",
    "comment_2": "Вкажіть шлях до зображення в конфігурації підпису",
    "comment_3": "Визначте розміри та цільові сторінки для підпису",
    "comment_4": "Виконайте нанесення підпису на документ"
  }
}