{
  "head": {
    "title": "Подпись {{FileFormatUp}} с электронными подписями на {{ProgLang}}",
    "description": "Используйте возможности API {{ProgLang}} для цифровой подписи и защиты файлов {{FileFormatUp}}, включая PDF, документы Word, таблицы Excel, презентации и форматы изображений."
  },
  "header": {
    "title": "Электронная подпись файлов {{FileFormatUp}}",
    "description": "Используйте {{ProdFullName}} для добавления разнообразных цифровых подписей в ваши документы, обеспечивая целостность данных и соответствие для таких файлов, как PDF, Word, Excel, презентации и форматы изображений.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать бесплатно"
  },
  "about": {
    "title": "Обзор API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предлагает мощный набор инструментов для добавления электронных подписей. С помощью интуитивно понятного API вы можете без труда подписывать, искать, проверять, модифицировать и удалять подписи из различных типов файлов без необходимости в стороннем программном обеспечении. Он поддерживает гладкую подпись PDF, документов Word, таблиц Excel, слайдов PowerPoint и многих форматов изображений."
  },
  "more_features": {
    "title": "Расширенные возможности цифровых подписей",
    "description": "Наш передовой API оптимизирует бизнес-процессы, упрощая автоматизированную подпись, проверку, модификацию и управление электронными подписями для различных документов.",
    "image_description": "Функции цифровых подписей",
    "feature_1": {
      "title": "Цифровая подпись для офисных файлов",
      "content": "Добавляйте цифровые подписи на любую страницу или в любое место документа. Настраивайте свои подписи с такими параметрами, как цифровые сертификаты, метаданные, штрих-коды или визуальные элементы для повышения безопасности и целостности документа."
    },
    "feature_2": {
      "title": "Всеобъемлющий контроль подписей",
      "content": "После того как документ подписан, вы можете легко управлять его подписями. Получайте полный список всех подписей, что позволит вам вносить изменения или удалять их по мере необходимости."
    },
    "feature_3": {
      "title": "Укрепление безопасности документа",
      "content": "Используйте цифровые сертификаты для защиты ваших документов от подделки. Вы можете встроить или извлечь метаданные для повышения отслеживаемости и аудита, обеспечивая соответствие документа и его достоверность."
    }
  },
  "formats": {
    "title": "Цифровая подпись для нескольких типов файлов",
    "description": "API {{EnvName}} позволяет применять цифровые подписи к более чем 60 форматам файлов, предоставляя вам широкую гибкость в обеспечении безопасности ваших критически важных документов."
  },
  "operations": {
    "title": "Посмотрите наши обширные возможности",
    "description": "Мы предлагаем широкий спектр типов подписей и функциональных операций."
  },
  "examples": {
    "comment_1": "Импортируйте документ в экземпляр {{TextSignature}}",
    "comment_2": "Создайте объект {{QrCodeSignOptions}}",
    "comment_3": "Укажите все необходимые параметры",
    "comment_4": "Сохраните подписанный документ на локальном диске"
  },
  "steps": {
    "title": "Шаги для подписи {{FileFormatUp}} с использованием {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) упрощает процесс добавления пользовательских подписей в файлы {{FileFormatUp}}. Разработчики {{EnvName}} могут без труда интегрировать функциональность подписи в свои приложения.",
      "step_1": "Загрузите документ {{FileFormatUp}} в экземпляр {{TextSignature}}.",
      "step_2": "Настройте {{SignOptions}} для определения атрибутов подписи.",
      "step_3": "При необходимости измените параметры, такие как размер, цвет и содержимое.",
      "step_4": "Сохраните подписанный документ в указанном месте."
    }
  },
  "code_1": {
    "title": "Как применить изображение подписи к документу",
    "content": "Этот гайд описывает процесс размещения изображения подписи на определенной странице документа.",
    "comment_1": "Укажите исходный документ в качестве входного параметра",
    "comment_2": "Укажите путь к файлу изображения в параметрах настроек подписи",
    "comment_3": "Настройте размеры и укажите целевые страницы для подписи",
    "comment_4": "Реализуйте применение подписи к документу"
  }
}