{
  "head": {
    "title": "Add Metadata to {{FileFormatUp}} Files in {{ProgLang}} Applications",
    "description": "{{ProgLang}} metadata processing API to add metadata information to {{FileFormatUp}} files. Work with metadata standards XMP, EXIF, IPTC, ID3 etc."
  },
  "header": {
    "title": "Adding Metadata To {{FileFormatUp}} In {{ProgLang}}",
    "description": "Add custom metadata properties to a wide range of business documents, images, audio & video file formats using {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download Free Trial"
  },
  "about": {
    "title": "About {{ProdFullName}} API",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is an advanced metadata fields management and manipulation solution to easily view, update, remove, find, compare, exchange and export metadata information from images and document formats without using any external software. Add metadata details to Word documents, Excel spreadsheets, PowerPoint presentations, Outlook emails, OneNote, Visio, Project, PDF, AutoCAD, ZIp, Audio and Video file formats along with the support for working with many other metadata processing features."
  },
  "formats": {
    "title": "Adding Metadata Properties To Other File Formats",
    "description": "Multi format documents and images metadata addition API for {{EnvName}}. Retrieve metadata of some of the popular file formats as stated below."
  },
  "examples": {
    "comment_1": "load the file in an instance of {{TextMetadata}} class",
    "comment_2": "add a property containing the content author",
    "comment_3": "process operation results",
    "comment_4": "save the file with updated metadata"
  },
  "steps": {
    "title": "Steps for adding Metadata to {{FileFormatUp}} in {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) makes it easy for {{EnvName}} developers to add metadata details to {{FileFormatUp}} files from within their applications by implementing a few easy steps.",
      "step_1": "Load {{FileFormatUp}} with an instance of {{TextMetadata}} class.",
      "step_2": "Use {{TextMetadataAddProperties}} method to add the properties.",
      "step_3": "Use a predicate to find desired metadata properties.",
      "step_4": "Save the changes back in {{FileFormatUp}} format."
    }
  },
  "more_features": {
    "title": "Document Metadata Management",
    "description": "Our comprehensive API streamlines managing document metadata. Access, edit, and manipulate various document properties for improved organization and searchability.",
    "image_description": "Metadata Functionality",
    "feature_1": {
      "title": "Metadata Access",
      "content": "Effortlessly retrieve and process a document's metadata. Gain insights into properties like author, creation date, and many others."
    },
    "feature_2": {
      "title": "Metadata Editing",
      "content": "Modify document metadata directly. Update properties for better organization, searchability, and information accuracy."
    },
    "feature_3": {
      "title": "Advanced Metadata Management",
      "content": "Perform complex operations on document metadata. Efficiently handle tasks like adding custom properties, deleting irrelevant data, and ensuring data consistency."
    },
    "code_1": {
      "title": "How to add custom metadata to TIFF image",
      "content": "This code sample demonstrates how to add a custom tag to an EXIF package",
      "comment_1": "Set the EXIF package if it's missing",
      "comment_2": "Add a known property",
      "comment_3": "Add a fully custom property (which is not described in the EXIF specification)",
      "comment_4": "Please note that the chosen ID may intersect with the IDs used by some third party tools"
    }
  }
}