{
  "head": {
    "title": "ลงนาม {{FileFormatUp}} ผ่าน {{ProgLang}} ทางอิเล็กทรอนิกส์",
    "description": "ใช้ {{FileFormatUp}} เพื่อเพิ่มประเภทลายเซ็นอิเล็กทรอนิกส์หลากหลายประเภทในเอกสาร เพื่อให้มั่นใจในความปลอดภัยและความสอดคล้องในรูปแบบต่างๆ เช่น PDF, Word, Excel, การนำเสนอ และรูปภาพ"
  },
  "header": {
    "title": "การลงนามไฟล์ {{FileFormatUp}} ทางอิเล็กทรอนิกส์",
    "description": "ฝังลายเซ็นอิเล็กทรอนิกส์ที่หลากหลายลงในเอกสารของคุณด้วย {{ProdFullName}} เพื่อทำให้มั่นใจในความสอดคล้องและความสมบูรณ์ของรูปแบบต่างๆ เช่น PDFs, Word, Excel, การนำเสนอ และรูปภาพ",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ API {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีชุดความสามารถในการลงนามทางอิเล็กทรอนิกส์ที่ครอบคลุม ด้วยเครื่องมือนี้ คุณสามารถเพิ่ม ค้นหา ยืนยัน ปรับปรุง และลบลายเซ็นดิจิทัลจากประเภทเอกสารต่างๆ ได้อย่างราบรื่น โดยไม่ต้องพึ่งพาเครื่องมือของบุคคลที่สาม โดยสนับสนุนการลงนามไฟล์ PDF, เอกสาร Word, แผ่น Excel, การนำเสนอ PowerPoint และประเภทภาพต่างๆ ได้อย่างมีประสิทธิภาพ"
  },
  "more_features": {
    "title": "ลายเซ็นดิจิทัลขั้นสูงสำหรับเอกสาร",
    "description": "API การลงนามทางอิเล็กทรอนิกส์ที่ซับซ้อนของเราเพิ่มประสิทธิภาพของการทำงานในธุรกิจ ทำให้การลงนาม การตรวจสอบ การปรับเปลี่ยน และการจัดการลายเซ็นทางอิเล็กทรอนิกส์เป็นไปอย่างมีประสิทธิภาพด้วยความสามารถในการทำงานอัตโนมัติอย่างเต็มรูปแบบ",
    "image_description": "ความสามารถในการลงนามทางอิเล็กทรอนิกส์",
    "feature_1": {
      "title": "การลงนามทางอิเล็กทรอนิกส์สำหรับเอกสารสำนักงาน",
      "content": "แทรกลายเซ็นอิเล็กทรอนิกส์ได้ที่ตำแหน่งใดก็ได้ในเอกสาร ปรับแต่งและเพิ่มสำเนาเนื้อหาด้วยใบรับรองดิจิทัล ข้อมูลประจำตัว รหัสบาร์ หรือองค์ประกอบภาพ ในขณะเดียวกันก็รับประกันความถูกต้องและความปลอดภัย"
    },
    "feature_2": {
      "title": "การจัดการลายเซ็นอย่างครอบคลุม",
      "content": "เอกสารที่ถูกลงนามสามารถดำเนินการต่อได้อย่างราบรื่น เข้าถึงภาพรวมของลายเซ็นที่มีอยู่เพื่อให้สามารถปรับปรุงหรือทำลายลายเซ็นได้ตามความจำเป็น"
    },
    "feature_3": {
      "title": "ความปลอดภัยของเนื้อหาที่เพิ่มขึ้น",
      "content": "ป้องกันความสมบูรณ์ของเอกสารของคุณโดยใช้ใบรับรองดิจิทัล ฝังหรือดึงข้อมูลประจำตัวเพื่อเพิ่มการติดตามเอกสารและการตรวจสอบ เพื่อให้แน่ใจว่าปฏิบัติตามและความถูกต้องของเนื้อหา"
    }
  },
  "formats": {
    "title": "การลงนามไฟล์ในรูปแบบต่างๆ อย่างดิจิทัล",
    "description": "API {{EnvName}} ช่วยให้คุณลงนามทางอิเล็กทรอนิกส์ไฟล์รูปแบบมาตรฐานในอุตสาหกรรมมากกว่า 60 รูปแบบ มอบความยืดหยุ่นที่ไม่มีใครเทียบในการป้องกันเอกสารธุรกิจของคุณ"
  },
  "operations": {
    "title": "สำรวจความสามารถทั้งหมดของเรา",
    "description": "เราภูมิใจที่จะนำเสนอความหลากหลายของลายเซ็นและการดำเนินการที่เกี่ยวข้อง"
  },
  "examples": {
    "comment_1": "โหลดเอกสารลงในตัวอย่าง {{TextSignature}}",
    "comment_2": "สร้างวัตถุ {{QrCodeSignOptions}} ใหม่",
    "comment_3": "กำหนดค่าตัวเลือกที่จำเป็นทั้งหมด",
    "comment_4": "บันทึกเอกสารที่ลงนามไปยังพื้นที่จัดเก็บท้องถิ่น"
  },
  "steps": {
    "title": "ขั้นตอนในการลงนาม {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) อำนวยความสะดวกในการรวมลายเซ็นที่ปรับแต่งลงในไฟล์ {{FileFormatUp}} นักพัฒนา {{EnvName}} สามารถรวมฟังก์ชันการลงนามเข้ากับแอปพลิเคชันของตนได้อย่างราบรื่น",
      "step_1": "ให้ไฟล์ {{FileFormatUp}} ไปยังตัวอย่าง {{TextSignature}} เพื่อการลงนาม",
      "step_2": "ใช้ {{SignOptions}} เพื่อระบุพารามิเตอร์ลายเซ็น",
      "step_3": "กำหนดค่าคุณสมบัติต่างๆ เช่น ขนาด สี และเนื้อหา",
      "step_4": "บันทึกไฟล์ที่ลงนามไปยังปลายทางที่ต้องการ"
    }
  },
  "code_1": {
    "title": "วิธีการเพิ่มลายเซ็นรูปภาพในเอกสาร",
    "content": "ตัวอย่างนี้แสดงให้เห็นถึงขั้นตอนการใช้ลายเซ็นรูปภาพไปยังหน้าที่เฉพาะในเอกสาร",
    "comment_1": "ให้เอกสารต้นทางเป็นอาร์กิวเมนต์",
    "comment_2": "ระบุเส้นทางไปยังรูปภาพในการกำหนดค่าลายเซ็น",
    "comment_3": "กำหนดขนาดและหน้าเป้าหมายสำหรับลายเซ็น",
    "comment_4": "ดำเนินการใช้ลายเซ็นไปยังเอกสาร"
  }
}