{
  "head": {
    "title": "Generate QR code for {{FileFormatUp}} files using {{ProgLang}}",
    "description": "Harness the {{ProdShortName}} API to generate QR code for {{FileFormatUp}} files. Seamlessly embed QR codes on any page for enhanced functionality."
  },
  "header": {
    "title": "Generate QR codes for {{FileFormatUp}}",
    "description": "Effortlessly generate 2D barcodes using text or numeric data and apply them across multiple pages and formats, including PDFs, Word, Excel, and more, via {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Start your free trial"
  },
  "about": {
    "title": "Discover the capabilities of {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) offers an expansive range of features, empowering users to generate and embed various signature types across leading document formats. Whether it’s PDFs, Word documents, Excel sheets, PowerPoint presentations, or image files, you can elevate your documents with Text, Image, Barcode, QR Code, Metadata, Digital, and Stamp signatures."
  },
  "more_features": {
    "title": "Comprehensive signature integration for documents",
    "description": "With {{ProdFullName}} API, users can effortlessly generate, modify, search, validate, and remove an array of signature types, streamlining document workflows with unparalleled precision.",
    "image_description": "Key Features of {{ProdShortName}}",
    "feature_1": {
      "title": "Document signing with multiple signature types",
      "content": "{{ProdShortName}} enables the application of Text, Image, Barcode, QR Code, and Stamp signatures to any document format. Signatures can be precisely placed on any page, and metadata can be seamlessly managed through metadata signatures. Protect the integrity of your documents by incorporating digital certificates that prevent unauthorized alterations."
    },
    "feature_2": {
      "title": "Signature search and validation",
      "content": "Verify the authenticity and accuracy of document signatures through an advanced validation process. Easily retrieve a detailed list of all signatures embedded in a document for comprehensive oversight."
    },
    "feature_3": {
      "title": "Customizable signature modification",
      "content": "Update and refine previously applied signatures by adjusting content, placement, color, size, and other attributes to meet your specific needs."
    },
    "feature_4": {
      "title": "Efficient signature removal",
      "content": "Streamline your document management by programmatically removing unwanted signatures. Whether dealing with digital certificates or other signature types, removal can be done swiftly and effectively."
    }
  },
  "formats": {
    "title": "Generate QR codes for other document formats",
    "description": "Enhance all industry-standard file formats with the ability to embed QR codes through the {{EnvName}} API. Store and encode critical information into 2D barcodes for seamless scanning and data retrieval."
  },
  "operations": {
    "title": "Learn about our signature solutions",
    "description": "We proudly present a wide range of signature types and operational features"
  },
  "examples": {
    "comment_1": "Initialize a new {{TextSignature}} instance with the document",
    "comment_2": "Utilize {{QrCodeSignOptions}} to embed a QR code into the document",
    "comment_3": "Specify the signature type and designate its position on the page",
    "comment_4": "Persist the document with the integrated QR code"
  },
  "steps": {
    "title": "How to generate and insert a QR code in any place within a {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) facilitates the generation of QR codes in various popular formats and their placement on {{FileFormatUp}} pages. Supporting over 10 types of QR codes, our library can be seamlessly integrated into {{EnvName}} applications. Enhance your documents with QR code signatures using our product.",
      "step_1": "Acquire the {{FileFormatUp}} file or stream to be signed with a QR code.",
      "step_2": "Provide the requisite text to {{QrCodeSignOptions}}.",
      "step_3": "Customize visual parameters such as color, position, size, etc.",
      "step_4": "Persist the document with the embedded QR code."
    }
  },
  "code_1": {
    "title": "How to customize a generated QR code",
    "content": "This example demonstrates how to place a customized QR code on a {{FileFormatUp}} page.",
    "comment_1": "Retrieve the document to be signed and pass it to {{TextSignature}}",
    "comment_2": "Configure QR code options with the necessary text",
    "comment_3": "Designate the relative position of the QR code on the page",
    "comment_4": "Set the signature padding",
    "comment_5": "Specify the QR code color",
    "comment_6": "Define the font options for the message",
    "comment_7": "Customize the QR code background color and brush",
    "comment_8": "Embed the QR code into the document"
  }
}