{
  "head": {
    "title": "Створіть QR-код для {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "API {{ProdShortName}} дозволяє створювати QR-коди для файлів {{FileFormatUp}}. Генеруйте QR-коди з вашого контенту та розміщуйте їх на будь-якій сторінці."
  },
  "header": {
    "title": "Створіть QR-коди для {{FileFormatUp}}",
    "description": "Створюйте 2D штрих-коди з текстовими та числовими даними та розміщуйте їх на будь-якій сторінці різних документів, використовуючи {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Безкоштовна пробна версія"
  },
  "about": {
    "title": "Дізнайтесь більше про {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує широкий спектр можливостей для генерації та вбудовування різних типів підписів у всі основні формати документів. Підтримуються PDF, документи Word, електронні таблиці Excel, презентації PowerPoint та зображення. Покращуйте свої документи підписами тексту, зображень, штрих-кодів, QR-кодів, метаданих, цифровими та штампами."
  },
  "more_features": {
    "title": "Додайте підписи до ваших документів",
    "description": "API {{ProdFullName}} підтримує підписання всіх популярних форматів файлів. Генеруйте, модифікуйте, шукайте, перевіряйте та видаляйте різні типи підписів.",
    "image_description": "Ключові функції {{ProdShortName}}",
    "feature_1": {
      "title": "Підписуйте документи",
      "content": "{{ProdShortName}} підтримує підписання текстом, зображеннями, штрих-кодами, QR-кодами та штампами. Розміщуйте їх на будь-якій сторінці будь-якого підтримуваного формату документа. Керуйте метаданими документів за допомогою метаданих підписів та захищайте контент від несанкціонованих змін за допомогою цифрових сертифікатів."
    },
    "feature_2": {
      "title": "Пошук та перевірка",
      "content": "Переконайтеся, що всі підписи в документі дійсні, шляхом перевірки. Отримуйте повний список підписів у документі, використовуючи вбудовану функцію пошуку."
    },
    "feature_3": {
      "title": "Модифікація підписів",
      "content": "Модифікуйте властивості підпису після підписання. Налаштуйте вміст, позицію, колір, розмір та інші атрибути за необхідності."
    },
    "feature_4": {
      "title": "Видалення підписів",
      "content": "Видаляйте непотрібні підписи без зусиль. Різні типи підписів, включаючи цифрові сертифікати, можуть бути видалені з документів програмно."
    }
  },
  "formats": {
    "title": "Генеруйте QR-коди для додаткових форматів файлів",
    "description": "Покращіть усі популярні формати файлів створеними QR-кодами, використовуючи API {{EnvName}}. Додавайте дані 2D штрих-коду для легкого сканування та обробки."
  },
  "operations": {
    "title": "Ознайомтеся з нашими ключовими пропозиціями",
    "description": "Ми пропонуємо різноманітний вибір функцій підпису та розширених операцій."
  },
  "examples": {
    "comment_1": "Передайте документ до нового екземпляра {{TextSignature}}",
    "comment_2": "Використовуйте {{QrCodeSignOptions}}, щоб додати QR-код до документа",
    "comment_3": "Вкажіть тип підпису та позицію на сторінці",
    "comment_4": "Збережіть файл з доданим QR-кодом"
  },
  "steps": {
    "title": "Кроки для генерації та розміщення QR-коду в будь-якому місці в {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) може генерувати QR-коди у багатьох популярних форматах і розміщувати їх на сторінках {{FileFormatUp}}. Підтримується понад 10 типів QR-кодів, які можна швидко інтегрувати в додатки {{EnvName}}. Використовуйте наш продукт для підписання документів зі згенерованими QR-кодами.",
      "step_1": "Отримайте файл або потік {{FileFormatUp}}, який необхідно підписати QR-кодом.",
      "step_2": "Надайте текст для {{QrCodeSignOptions}}.",
      "step_3": "Налаштуйте візуальні параметри, такі як колір, позиція, розмір тощо.",
      "step_4": "Збережіть файл з QR-кодом."
    }
  },
  "code_1": {
    "title": "Як налаштувати згенерований QR-код",
    "content": "Використовуйте цей приклад, щоб дізнатися, як розмістити новий QR-код на сторінці {{FileFormatUp}}.",
    "comment_1": "Отримайте документ, який потрібно підписати, і передайте його до {{TextSignature}}",
    "comment_2": "Використовуйте параметри QR-коду для надання тексту з потрібною інформацією",
    "comment_3": "Встановіть відносну позицію QR-коду на сторінці",
    "comment_4": "Встановіть відступ для підпису",
    "comment_5": "Вкажіть колір QR-коду",
    "comment_6": "Визначте параметри шрифту для повідомлення",
    "comment_7": "Налаштуйте колір фону QR-коду та пензля",
    "comment_8": "Додайте QR-код до документа"
  }
}