{
  "head": {
    "title": "Генерация QR-кодов для файлов {{FileFormatUp}} с использованием {{ProgLang}}",
    "description": "Используйте API {{ProdShortName}} для генерации и интеграции QR-кодов в файлы {{FileFormatUp}}. Размещайте QR-коды на любой странице для добавления дополнительных возможностей."
  },
  "header": {
    "title": "Генерация QR-кодов для {{FileFormatUp}}",
    "description": "Создавайте двумерные штрих-коды с использованием текстовых или численных данных и применяйте их на различных страницах и форматах, включая PDF, Word, Excel и многое другое с помощью {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Бесплатная пробная версия"
  },
  "about": {
    "title": "Изучите возможности {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предлагает широкий спектр возможностей, позволяя пользователям генерировать и встроить различные типы подписей в основных форматах документов. Будь то PDF, Word, Excel, PowerPoint или изображения, улучшите свои документы с помощью текстовых, изображенческих, штрих-кодов, QR-кодов, метаданных, цифровых или печатных подписей."
  },
  "more_features": {
    "title": "Полноценная интеграция подписей для документов",
    "description": "С помощью API {{ProdFullName}} пользователи могут генерировать, изменять, искать, проверять и удалять различные типы подписей, упрощая рабочие процессы с документами с высокой точностью.",
    "image_description": "Ключевые особенности {{ProdShortName}}",
    "feature_1": {
      "title": "Применение нескольких типов подписей",
      "content": "{{ProdShortName}} позволяет применять текстовые, изображенческие, штрих-коды, QR-коды и печатные подписи к любому документу. Вы можете точно размещать подписи на любой странице и управлять метаданными. Защитите свои документы от несанкционированных изменений с помощью цифровых сертификатов."
    },
    "feature_2": {
      "title": "Поиск и проверка подписей",
      "content": "Проверяйте подписи документов на подлинность и точность с помощью продвинутых инструментов валидации. Легко получите подробный список всех подписей, встроенных в документ, для лучшего контроля."
    },
    "feature_3": {
      "title": "Изменение существующих подписей",
      "content": "Вы можете обновлять ранее применённые подписи, настраивая содержимое, положение, цвет, размер и другие параметры в соответствии с вашими конкретными требованиями."
    },
    "feature_4": {
      "title": "Удаление подписей",
      "content": "Облегчите управление документами, быстро удаляя ненужные подписи. Будь то цифровой сертификат или другой тип подписи, удаление производится эффективно."
    }
  },
  "formats": {
    "title": "Встраивание QR-кодов в различные форматы документов",
    "description": "Используйте API {{EnvName}} для интеграции QR-кодов в любой стандартный формат документа. Храните и кодируйте важную информацию в двумерных штрих-кодах для простоты сканирования и извлечения данных."
  },
  "operations": {
    "title": "Изучите наши решения по подписям",
    "description": "Мы предлагаем широкий выбор типов подписей и операций для удовлетворения ваших потребностей в документах."
  },
  "examples": {
    "comment_1": "Инициализируйте новый экземпляр {{TextSignature}} с документом",
    "comment_2": "Используйте {{QrCodeSignOptions}} для встраивания QR-кода в документ",
    "comment_3": "Укажите тип подписи и задайте её положение на странице",
    "comment_4": "Сохраните документ с встроенным QR-кодом"
  },
  "steps": {
    "title": "Шаги для генерации и вставки QR-кода в {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) позволяет создавать QR-коды в популярных форматах и размещать их на страницах {{FileFormatUp}}. С поддержкой более 10 типов QR-кодов вы можете безупречно интегрировать эту функциональность в приложения {{EnvName}}. Улучшите свои документы с помощью подписей QR-кодов, используя наш продукт.",
      "step_1": "Получите файл или поток {{FileFormatUp}}, в который будет добавлен QR-код.",
      "step_2": "Предоставьте необходимый текст для {{QrCodeSignOptions}}.",
      "step_3": "Настройте визуальные параметры, такие как цвет, положение и размер.",
      "step_4": "Сохраните документ с встроенным QR-кодом."
    }
  },
  "code_1": {
    "title": "Настройка сгенерированного QR-кода",
    "content": "Этот пример демонстрирует, как разместить настроенный QR-код на странице {{FileFormatUp}}.",
    "comment_1": "Получите документ для подписи и передайте его в {{TextSignature}}",
    "comment_2": "Настройте опции QR-кода с необходимым текстом",
    "comment_3": "Установите положение QR-кода на странице",
    "comment_4": "Настройте отступ для подписи",
    "comment_5": "Выберите цвет QR-кода",
    "comment_6": "Определите параметры шрифта для сообщения",
    "comment_7": "Установите цвет фона и кисть для QR-кода",
    "comment_8": "Встраивайте QR-код в документ"
  }
}