{
  "head": {
    "title": "Генерація QR-кодів у файлах {{FileFormatUp}} з допомогою {{ProgLang}}",
    "description": "Використовуйте API {{ProdShortName}} для створення та інтеграції 2D-штрих-кодів у файли {{FileFormatUp}}. Легко розміщуйте QR-коди на будь-якій сторінці документа."
  },
  "header": {
    "title": "Створення QR-кодів для {{FileFormatUp}}",
    "description": "Створюйте та вбудовуйте 2D-штрих-коди з налаштовуваним вмістом, включаючи текст і числові дані, у різні типи документів, такі як PDF, Word, Excel та зображення з {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Спробуйте безкоштовно"
  },
  "about": {
    "title": "Досліджуйте можливості {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує розширені інструменти для покращення документів, що дозволяє генерувати та вбудовувати декілька типів підписів, включаючи QR-коди, у популярні формати файлів. Підписуйте та захищайте PDF-документи, документи Word, електронні таблиці Excel, презентації PowerPoint та зображення з допомогою підписів тексту, зображень, штрих-кодів, QR-кодів, метаданих, цифрових та штампованих підписів."
  },
  "more_features": {
    "title": "Комплексна інтеграція підписів та QR-кодів",
    "description": "З API {{ProdFullName}} ви можете керувати повним спектром підписів. Генеруйте, налаштовуйте, перевіряйте, шукайте та видаляйте підписи без зусиль у різних типах документів, що забезпечує неперевершену гнучкість для ваших робочих процесів.",
    "image_description": "Функції підписів та QR-кодів",
    "feature_1": {
      "title": "Підписування документів у декількох форматах",
      "content": "Додавайте кілька типів підписів, включаючи підписи тексту, зображень, штрих-кодів, QR-кодів та штампів, до будь-якого підтримуваного формату документа. Розміщуйте їх на будь-якій сторінці та керуйте метаданими документа. Забезпечте безпеку документа за допомогою цифрових сертифікатів для запобігання несанкціонованим змінам."
    },
    "feature_2": {
      "title": "Ефективна перевірка підписів",
      "content": "Перевіряйте всі підписи у документі, аби забезпечити їх відповідність встановленим стандартам. Легко знаходьте та переглядайте підписи за допомогою вбудованої функції пошуку."
    },
    "feature_3": {
      "title": "Гнучке редагування підписів",
      "content": "Оновлюйте або модифікуйте існуючі підписи, коригуючи такі аспекти, як вміст, розташування, розмір та колір, відповідно до потреб вашого документа після початкового підписування."
    },
    "feature_4": {
      "title": "Легке видалення підписів",
      "content": "Видаляйте будь-які небажані або застарілі підписи, включаючи цифрові сертифікати, без труднощів. Повний контроль над управлінням підписами забезпечує чистий та добре організований документ."
    }
  },
  "formats": {
    "title": "Інтеграція QR-кодів з різними формами файлів",
    "description": "Скористайтеся API {{EnvName}} для генерації QR-кодів та вбудовуйте їх у різноманітні широко використовувані формати файлів. Оточте важливі дані цими штрих-кодами для безперешкодної інтеграції та подальшого отримання."
  },
  "operations": {
    "title": "Зрозумійте наші основні можливості",
    "description": "Ми пропонуємо широкий вибір форматів підписів та операцій, адаптованих до ваших потреб."
  },
  "examples": {
    "comment_1": "Створіть екземпляр {{TextSignature}} та передайте шлях до документа",
    "comment_2": "Використовуйте {{QrCodeSignOptions}} для вставки QR-коду у документ",
    "comment_3": "Визначте тип підпису та його розташування на сторінці",
    "comment_4": "Збережіть документ з новоствореним QR-кодом"
  },
  "steps": {
    "title": "Довідник зі створення та вбудовування QR-коду в будь-яке місце в {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) дозволяє створювати QR-коди в різних широко використовуваних форматах та їх інтеграцію на сторінки {{FileFormatUp}}. Підтримуючи понад 10 різних типів QR-кодів, наше рішення можна безперешкодно впроваджувати у програми {{EnvName}}, збагачуючи їх можливостями підписування QR-кодів.",
      "step_1": "Надайте файл {{FileFormatUp}} або потік для підписання QR-коду.",
      "step_2": "Введіть бажаний текст у екземпляр {{QrCodeSignOptions}}.",
      "step_3": "Відкоригуйте візуальні параметри, такі як колір, розташування, розмір тощо.",
      "step_4": "Збережіть документ, що містить QR-код."
    }
  },
  "code_1": {
    "title": "Налаштування згенерованого QR-коду",
    "content": "Цей приклад деталізує процес додавання кастомізованого QR-коду на сторінку {{FileFormatUp}}.",
    "comment_1": "Отримайте документ, що підписується, та передайте його у {{TextSignature}}",
    "comment_2": "Налаштуйте параметри QR-коду з необхідним текстом",
    "comment_3": "Визначте позицію QR-коду на сторінці",
    "comment_4": "Вкажіть відступ підпису",
    "comment_5": "Виберіть колір QR-коду",
    "comment_6": "Визначте параметри шрифту для супровідного повідомлення",
    "comment_7": "Налаштуйте фон та кисть для QR-коду",
    "comment_8": "Вбудуйте QR-код у документ"
  }
}