{
  "head": {
    "title": "Генеруйте QR-коди для файлів {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Використовуйте API {{ProdShortName}} для генерації та вбудовування QR-кодів у файли {{FileFormatUp}}. Легко розміщуйте QR-коди на будь-якій сторінці, щоб додати додаткову функціональність."
  },
  "header": {
    "title": "Генеруйте QR-коди для {{FileFormatUp}}",
    "description": "Створюйте 2D-штрих-коди, використовуючи текст або числові дані, та застосовуйте їх до різних сторінок і форматів, включаючи PDF, Word, Excel та інше за допомогою {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Безкоштовна пробна версія"
  },
  "about": {
    "title": "Досліджуйте можливості {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує широкий спектр можливостей, дозволяючи користувачам генерувати та вбудовувати різні типи підписів у основних форматах документів. Незалежно від того, чи це PDF, Word, Excel, PowerPoint чи зображення, покращуйте свої документи підписами: Текстовими, Зображеннями, Штрих-кодами, QR-кодами, Метаданими, Цифровими або Штампами."
  },
  "more_features": {
    "title": "Комплексна інтеграція підписів для документів",
    "description": "З API {{ProdFullName}} користувачі можуть генерувати, змінювати, шукати, підтверджувати та видаляти різні типи підписів, спростивши документи за допомогою точності.",
    "image_description": "Ключові особливості {{ProdShortName}}",
    "feature_1": {
      "title": "Застосування кількох типів підписів",
      "content": "{{ProdShortName}} дозволяє застосовувати текстові, зображення, штрих-коди, QR-коди та штампи до будь-якого документа. Ви можете точно розміщувати підписи на будь-якій сторінці та легко керувати метаданими. Захистіть свої документи від несанкціонованих змін за допомогою цифрових сертифікатів."
    },
    "feature_2": {
      "title": "Шукати та підтверджувати підписи",
      "content": "Перевіряйте підписи документів на достовірність та точність за допомогою розширених інструментів перевірки. Легко отримуйте детальний список усіх підписів, інтегрованих у документ, для кращого контролю."
    },
    "feature_3": {
      "title": "Змінюйте наявні підписи",
      "content": "Ви можете оновлювати раніше застосовані підписи, налаштовуючи вміст, позицію, колір, розмір та інші атрибути відповідно до ваших конкретних потреб."
    },
    "feature_4": {
      "title": "Швидко видаляйте підписи",
      "content": "Оптимізуйте управління документами, швидко видаляючи непотрібні підписи. Незалежно від того, чи це цифровий сертифікат або інший тип підпису, видалення можна виконати ефективно."
    }
  },
  "formats": {
    "title": "Вбудовуйте QR-коди в різні формати документів",
    "description": "Використовуйте API {{EnvName}} для вбудовування QR-кодів у будь-який стандартний формат документів. Зберігайте та кодуйте важливу інформацію у 2D-штрих-кодах для простого сканування та отримання даних."
  },
  "operations": {
    "title": "Досліджуйте наші рішення для підписів",
    "description": "Ми пропонуємо широкий вибір типів підписів та операцій, щоб задовольнити ваші документообігові потреби."
  },
  "examples": {
    "comment_1": "Ініціалізуйте новий екземпляр {{TextSignature}} з документом",
    "comment_2": "Використовуйте {{QrCodeSignOptions}} для вбудовування QR-коду в документ",
    "comment_3": "Вкажіть тип підпису та задайте його позицію на сторінці",
    "comment_4": "Збережіть документ з вбудованим QR-кодом"
  },
  "steps": {
    "title": "Кроки для генерації та вставки QR-коду в {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) дозволяє створювати QR-коди у популярних форматах та розміщувати їх на сторінках {{FileFormatUp}}. Завдяки підтримці понад 10 типів QR-кодів, ви можете безперешкодно інтегрувати цю функціональність у додатки {{EnvName}}. Покращте свої документи підписами QR-кодів за допомогою нашого продукту.",
      "step_1": "Отримайте файл {{FileFormatUp}} або потік, куди буде додано QR-код.",
      "step_2": "Надайте необхідний текст у {{QrCodeSignOptions}}.",
      "step_3": "Налаштуйте візуальні параметри, такі як колір, позиція та розмір.",
      "step_4": "Збережіть документ з вбудованим QR-кодом."
    }
  },
  "code_1": {
    "title": "Налаштування згенерованого QR-коду",
    "content": "Цей приклад показує, як розмістити налаштований QR-код на сторінці {{FileFormatUp}}.",
    "comment_1": "Отримайте документ, що підписується, та передайте його в {{TextSignature}}",
    "comment_2": "Налаштуйте параметри QR-коду з необхідним текстом",
    "comment_3": "Встановіть позицію QR-коду на сторінці",
    "comment_4": "Встановіть відступи для підпису",
    "comment_5": "Виберіть колір QR-коду",
    "comment_6": "Визначте шрифтові параметри для повідомлення",
    "comment_7": "Встановіть колір фону та малюнок для QR-коду",
    "comment_8": "Вбудуйте QR-код у документ"
  }
}