{
  "head": {
    "title": "สร้าง QR code สำหรับ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "API ของ {{ProdShortName}} ช่วยให้สามารถสร้าง QR code สำหรับไฟล์ {{FileFormatUp}} ได้ สร้าง QR code จากเนื้อหาของคุณและวางลงบนหน้าใดก็ได้."
  },
  "header": {
    "title": "สร้าง QR codes สำหรับ {{FileFormatUp}}",
    "description": "สร้างบาร์โค้ด 2 มิติที่มีข้อความและข้อมูลเชิงตัวเลขได้ และวางบนหน้าใดก็ได้ของเอกสารหลายประเภทโดยใช้ {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ทดลองใช้ฟรี"
  },
  "about": {
    "title": "เรียนรู้เพิ่มเติมเกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีฟีเจอร์ที่หลากหลายในการสร้างและฝังลายเซ็นประเภทต่างๆ ในเอกสารที่สำคัญทั้งหมด รองรับ PDF, เอกสาร Word, สเปรดชีต Excel, งานนำเสนอ PowerPoint และภาพถ่าย เพิ่มความสามารถให้กับเอกสารของคุณด้วย ลายเซ็น Text, Image, Barcode, QR Code, Metadata, Digital และ Stamp."
  },
  "more_features": {
    "title": "เพิ่มลายเซ็นให้กับเอกสารของคุณ",
    "description": "API ของ {{ProdFullName}} รองรับการลงทะเบียนในฟอร์แมตไฟล์ยอดนิยมทั้งหมด สร้าง แก้ไข ค้นหา ตรวจสอบ และลบลายเซ็นประเภทต่างๆ.",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "ลงนามเอกสาร",
      "content": "{{ProdShortName}} รองรับการลงนามด้วยลายเซ็น Text, Image, Barcode, QR Code และ Stamp วางลายเซ็นในหน้าใดก็ได้ของฟอร์แมตเอกสารที่รองรับ จัดการข้อมูลเมตาของเอกสารด้วยลายเซ็นข้อมูลเมตา และป้องกันเนื้อหาจากการเปลี่ยนแปลงที่ไม่ได้รับอนุญาตโดยใช้ใบรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "ค้นหาและการตรวจสอบ",
      "content": "รับประกันว่าลายเซ็นทั้งหมดในเอกสารนั้นถูกต้องตามขั้นตอนการตรวจสอบ ดึงข้อมูลลายเซ็นทั้งหมดในเอกสารด้วยฟีเจอร์ค้นหาที่สร้างไว้."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็น",
      "content": "ดำเนินการแก้ไขคุณสมบัติลายเซ็นได้ง่ายหลังจากที่ทำการลงชื่อ ปรับแต่งเนื้อหา ตำแหน่ง สี ขนาด และคุณสมบัติอื่นๆ ตามที่ต้องการ."
    },
    "feature_4": {
      "title": "ลบลายเซ็น",
      "content": "ลบลายเซ็นที่ไม่ต้องการได้อย่างง่ายดาย ลายเซ็นประเภทต่างๆ รวมถึงใบรับรองดิจิทัล สามารถถูกลบออกจากเอกสารได้ทางโปรแกรม."
    }
  },
  "formats": {
    "title": "สร้าง QR codes สำหรับฟอร์แมตไฟล์เพิ่มเติม",
    "description": "เพิ่ม QR codes ลงในฟอร์แมตไฟล์ยอดนิยมทั้งหมดด้วย API ของ {{EnvName}} เพิ่มข้อมูลบาร์โค้ด 2 มิติสำหรับการสแกนและการประมวลผลอย่างรวดเร็ว."
  },
  "operations": {
    "title": "ชมข้อเสนอหลักของเรา",
    "description": "เรามีการเลือกฟีเจอร์การลงนามและการปฏิบัติการขั้นสูงที่หลากหลาย"
  },
  "examples": {
    "comment_1": "ส่งเอกสารไปยังอินสแตนซ์ใหม่ของ {{TextSignature}}",
    "comment_2": "ใช้ {{QrCodeSignOptions}} เพื่อเพิ่ม QR code ลงในเอกสาร",
    "comment_3": "ระบุประเภทลายเซ็นและตำแหน่งบนหน้า",
    "comment_4": "บันทึกไฟล์ที่มี QR code เพิ่มเติม"
  },
  "steps": {
    "title": "ขั้นตอนในการสร้างและวาง QR code ที่ตำแหน่งใดก็ได้ใน {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) สามารถสร้าง QR code ในหลายฟอร์แมตที่เป็นที่นิยมและวางลงบนหน้า {{FileFormatUp}} รองรับ QR code มากกว่า 10 ประเภทและสามารถรวมเข้ากับแอปพลิเคชัน {{EnvName}} ได้อย่างรวดเร็ว ใช้ผลิตภัณฑ์ของเราเพื่อทำการลงนามเอกสารด้วย QR codes ที่สร้างขึ้น.",
      "step_1": "รับไฟล์หรือสตรีม {{FileFormatUp}} ที่ต้องการลงนามด้วย QR code.",
      "step_2": "ระบุข้อความสำหรับ {{QrCodeSignOptions}}.",
      "step_3": "ปรับแต่งตัวเลือกทางสายตา เช่น สี ตำแหน่ง ขนาด เป็นต้น.",
      "step_4": "บันทึกไฟล์ที่มี QR code."
    }
  },
  "code_1": {
    "title": "วิธีการปรับแต่ง QR code ที่สร้างขึ้น",
    "content": "ใช้ตัวอย่างนี้เพื่อเรียนรู้วิธีวาง QR code ใหม่ลงในหน้า {{FileFormatUp}}.",
    "comment_1": "รับเอกสารที่ต้องการลงนามและส่งไปยัง {{TextSignature}}",
    "comment_2": "ใช้ตัวเลือก QR code ในการให้ข้อความพร้อมข้อมูลที่ต้องการ",
    "comment_3": "ตั้งค่าตำแหน่งสัมพัทธ์ของ QR code บนหน้า",
    "comment_4": "ตั้งค่าขอบของลายเซ็น",
    "comment_5": "ระบุสีของ QR code",
    "comment_6": "กำหนดตัวเลือกฟอนต์สำหรับข้อความ",
    "comment_7": "ปรับแต่งสีพื้นหลังและแปรงของ QR code",
    "comment_8": "เพิ่ม QR code ลงในเอกสาร"
  }
}