{
  "head": {
    "title": "Создание QR-кода для {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "API {{ProdShortName}} позволяет генерировать QR-коды для файлов {{FileFormatUp}}. Создавайте QR-коды из вашего контента и размещайте их на любом странице."
  },
  "header": {
    "title": "Создание QR-кодов для {{FileFormatUp}}",
    "description": "Создавайте 2D штрихкоды с текстом и числовыми данными и размещайте их на любых страницах различных документов, используя {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Бесплатная пробная версия"
  },
  "about": {
    "title": "Узнайте больше о {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предлагает широкий спектр возможностей для генерации и встраивания различных типов подписей во все основные форматы документов. Он поддерживает PDF, документы Word, электронные таблицы Excel, презентации PowerPoint и изображения. Улучшайте ваши документы с помощью текстовых, изображенческих, штриховых, QR-кодов, метаданных, цифровых и штамповых подписей."
  },
  "more_features": {
    "title": "Добавление подписей к вашим документам",
    "description": "API {{ProdFullName}} поддерживает подпись всех популярных форматов файлов. Генерируйте, изменяйте, ищите, проверяйте и удаляйте различные типы подписей.",
    "image_description": "Ключевые возможности {{ProdShortName}}",
    "feature_1": {
      "title": "Подписание документов",
      "content": "{{ProdShortName}} поддерживает подпись с помощью текстовых, изображенческих, штриховых, QR-кодов и штамповых подписей. Размещайте их на любой странице любого поддерживаемого формата документа. Управляйте метаданными документов с помощью подписей метаданных и защищайте содержимое от несанкционированных изменений, используя цифровые сертификаты."
    },
    "feature_2": {
      "title": "Поиск и проверка",
      "content": "Убедитесь, что все подписи в документе действительны с помощью процедуры проверки. Получайте полный список подписей в документе с помощью встроенной функции поиска."
    },
    "feature_3": {
      "title": "Изменение подписей",
      "content": "Изменяйте свойства подписей после их создания. Корректируйте содержимое, позицию, цвет, размер и другие атрибуты по мере необходимости."
    },
    "feature_4": {
      "title": "Удаление подписей",
      "content": "Удаляйте ненужные подписи без труда. Различные типы подписей, включая цифровые сертификаты, могут быть удалены из документов программным способом."
    }
  },
  "formats": {
    "title": "Генерация QR-кодов для дополнительных форматов файлов",
    "description": "Улучшайте все популярные форматы файлов с помощью генерируемых QR-кодов, используя API {{EnvName}}. Добавляйте данные 2D штрихкода для удобного сканирования и обработки."
  },
  "operations": {
    "title": "Изучите наши ключевые предложения",
    "description": "Мы предлагаем разнообразный выбор функций подписей и продвинутых операций."
  },
  "examples": {
    "comment_1": "Передайте документ в новый экземпляр {{TextSignature}}",
    "comment_2": "Используйте {{QrCodeSignOptions}}, чтобы добавить QR-код в документ",
    "comment_3": "Укажите тип и позицию подписи на странице",
    "comment_4": "Сохраните файл с добавленным QR-кодом"
  },
  "steps": {
    "title": "Шаги для генерации и размещения QR-кода в любом месте {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) может генерировать QR-коды во множестве популярных форматов и размещать их на страницах {{FileFormatUp}}. Поддерживается более 10 типов QR-кодов, которые можно быстро интегрировать в приложения {{EnvName}}. Используйте наш продукт для подписания документов с генерируемыми QR-кодами.",
      "step_1": "Получите файл или поток {{FileFormatUp}}, который необходимо подписать с QR-кодом.",
      "step_2": "Предоставьте текст для {{QrCodeSignOptions}}.",
      "step_3": "Настройте визуальные параметры, такие как цвет, положение, размер и т.д.",
      "step_4": "Сохраните файл с QR-кодом."
    }
  },
  "code_1": {
    "title": "Как настроить сгенерированный QR-код",
    "content": "Используйте этот пример, чтобы узнать, как разместить новый QR-код на странице {{FileFormatUp}}.",
    "comment_1": "Получите документ, который нужно подписать, и передайте его в {{TextSignature}}",
    "comment_2": "Используйте параметры QR-кода, чтобы предоставить текст с необходимой информацией",
    "comment_3": "Установите относительное положение QR-кода на странице",
    "comment_4": "Установите отступ для подписи",
    "comment_5": "Укажите цвет QR-кода",
    "comment_6": "Определите параметры шрифта для сообщения",
    "comment_7": "Настройте цвет фона QR-кода и его границы",
    "comment_8": "Добавьте QR-код в документ"
  }
}