{
  "head": {
    "title": "Generate 2D Barcodes in {{FileFormatUp}} Documents with {{ProgLang}}",
    "description": "Utilize the {{ProdShortName}} API to create and integrate 2D barcodes within {{FileFormatUp}} files. Effortlessly place QR codes on any document page."
  },
  "header": {
    "title": "Embed QR Codes in {{FileFormatUp}} Files Using {{ProgLang}}",
    "description": "Create and embed 2D barcodes with customizable content, including text and numeric data, across various document types like PDFs, Word, Excel, and Images with {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Try It Free"
  },
  "about": {
    "title": "Explore {{ProdFullName}} Capabilities",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) offers advanced document enhancement tools, enabling the generation and embedding of multiple signature types, including QR codes, into popular file formats. Sign and secure PDFs, Word documents, Excel spreadsheets, PowerPoint presentations, and images with Text, Image, Barcode, QR Code, Metadata, Digital, and Stamp signatures."
  },
  "more_features": {
    "title": "Comprehensive Signature and QR Code Integration",
    "description": "With {{ProdFullName}} API, you can manage a full spectrum of signatures. Generate, customize, verify, search, and remove signatures effortlessly across different document types, offering unmatched flexibility for your workflows.",
    "image_description": "Signature and QR Code Features",
    "feature_1": {
      "title": "Multi-Format Document Signing",
      "content": "Add multiple types of signatures, including Text, Image, Barcode, QR Code, and Stamp signatures, to any supported document format. Place them on any page, and manage document metadata. Ensure document security through digital certificates to prevent unauthorized changes."
    },
    "feature_2": {
      "title": "Efficient Signature Validation",
      "content": "Validate all signatures within a document to ensure they meet required standards. Easily retrieve and review signatures through the built-in search functionality."
    },
    "feature_3": {
      "title": "Flexible Signature Editing",
      "content": "Update or modify existing signatures, adjusting aspects such as content, location, size, and color, to suit your document’s needs after initial signing."
    },
    "feature_4": {
      "title": "Signature Removal Made Easy",
      "content": "Remove any unwanted or obsolete signatures, including digital certificates, with ease. Full control over signature management ensures a clean and well-organized document."
    }
  },
  "formats": {
    "title": "Integrate QR Codes with Various File Formats",
    "description": "Leverage the {{EnvName}} API to generate QR codes and embed them into a variety of widely-used file formats. Encapsulate important data in these barcodes for seamless integration and future retrieval."
  },
  "operations": {
    "title": "Understand Our Main Capabilities",
    "description": "We deliver a broad selection of signature formats and operations tailored to your needs"
  },
  "examples": {
    "comment_1": "Create a {{TextSignature}} instance and pass the document path",
    "comment_2": "Leverage {{QrCodeSignOptions}} to insert a QR-Code into the document",
    "comment_3": "Define the signature type and placement on the page",
    "comment_4": "Store the document with the newly added QR-Code"
  },
  "steps": {
    "title": "Guidelines for Generating and Embedding a QR-Code in {{FileFormatUp}} Pages",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) enables the creation of QR-Codes in various widely-used formats and their integration into {{FileFormatUp}} pages. Supporting over 10 distinct QR-Code types, our solution can be seamlessly incorporated into {{EnvName}} applications, enriching them with QR-Code signing capabilities.",
      "step_1": "Provide the {{FileFormatUp}} file or stream for QR-Code signing.",
      "step_2": "Input the desired text into the {{QrCodeSignOptions}} instance.",
      "step_3": "Adjust visual settings such as color, positioning, size, etc.",
      "step_4": "Save the document containing the QR-Code."
    }
  },
  "code_1": {
    "title": "Customizing a Generated QR-Code",
    "content": "This example details the process of adding a customized QR-Code to a {{FileFormatUp}} page.",
    "comment_1": "Obtain the document to be signed and pass it to {{TextSignature}}",
    "comment_2": "Set up QR-Code options with the required text",
    "comment_3": "Determine the QR-Code's position on the page",
    "comment_4": "Specify the signature padding",
    "comment_5": "Choose the QR-Code color",
    "comment_6": "Define the font options for the accompanying message",
    "comment_7": "Customize the background color and brush for the QR-Code",
    "comment_8": "Embed the QR-Code into the document"
  }
}