{
  "head": {
    "title": "สร้าง QR code ในเอกสาร {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ใช้ API {{ProdShortName}} เพื่อสร้างและรวมบาร์โค้ด 2 มิติในไฟล์ {{FileFormatUp}} วาง QR code ได้อย่างสะดวกบนหน้ากระดาษเอกสารใดๆ"
  },
  "header": {
    "title": "สร้าง QR codes สำหรับ {{FileFormatUp}}",
    "description": "สร้างและฝังบาร์โค้ด 2 มิติที่มาพร้อมกับเนื้อหาที่ปรับแต่งได้ รวมถึงข้อความและข้อมูลตัวเลขในเอกสารประเภทต่างๆ เช่น PDFs, Word, Excel และ ภาพ ด้วย {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ทดลองใช้ฟรี"
  },
  "about": {
    "title": "สำรวจความสามารถของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) นำเสนอเครื่องมือปรับปรุงเอกสารที่ล้ำสมัย ช่วยให้สามารถสร้างและฝังลายเซ็นหลากหลายประเภท รวมถึง QR codes ในรูปแบบไฟล์ยอดนิยม ลงนามและรักษาความปลอดภัย PDF, Word, Excel, PowerPoint และภาพ ด้วยลายเซ็นประเภทข้อความ, รูปภาพ, บาร์โค้ด, QR code, เมตาดาทา, ดิจิทัล และตราประทับ"
  },
  "more_features": {
    "title": "การรวมลายเซ็นและ QR code อย่างครบถ้วน",
    "description": "ด้วย API {{ProdFullName}} คุณสามารถจัดการลายเซ็นได้หลากหลายประเภทได้ง่ายดาย สร้าง ปรับแต่ง ตรวจสอบ ค้นหา และลบลายเซ็นอย่างมีประสิทธิภาพในเอกสารประเภทต่างๆ มอบความยืดหยุ่นที่ไม่เปรียบเทียบให้กับกระบวนการทำงานของคุณ",
    "image_description": "คุณสมบัติของลายเซ็นและ QR code",
    "feature_1": {
      "title": "การลงนามเอกสารหลายรูปแบบ",
      "content": "เพิ่มหลายประเภทของลายเซ็น รวมถึงลายเซ็นประเภทข้อความ, รูปภาพ, บาร์โค้ด, QR code, และตราประทับ ลงในรูปแบบเอกสารที่รองรับใดๆ วางพวกเขาในหน้าที่ต้องการ และจัดการเมตาดาทาของเอกสาร มั่นใจในความปลอดภัยของเอกสารผ่านใบรับรองดิจิทัลเพื่อป้องกันการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต"
    },
    "feature_2": {
      "title": "การตรวจสอบลายเซ็นอย่างมีประสิทธิภาพ",
      "content": "ตรวจสอบลายเซ็นทั้งหมดภายในเอกสารเพื่อให้แน่ใจว่าตรงตามมาตรฐานที่กำหนด ค้นหาและตรวจสอบลายเซ็นได้อย่างง่ายดายผ่านฟังก์ชันการค้นหาที่มีในตัว"
    },
    "feature_3": {
      "title": "การแก้ไขลายเซ็นที่ยืดหยุ่น",
      "content": "ปรับปรุงหรือตัดต่อรายละเอียดของลายเซ็นที่มีอยู่ ปรับเปลี่ยนเนื้อหา ตำแหน่ง ขนาด และสีให้เหมาะสมกับความต้องการของเอกสารหลังจากการลงนามครั้งแรก"
    },
    "feature_4": {
      "title": "การลบลายเซ็นได้ง่าย",
      "content": "ลบลายเซ็นที่ไม่ต้องการหรือไม่เป็นปัจจุบัน ซึ่งรวมถึงใบรับรองดิจิทัล ได้อย่างง่ายดาย การควบคุมการจัดการลายเซ็นอย่างเต็มรูปแบบช่วยให้เอกสารของคุณมีความสะอาดและเป็นระเบียบ"
    }
  },
  "formats": {
    "title": "รวม QR codes กับรูปแบบไฟล์ต่างๆ",
    "description": "ใช้ API {{EnvName}} เพื่อสร้าง QR codes และฝังลงในรูปแบบไฟล์ที่ใช้กันอย่างแพร่หลาย สื่อสารข้อมูลสำคัญภายในบาร์โค้ดเพื่อการรวมเข้าที่ราบรื่นและการเรียกคืนในอนาคต"
  },
  "operations": {
    "title": "ทำความเข้าใจกับความสามารถหลักของเรา",
    "description": "เรามีการให้บริการลายเซ็นรูปแบบและการดำเนินการที่กว้างขวางซึ่งปรับให้เหมาะสมกับความต้องการของคุณ"
  },
  "examples": {
    "comment_1": "สร้างตัวอย่าง {{TextSignature}} และส่งเอกสารไปยังพาธ",
    "comment_2": "ใช้ {{QrCodeSignOptions}} เพื่อแทรก QR code ในเอกสาร",
    "comment_3": "กำหนดประเภทลายเซ็นและตำแหน่งบนหน้า",
    "comment_4": "บันทึกเอกสารที่มี QR code ใหม่ที่เพิ่มเข้ามา"
  },
  "steps": {
    "title": "คู่มือการสร้างและฝัง QR code ในตำแหน่งใดก็ได้ภายใน {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) รองรับการสร้าง QR codes ในรูปแบบที่ใช้กันทั่วไปและสามารถรวมเข้ากับหน้า {{FileFormatUp}} ได้ รองรับ QR code ประเภทต่างๆ มากกว่า 10 ประเภท เราจึงสามารถรวมเข้ากับแอปพลิเคชัน {{EnvName}} ได้อย่างราบรื่น เพิ่มความสามารถในการลงนาม QR code ให้กับแอปพลิเคชันของคุณ.",
      "step_1": "ให้ไฟล์หรือสตรีม {{FileFormatUp}} สำหรับการลงนาม QR code.",
      "step_2": "ป้อนข้อความที่ต้องการในอินสแตนซ์ {{QrCodeSignOptions}}.",
      "step_3": "ปรับการตั้งค่าทางภาพ เช่น สี ตำแหน่ง ขนาด เป็นต้น.",
      "step_4": "บันทึกเอกสารที่มี QR code."
    }
  },
  "code_1": {
    "title": "ปรับแต่ง QR code ที่สร้างขึ้น",
    "content": "ตัวอย่างนี้ให้รายละเอียดเกี่ยวกับกระบวนการเพิ่ม QR code ที่ปรับแต่งลงในหน้า {{FileFormatUp}}.",
    "comment_1": "รับเอกสารที่จะลงนามและส่งไปยัง {{TextSignature}}",
    "comment_2": "ตั้งค่าตัวเลือก QR code พร้อมข้อความที่ต้องการ",
    "comment_3": "ระบุตำแหน่ง QR code บนหน้า",
    "comment_4": "ระบุกระแสการเซ็นชื่อ",
    "comment_5": "เลือกสีของ QR code",
    "comment_6": "กำหนดตัวเลือกฟอนต์สำหรับข้อความที่แนบมา",
    "comment_7": "ปรับแต่งสีพื้นหลังและแปรงสำหรับ QR code",
    "comment_8": "ฝัง QR code ลงในเอกสาร"
  }
}