{
  "head": {
    "title": "สร้าง QR Code สำหรับไฟล์ {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ใช้ API {{ProdShortName}} ในการสร้างและฝัง QR Code ในไฟล์ {{FileFormatUp}} เพื่อเพิ่มฟังก์ชันการทำงานที่หลากหลายให้กับเอกสารของคุณ."
  },
  "header": {
    "title": "สร้าง QR Code สำหรับ {{FileFormatUp}}",
    "description": "สร้างบาร์โค้ด 2 มิติจากข้อมูลข้อความหรือข้อมูลตัวเลขและใช้งานได้กับหลายหน้าและรูปแบบ รวมถึง PDF, Word, Excel และอื่นๆ ด้วย {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ทดลองใช้ฟรี"
  },
  "about": {
    "title": "สำรวจฟีเจอร์ของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีความสามารถที่หลากหลายช่วยให้ผู้ใช้สามารถสร้างและฝังลายเซ็นประเภทต่างๆ ลงในฟอร์แมตเอกสารหลัก ๆ ไม่ว่าจะเป็น PDF, Word, Excel, PowerPoint หรือภาพ ถ้าต้องการพัฒนาเอกสารของคุณด้วยลายเซ็นประเภทข้อความ, รูปภาพ, บาร์โค้ด, QR Code, เมตาดาต้า, ลายเซ็นดิจิทัล หรือ สแตมป์."
  },
  "more_features": {
    "title": "การรวมลายเซ็นอย่างครบถ้วนสำหรับเอกสาร",
    "description": "ด้วย API {{ProdFullName}} ผู้ใช้สามารถสร้าง แก้ไข ค้นหา ยืนยัน และลบลายเซ็นประเภทต่าง ๆ ทำให้การทำงานเอกสารเป็นไปอย่างมีประสิทธิภาพ.",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "ใช้ลายเซ็นประเภทต่าง ๆ",
      "content": "{{ProdShortName}} รองรับการใช้ลายเซ็นประเภทข้อความ, รูปภาพ, บาร์โค้ด, QR Code, และ สแตมป์ลงในเอกสารใด ๆ คุณสามารถวางลายเซ็นได้อย่างแม่นยำในทุกหน้าและบริหารจัดการข้อมูลเมตาได้อย่างง่ายดาย ป้องกันเอกสารของคุณจากการแก้ไขที่ไม่ได้รับอนุญาตด้วยใบรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "ค้นหาและยืนยันลายเซ็น",
      "content": "ตรวจสอบลายเซ็นในเอกสารเพื่อความถูกต้องและความถูกต้องแม่นยำโดยใช้เครื่องมือตรวจสอบขั้นสูง รับรายชื่อแบบละเอียดของลายเซ็นทั้งหมดที่ฝังอยู่ในเอกสารได้ง่ายดายเพื่อให้มีการตรวจสอบที่ดียิ่งขึ้น."
    },
    "feature_3": {
      "title": "ปรับปรุงลายเซ็นที่มีอยู่",
      "content": "คุณสามารถอัปเดตลายเซ็นที่ได้ใช้ไปแล้วโดยการปรับเนื้อหา ตำแหน่ง สี ขนาด และองค์ประกอบอื่น ๆ เพื่อให้เหมาะสมกับความต้องการเฉพาะของคุณ."
    },
    "feature_4": {
      "title": "ลบลายเซ็นได้อย่างรวดเร็ว",
      "content": "ทำให้การจัดการเอกสารราบรื่นโดยการลบลายเซ็นที่ไม่ต้องการได้อย่างรวดเร็ว ไม่ว่าจะเป็นใบรับรองดิจิทัลหรือลายเซ็นประเภทอื่น การลบสามารถทำได้อย่างมีประสิทธิภาพ."
    }
  },
  "formats": {
    "title": "ฝัง QR Code ในรูปแบบเอกสารที่หลากหลาย",
    "description": "ใช้ API {{EnvName}} เพื่อฝัง QR Code ลงในรูปแบบเอกสารมาตรฐานอุตสาหกรรมใด ๆ เก็บและเข้ารหัสข้อมูลที่สำคัญลงในบาร์โค้ด 2 มิติสำหรับการสแกนและรับข้อมูลที่สะดวก."
  },
  "operations": {
    "title": "สำรวจโซลูชันลายเซ็นของเรา",
    "description": "เรามีลายเซ็นประเภทต่าง ๆ และการดำเนินการหลากหลายเพื่อตอบสนองความต้องการด้านเอกสารของคุณ."
  },
  "examples": {
    "comment_1": "เริ่มต้นอินสแตนซ์ {{TextSignature}} ใหม่ด้วยเอกสาร",
    "comment_2": "ใช้ {{QrCodeSignOptions}} เพื่อฝัง QR Code ลงในเอกสาร",
    "comment_3": "ระบุประเภทลายเซ็นและตั้งค่าตำแหน่งบนหน้า",
    "comment_4": "บันทึกเอกสารที่มี QR Code ฝังอยู่"
  },
  "steps": {
    "title": "ขั้นตอนในการสร้างและแทรก QR Code ใน {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณสร้าง QR Code ในรูปแบบที่นิยมและวางลงบนหน้าของ {{FileFormatUp}} รองรับ QR Code มากกว่า 10 ประเภท คุณสามารถรวมฟังก์ชันนี้เข้ากับแอปพลิเคชัน {{EnvName}} ได้อย่างราบรื่น พัฒนาเอกสารของคุณด้วยลายเซ็น QR Code โดยใช้ผลิตภัณฑ์ของเรา.",
      "step_1": "รับไฟล์หรือสตรีม {{FileFormatUp}} ที่จะมีการเพิ่ม QR Code.",
      "step_2": "ระบุข้อความที่จำเป็นใน {{QrCodeSignOptions}}.",
      "step_3": "ปรับแต่งการตั้งค่าทางสายตาเช่น สี ตำแหน่ง และขนาด.",
      "step_4": "บันทึกเอกสารที่มี QR Code ฝังอยู่."
    }
  },
  "code_1": {
    "title": "ปรับแต่ง QR Code ที่สร้างขึ้น",
    "content": "ตัวอย่างนี้แสดงวิธีการวาง QR Code ที่ปรับปรุงลงบนหน้าของ {{FileFormatUp}}.",
    "comment_1": "นำเอกสารที่ต้องการลายเซ็นไปและส่งไปยัง {{TextSignature}}",
    "comment_2": "ตั้งค่าตัวเลือก QR Code พร้อมข้อความที่จำเป็น",
    "comment_3": "กำหนดตำแหน่งของ QR Code บนหน้า",
    "comment_4": "ตั้งค่าขอบสำหรับลายเซ็น",
    "comment_5": "เลือกสีของ QR Code",
    "comment_6": "กำหนดตัวเลือกฟอนต์สำหรับข้อความ",
    "comment_7": "กำหนดสีพื้นหลังและแปรงสำหรับ QR Code",
    "comment_8": "ฝัง QR Code ลงในเอกสาร"
  }
}