{
  "head": {
    "title": "تولید کدهای QR در اسناد {{FileFormatUp}} با {{ProgLang}}",
    "description": "از API {{ProdShortName}} برای ایجاد و ادغام بارکدهای دو بعدی در فایل‌های {{FileFormatUp}} استفاده کنید. به راحتی کدهای QR را در هر صفحه از سند قرار دهید."
  },
  "header": {
    "title": "ساخت کدهای QR برای {{FileFormatUp}}",
    "description": "با استفاده از {{ProdFullName}}، بارکدهای دو بعدی با محتوای قابل سفارشی‌سازی، از جمله متن و داده‌های عددی، را در انواع مختلف اسناد مانند PDF، Word، Excel و تصاویر ایجاد و درج کنید.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "به صورت رایگان امتحان کنید"
  },
  "about": {
    "title": "فرصت‌های {{ProdFullName}} را بررسی کنید",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ابزارهای پیشرفته بهبود اسناد را ارائه می‌دهد که امکان تولید و درج انواع مختلف امضا، از جمله کدهای QR، را در فرمت‌های رایج فایل‌ فراهم می‌کند. PDFها، مستندات Word، صفحات گسترده Excel، ارائه‌های PowerPoint و تصاویر را با امضاهای متنی، تصویری، بارکدی، کد QR، متاداده، دیجیتال و مهر امضا کنید و ایمن کنید."
  },
  "more_features": {
    "title": "یکپارچه‌سازی جامع امضا و کد QR",
    "description": "با API {{ProdFullName}} می‌توانید زنجیره کاملی از امضاها را مدیریت کنید. امضاها را به راحتی تولید، سفارشی‌سازی، تأیید، جستجو و حذف کنید و انعطاف‌پذیری بی‌نظیری به گردش کارهای خود ارائه دهید.",
    "image_description": "ویژگی‌های امضا و کد QR",
    "feature_1": {
      "title": "امضای سند چندفرمت",
      "content": "انواع مختلفی از امضاها، از جمله امضاهای متنی، تصویری، بارکدی، کد QR و مهر را به هر فرمت سند پشتیبانی شده اضافه کنید. آنها را در هر صفحه قرار دهید و متاداده سند را مدیریت کنید. امنیت سند را از طریق گواهی‌های دیجیتال برای جلوگیری از تغییرات غیرمجاز تأمین کنید."
    },
    "feature_2": {
      "title": "تأیید امضاها به طور مؤثر",
      "content": "تمام امضاها در یک سند را بررسی کنید تا مطمئن شوید که استانداردهای مورد نیاز را رعایت می‌کنند. به راحتی امضاها را از طریق قابلیت جستجوی داخلی بازیابی و مرور کنید."
    },
    "feature_3": {
      "title": "ویرایش امضاهای انعطاف‌پذیر",
      "content": "امضاهای موجود را به‌روزرسانی یا تغییر دهید و جنبه‌هایی از قبیل محتوا، مکان، اندازه و رنگ را تنظیم کنید تا با نیازهای سند شما پس از امضای اولیه مطابقت داشته باشد."
    },
    "feature_4": {
      "title": "حذف امضا به راحتی",
      "content": "هرگونه امضای ناخواسته یا غیرضروری، از جمله گواهی‌های دیجیتال را به سادگی حذف کنید. کنترل کامل بر مدیریت امضاها تضمین می‌کند که سندی پاک و مرتب داشته باشید."
    }
  },
  "formats": {
    "title": "ادغام کدهای QR با فرمت‌های مختلف فایل",
    "description": "از API {{EnvName}} برای تولید کدهای QR و قرارگیری آنها در فرمت‌های رایج استفاده کنید. داده‌های مهم را در این بارکدها محصور کنید تا یکپارچگی بدون درز و بازیابی آینده را تأمین کنید."
  },
  "operations": {
    "title": "درک قابلیت‌های اصلی ما",
    "description": "ما انتخاب گسترده‌ای از فرمت‌های امضا و عملیات متناسب با نیازهای شما ارائه می‌دهیم."
  },
  "examples": {
    "comment_1": "یک نمونه {{TextSignature}} ایجاد کرده و مسیر سند را پاس دهید",
    "comment_2": "از {{QrCodeSignOptions}} برای درج یک کد QR به سند استفاده کنید",
    "comment_3": "نوع امضا و محل قرارگیری آن در صفحه را تعیین کنید",
    "comment_4": "سند را با کد QR تازه اضافه شده ذخیره کنید"
  },
  "steps": {
    "title": "راهنمای تولید و درج یک کد QR در هر نقطه از {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) امکان تولید کدهای QR در فرمت‌های رایج مختلف و ادغام آنها به صفحات {{FileFormatUp}} را فراهم می‌کند. با پشتیبانی از بیش از 10 نوع مختلف کد QR، راه حل ما به‌راحتی می‌تواند در برنامه‌های {{EnvName}} گنجانده شود و به آنها قابلیت‌های امضای کد QR را اضافه کند.",
      "step_1": "فایل یا جریان {{FileFormatUp}} را برای امضای کد QR ارائه دهید.",
      "step_2": "متن دلخواه را به نمونه {{QrCodeSignOptions}} وارد کنید.",
      "step_3": "تنظیمات بصری مانند رنگ، موقعیت، اندازه و غیره را تنظیم کنید.",
      "step_4": "سند حاوی کد QR را ذخیره کنید."
    }
  },
  "code_1": {
    "title": "سفارشی‌سازی یک کد QR تولید شده",
    "content": "این نمونه جزئیات فرآیند افزودن یک کد QR سفارشی به یک صفحه {{FileFormatUp}} را توضیح می‌دهد.",
    "comment_1": "سند برای امضا را به‌دست آورده و به {{TextSignature}} پاس دهید",
    "comment_2": "تنظیمات کد QR را با متن مورد نیاز تنظیم کنید",
    "comment_3": "محل کد QR را در صفحه تعیین کنید",
    "comment_4": "فاصله امضا را مشخص کنید",
    "comment_5": "رنگ کد QR را انتخاب کنید",
    "comment_6": "گزینه‌های فونت برای پیام همراه را تعریف کنید",
    "comment_7": "رنگ پس‌زمینه و قلم برای کد QR را سفارشی‌سازی کنید",
    "comment_8": "کد QR را به سند وارد کنید"
  }
}