{
  "head": {
    "title": "Генерация QR-кодов в документах {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "Используйте API {{ProdShortName}} для создания и интеграции 2D штрих-кодов в файлы {{FileFormatUp}}. Легко размещайте QR-коды на любой странице документа."
  },
  "header": {
    "title": "Создание QR-кодов для {{FileFormatUp}}",
    "description": "Создавайте и встраивайте 2D штрих-коды с настраиваемым содержимым, включая текст и числовые данные, в различные типы документов, такие как PDF, Word, Excel и изображения с использованием {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Попробовать бесплатно"
  },
  "about": {
    "title": "Изучите возможности {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предлагает передовые инструменты для улучшения документов, позволяя создавать и встраивать различные типы подписей, включая QR-коды, в популярные форматы файлов. Подписывайте и защищайте PDF, документы Word, таблицы Excel, презентации PowerPoint и изображения с помощью текстовых, графических, штрих-кодов, QR-кодов, метаданных, цифровых и печатных подписей."
  },
  "more_features": {
    "title": "Всеобъемлющая интеграция подписей и QR-кодов",
    "description": "С помощью API {{ProdFullName}} вы можете управлять полным спектром подписей. Генерируйте, настраивайте, проверяйте, ищите и удаляйте подписи без усилий в различных типах документов, предоставляя непревзойденную гибкость для ваших рабочих процессов.",
    "image_description": "Функции подписи и QR-кода",
    "feature_1": {
      "title": "Подписание документов в нескольких форматах",
      "content": "Добавляйте различные типы подписей, включая текстовые, графические, штрих-коды, QR-коды и печати, в любой поддерживаемый формат документа. Размещайте их на любой странице и управляйте метаданными документа. Обеспечьте безопасность документа с помощью цифровых сертификатов для предотвращения несанкционированных изменений."
    },
    "feature_2": {
      "title": "Эффективная проверка подписи",
      "content": "Проверяйте все подписи в документе, чтобы убедиться, что они соответствуют необходимым стандартам. Легко получайте и просматривайте подписи с помощью встроенной функции поиска."
    },
    "feature_3": {
      "title": "Гибкое редактирование подписей",
      "content": "Обновляйте или изменяйте существующие подписи, настраивая такие параметры, как содержание, расположение, размер и цвет, в соответствии с потребностями вашего документа после первоначальной подписи."
    },
    "feature_4": {
      "title": "Простое удаление подписей",
      "content": "Удаляйте любые нежелательные или устаревшие подписи, включая цифровые сертификаты, без усилий. Полный контроль над управлением подписями обеспечивает чистый и организованный документ."
    }
  },
  "formats": {
    "title": "Интеграция QR-кодов с различными форматами файлов",
    "description": "Используйте API {{EnvName}} для генерации QR-кодов и их встраивания в широкий спектр широко используемых форматов файлов. Инкапсулируйте важные данные в этих штрих-кодах для бесшовной интеграции и дальнейшего извлечения."
  },
  "operations": {
    "title": "Понять наши основные возможности",
    "description": "Мы предлагаем широкий выбор форматов подписей и операций, адаптированных к вашим потребностям."
  },
  "examples": {
    "comment_1": "Создайте экземпляр {{TextSignature}} и передайте путь к документу",
    "comment_2": "Используйте {{QrCodeSignOptions}} для вставки QR-кода в документ",
    "comment_3": "Определите тип подписи и размещение на странице",
    "comment_4": "Сохраните документ с новым QR-кодом"
  },
  "steps": {
    "title": "Руководство по генерации и встраиванию QR-кода в любом месте {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) позволяет создавать QR-коды в различных широко используемых форматах и интегрировать их в страницы {{FileFormatUp}}. Поддерживая более 10 различных типов QR-кодов, наше решение может быть seamlessly incorporated в приложения {{EnvName}}, обогащая их возможностями подписания QR-кодом.",
      "step_1": "Предоставьте файл или поток {{FileFormatUp}} для подписания QR-кода.",
      "step_2": "Введите желаемый текст в экземпляр {{QrCodeSignOptions}}.",
      "step_3": "Настройте визуальные параметры, такие как цвет, позиционирование, размер и т.д.",
      "step_4": "Сохраните документ с содержащим QR-код."
    }
  },
  "code_1": {
    "title": "Настройка сгенерированного QR-кода",
    "content": "Этот пример описывает процесс добавления настраиваемого QR-кода на страницу {{FileFormatUp}}.",
    "comment_1": "Получите документ для подписи и передайте его в {{TextSignature}}",
    "comment_2": "Настройте параметры QR-кода с необходимым текстом",
    "comment_3": "Определите позицию QR-кода на странице",
    "comment_4": "Укажите отступ для подписи",
    "comment_5": "Выберите цвет QR-кода",
    "comment_6": "Определите параметры шрифта для сопровождающего сообщения",
    "comment_7": "Настройте цвет фона и кисть для QR-кода",
    "comment_8": "Вставьте QR-код в документ"
  }
}