{
  "head": {
    "title": "Генерация QR-кода для файлов {{FileFormatUp}} с использованием {{ProgLang}}",
    "description": "Используйте API {{ProdShortName}} для генерации QR-кода для файлов {{FileFormatUp}}. Легко встраивайте QR-коды на любые страницы для повышения функциональности."
  },
  "header": {
    "title": "Генерация QR-кодов для {{FileFormatUp}}",
    "description": "Генерируйте 2D-штрих-коды, используя текстовые или числовые данные, и применяйте их на нескольких страницах и в различных форматах, включая PDF, Word, Excel и др., через {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Начните свою бесплатную пробную версию"
  },
  "about": {
    "title": "Изучите возможности {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предлагает широкий спектр функций, позволяющих пользователям генерировать и встраивать различные типы подписей в основные форматы документов. Будь то PDF, документы Word, таблицы Excel, презентации PowerPoint или файловые изображения, вы можете улучшить свои документы, добавив текстовые, изображенческие, штрих-кодовые, QR-коды, метаданные, цифровые и штампованные подписи."
  },
  "more_features": {
    "title": "Комплексная интеграция подписей для документов",
    "description": "С помощью API {{ProdFullName}} пользователи могут без усилий генерировать, изменять, искать, проверять и удалять разнообразные типы подписей, оптимизируя рабочие процессы с документами с беспрецедентной точностью.",
    "image_description": "Ключевые функции {{ProdShortName}}",
    "feature_1": {
      "title": "Подписание документов с несколькими типами подписей",
      "content": "{{ProdShortName}} позволяет применять текстовые, изображенческие, штрих-кодовые, QR-кодовые и штампованные подписи к любому формату документа. Подписи могут быть точно размещены на любой странице, а управление метаданными может осуществляться через метаданные подписей. Защитите целостность своих документов, внедрив цифровые сертификаты, которые предотвращают несанкционированные изменения."
    },
    "feature_2": {
      "title": "Поиск и валидация подписей",
      "content": "Проверьте подлинность и точность подписей документа с помощью продвинутого процесса валидации. Легко получите подробный список всех подписей, встроенных в документ, для комплексного контроля."
    },
    "feature_3": {
      "title": "Настраиваемое редактирование подписей",
      "content": "Обновляйте и доработывайте ранее нанесенные подписи, изменяя содержимое, расположение, цвет, размер и другие атрибуты в соответствии с вашими конкретными требованиями."
    },
    "feature_4": {
      "title": "Эффективное удаление подписей",
      "content": "Оптимизируйте управление документами, программно удаляя ненужные подписи. Независимо от того, касается ли это цифровых сертификатов или других видов подписей, удаление может быть выполнено быстро и эффективно."
    }
  },
  "formats": {
    "title": "Генерация QR-кодов для других форматов документов",
    "description": "Улучшите все стандартные форматы файлов с возможностью встраивания QR-кодов с помощью API {{EnvName}}. Храните и кодируйте критически важную информацию в 2D-штрих-коды для бесшовного сканирования и извлечения данных."
  },
  "operations": {
    "title": "Узнайте о наших решениях по подписям",
    "description": "С гордостью представляем широкий спектр типов подписей и эксплуатационных возможностей"
  },
  "examples": {
    "comment_1": "Инициализируйте новый экземпляр {{TextSignature}} с документом",
    "comment_2": "Используйте {{QrCodeSignOptions}} для встраивания QR-кода в документ",
    "comment_3": "Укажите тип подписи и определите её положение на странице",
    "comment_4": "Сохраните документ с интегрированным QR-кодом"
  },
  "steps": {
    "title": "Как сгенерировать и вставить QR-код в любом месте документа {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) упрощает генерацию QR-кодов в различных популярных форматах и их размещение на страницах {{FileFormatUp}}. Поддерживая более 10 типов QR-кодов, наша библиотека может быть легко интегрирована в приложения {{EnvName}}. Улучшите свои документы с помощью подписей QR-кода, используя наш продукт.",
      "step_1": "Получите файл или поток {{FileFormatUp}}, который необходимо подписать QR-кодом.",
      "step_2": "Предоставьте необходимый текст для {{QrCodeSignOptions}}.",
      "step_3": "Настройте визуальные параметры, такие как цвет, положение, размер и т. д.",
      "step_4": "Сохраните документ с встроенным QR-кодом."
    }
  },
  "code_1": {
    "title": "Как сгенерировать QR-код с различными параметрами?",
    "content": "Этот пример демонстрирует, как разместить настроенный QR-код на странице {{FileFormatUp}}.",
    "comment_1": "Получите документ для подписи и передайте его в {{TextSignature}}",
    "comment_2": "Настройте параметры QR-кода с необходимым текстом",
    "comment_3": "Укажите относительное положение QR-кода на странице",
    "comment_4": "Установите отступы для подписи",
    "comment_5": "Укажите цвет QR-кода",
    "comment_6": "Определите параметры шрифта для сообщения",
    "comment_7": "Настройте цвет фона QR-кода и его стиль",
    "comment_8": "Вставьте QR-код в документ"
  }
}