{
  "head": {
    "title": "ฝังบาร์โค้ดในเอกสาร {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "เพิ่มลายเซ็นบาร์โค้ดอย่างมีประสิทธิภาพในเอกสาร {{FileFormatUp}} ด้วยโค้ดไม่กี่บรรทัดใน {{ProgLang}}. {{ProdShortName}} มอบโซลูชันการลงนามที่ราบรื่นสำหรับหลายรูปแบบเอกสาร."
  },
  "header": {
    "title": "สร้างบาร์โค้ดสำหรับ {{FileFormatUp}}",
    "description": "ด้วย {{ProdFullName}} คุณสามารถวางบาร์โค้ดในเอกสารทางธุรกิจได้ทุกที่ที่ต้องการ โซลูชันของเรามีตัวเลือกที่ยืดหยุ่นสำหรับการปรับแต่งลายเซ็นบาร์โค้ด.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ทดลองใช้ฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือสำหรับลงนามเอกสารที่ทรงพลังซึ่งรองรับประเภทลายเซ็นที่หลากหลาย รวมถึงข้อความ รูปภาพ บาร์โค้ด ใบรับรองดิจิทัล และตราประทับ รองรับรูปแบบไฟล์มากกว่า 60 รูปแบบ เช่น PDF, MS Office, รูปภาพ, ZIP และอื่นๆ ไม่เพียงแค่ให้คุณสามารถใช้ลายเซ็นได้ แต่ยังช่วยให้คุณค้นหา ตรวจสอบ แก้ไข หรือเอาลายเซ็นออกตามต้องการ."
  },
  "more_features": {
    "title": "เสริมความสามารถให้เอกสารของคุณด้วยฟีเจอร์ลายเซ็นขั้นสูง",
    "description": "ไลบรารี {{ProdFullName}} ให้โซลูชันที่ครอบคลุมสำหรับการลงนามและประมวลผลเอกสารในรูปแบบที่ใช้งานทั่วไป คุณสามารถเพิ่ม แก้ไข ตรวจสอบ หรือเอาลายเซ็นประเภทต่างๆ ออกได้ตามความต้องการ.",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การลงนามเอกสารที่ยืดหยุ่น",
      "content": "ลงนามในหน้าใดก็ได้ในเอกสารที่รองรับด้วยข้อความ รูปภาพ บาร์โค้ด โค้ด QR หรือตราประทับ เพิ่มข้อมูลเมตาแบบซ่อน เช่น ข้อมูล EXIF ในรูปภาพ และรับประกันการป้องกันเนื้อหาด้วยใบรับรองดิจิทัลเพื่อป้องกันการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต."
    },
    "feature_2": {
      "title": "ค้นหาและตรวจสอบลายเซ็น",
      "content": "เครื่องมือของเราช่วยให้มั่นใจในความถูกต้องของเอกสารของคุณโดยการเปิดใช้งานการตรวจสอบลายเซ็น นอกจากนี้คุณยังสามารถดึงรายการลายเซ็นทั้งหมดในเอกสารได้เพื่อการจัดการที่สะดวก."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็นได้อย่างง่ายดาย",
      "content": "ปรับแก้ลายเซ็นที่มีอยู่ได้อย่างไม่ยุ่งยาก ปรับข้อความ เปลี่ยนตำแหน่งขององค์ประกอบ หรือเปลี่ยนสีให้เหมาะสมกับความต้องการของเอกสารของคุณ."
    },
    "feature_4": {
      "title": "ลบลายเซ็นได้อย่างง่ายดาย",
      "content": "ด้วยฟังก์ชัน CRUD แบบเต็มรูปแบบ {{ProdFullName}} ทำให้การลบลายเซ็นที่ไม่ต้องการหรือเก่าออกจากเอกสารของคุณเป็นเรื่องง่าย."
    }
  },
  "formats": {
    "title": "ลงนามเอกสารในหลายรูปแบบ",
    "description": "API {{EnvName}} รองรับการลงนามในรูปแบบไฟล์มากกว่า 60 รูปแบบ ทำให้คุณสามารถเพิ่มลายเซ็นประเภทต่างๆ ลงในหน้าใดก็ได้หรือตำแหน่งเฉพาะในเอกสารของคุณ."
  },
  "operations": {
    "title": "สำรวจฟีเจอร์หลักของเรา",
    "description": "เรามีตัวเลือกและการดำเนินการที่หลากหลายสำหรับความต้องการเอกสารของคุณ."
  },
  "examples": {
    "comment_1": "เริ่มต้นวัตถุ {{TextSignature}} ด้วยเส้นทางเอกสาร",
    "comment_2": "ใช้ {{BarcodeSignOptions}} เพื่อเพิ่มบาร์โค้ดลงในเอกสาร",
    "comment_3": "ตั้งค่าประเภทบาร์โค้ดและกำหนดคุณสมบัติของมัน",
    "comment_4": "บันทึกเอกสารที่ลงนามแล้ว"
  },
  "steps": {
    "title": "ขั้นตอนในการสร้างและแทรกบาร์โค้ดใน {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้คุณสามารถสร้างและฝังบาร์โค้ดในเอกสาร {{FileFormatUp}} ได้อย่างรวดเร็ว รองรับบาร์โค้ดมากกว่า 60 รูปแบบ แอปพลิเคชัน {{EnvName}} สามารถเพิ่มฟังก์ชันการลงนามบาร์โค้ดได้อย่างราบรื่นโดยการรวมไลบรารีของเรา.",
      "step_1": "ให้ไฟล์หรือสตรีม {{FileFormatUp}} สำหรับการประมวลผล.",
      "step_2": "กำหนดข้อความบาร์โค้ดในวัตถุ {{BarcodeSignOptions}}.",
      "step_3": "ปรับแต่งตัวเลือกบาร์โค้ด เช่น ตำแหน่งและขนาด.",
      "step_4": "บันทึกเอกสารพร้อมบาร์โค้ดที่ฝังอยู่."
    }
  },
  "code_1": {
    "title": "สร้างและวางลายเซ็นบาร์โค้ด",
    "content": "ตัวอย่างนี้แสดงวิธีการแทรกบาร์โค้ดกำหนดเองลงในเอกสาร {{FileFormatUp}}.",
    "comment_1": "ให้เอกสารที่จะถูกลงนาม",
    "comment_2": "ตั้งค่าข้อความบาร์โค้ดและตัวเลือกการลงนาม",
    "comment_3": "เลือกตำแหน่งสำหรับบาร์โค้ดบนหน้า",
    "comment_4": "ตั้งค่าระยะห่างระหว่างบาร์โค้ดและขอบหน้า",
    "comment_5": "ระบุสีของแท่งบาร์โค้ด",
    "comment_6": "เลือกสไตล์ฟอนต์สำหรับข้อความบาร์โค้ด",
    "comment_7": "ตั้งค่าตำแหน่งของข้อความ",
    "comment_8": "ลงนามและบันทึกเอกสาร"
  }
}