{
  "head": {
    "title": "เพิ่มบาร์โค้ดในไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "สร้างและแทรกบาร์โค้ดลงในเอกสาร {{FileFormatUp}} ด้วย {{ProgLang}} โดยใช้ {{ProdShortName}} ที่รองรับการผสมผสานลายเซ็นที่หลากหลายสำหรับหลายรูปแบบ."
  },
  "header": {
    "title": "สร้างบาร์โค้ดสำหรับ {{FileFormatUp}}",
    "description": "เพิ่มบาร์โค้ดในรูปแบบที่เป็นที่นิยม ณ จุดใดก็ได้ในเอกสารธุรกิจของคุณด้วย {{ProdFullName}} โซลูชันของเราเสนอทางเลือกมากมายเพื่อปรับแต่งบาร์โค้ดลายเซ็น.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันการลงนามที่ทันสมัยที่รองรับประเภทลายเซ็นที่หลากหลาย คุณสามารถลงนามเอกสารด้วยข้อความ, รูปภาพ, บาร์โค้ด, ใบรับรองดิจิทัล, แสตมป์ และอื่น ๆ อีกกว่า 60 รูปแบบไฟล์ รวมถึง PDF, MS Office, รูปภาพ, ไฟล์ ZIP และรูปแบบธุรกิจยอดนิยมอื่น ๆ นอกจากนี้ ลายเซ็นในเอกสารที่เซ็นแล้วยังสามารถค้นหา, ตรวจสอบ, แก้ไข หรือ ลบได้ในทุกเวลา."
  },
  "more_features": {
    "title": "เสริมหรือปกป้องเนื้อหาเอกสารด้วยลายเซ็น",
    "description": "ไลบรารี {{ProdFullName}} ถูกออกแบบมาเพื่อการลงนามและการประมวลผลไฟล์รูปแบบยอดนิยมอย่างรวดเร็ว เพิ่ม, แก้ไข, ตรวจสอบ, หรือ ลบลายเซ็นประเภทต่าง ๆ ได้อย่างมีประสิทธิภาพ.",
    "image_description": "คุณสมบัติต่าง ๆ ของ {{ProdShortName}}",
    "feature_1": {
      "title": "การลงนามเอกสาร",
      "content": "ลงนามในหน้าใด ๆ ของเอกสารที่รองรับด้วยข้อความ, รูปภาพ, บาร์โค้ด, โค้ด QR หรือ แสตมป์ เพิ่มข้อมูลเมตาดาต้าที่ซ่อนอยู่เช่น EXIF ในรูปภาพหรือปกป้องเนื้อหาเอกสารจากการเปลี่ยนแปลงที่ไม่ได้รับอนุญาตโดยใช้ใบรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "การค้นหาและตรวจสอบลายเซ็น",
      "content": "คุณสามารถทำอะไรได้มากกว่าการตรวจสอบเอกสารที่เซ็นแล้ว เราเสนอการตรวจสอบลายเซ็นเพื่อให้แน่ใจว่าทุกอย่างเป็นไปตามที่คาดหวัง นอกจากนี้คุณยังสามารถดึงรายการลายเซ็นทั้งหมดในเอกสารได้ผ่านการค้นหา."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็น",
      "content": "ลายเซ็นที่เพิ่มเข้ามาส่วนใหญ่สามารถแก้ไขได้ แก้ไขข้อความ, ปรับตำแหน่ง หรือ เปลี่ยนสีได้อย่างง่ายดาย."
    },
    "feature_4": {
      "title": "ลบลายเซ็น",
      "content": "โซลูชันของเราให้การสนับสนุนการดำเนินการ CRUD เต็มรูปแบบสำหรับลายเซ็น หลายประเภทของลายเซ็นสามารถลบออกจากเอกสารได้ตามความจำเป็น."
    }
  },
  "formats": {
    "title": "ลงนามในเอกสารในรูปแบบอื่น ๆ",
    "description": "มากกว่า 60 รูปแบบสามารถลงนามได้โดยใช้ API {{EnvName}} ของเรา ใช้ลายเซ็นที่หลากหลายไปยังหน้าใดก็ตามหรือภายในเอกสาร."
  },
  "operations": {
    "title": "ค้นพบความสามารถหลักของเรา",
    "description": "เรานำเสนอความหลากหลายที่กว้างขวางของลายเซ็นและฟังก์ชันที่รองรับ."
  },
  "examples": {
    "comment_1": "สร้างอินสแตนซ์ {{TextSignature}} ใหม่พร้อมกับเส้นทางเอกสาร",
    "comment_2": "ใช้ {{BarcodeSignOptions}} เพื่อเพิ่มบาร์โค้ดลงในเอกสาร",
    "comment_3": "ตั้งค่าประเภทบาร์โค้ดและคุณสมบัติอื่น ๆ",
    "comment_4": "บันทึกไฟล์ที่ลงนาม"
  },
  "steps": {
    "title": "ขั้นตอนการสร้างและเพิ่มบาร์โค้ดในไฟล์ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) สามารถสร้างบาร์โค้ดในรูปแบบที่เป็นที่นิยมต่าง ๆ และวางไว้ในหน้า {{FileFormatUp}} ด้วยการสนับสนุนประเภทบาร์โค้ดมากกว่า 60 ประเภท แอปพลิเคชัน {{EnvName}} สามารถเพิ่มความสามารถในการลงนามด้วยบาร์โค้ดได้อย่างง่ายดายโดยการรวมไลบรารีของเรา.",
      "step_1": "จัดเตรียมไฟล์ {{FileFormatUp}} หรือสตรีมที่ต้องการการประมวลผล.",
      "step_2": "ส่งข้อความบาร์โค้ดไปยังอินสแตนซ์ {{BarcodeSignOptions}}.",
      "step_3": "ปรับแต่งตัวเลือกบาร์โค้ด เช่น ตำแหน่ง, ขนาด, ฯลฯ.",
      "step_4": "บันทึกไฟล์พร้อมกับบาร์โค้ดที่เพิ่มเข้ามาใหม่."
    }
  },
  "code_1": {
    "title": "วิธีสร้างลายเซ็นบาร์โค้ด",
    "content": "ตัวอย่างนี้แสดงให้เห็นว่าคุณจะวางบาร์โค้ดที่ปรับแต่งได้ในหน้าเอกสาร {{FileFormatUp}} ได้อย่างไร.",
    "comment_1": "จัดเตรียมเอกสารที่ต้องการลงนาม",
    "comment_2": "สร้างตัวเลือกการลงนามด้วยข้อความที่ต้องการ",
    "comment_3": "ตั้งค่าตำแหน่งสัมพัทธ์ของบาร์โค้ดบนหน้า",
    "comment_4": "ตั้งค่าช่องว่างบาร์โค้ดจากขอบหน้า",
    "comment_5": "กำหนดสีของบาร์",
    "comment_6": "กำหนดรูปแบบฟอนต์ข้อความ",
    "comment_7": "ระบุตำแหน่งข้อความ",
    "comment_8": "ลงนามและบันทึกเอกสาร"
  }
}