{
  "head": {
    "title": "สร้างบาร์โค้ดสำหรับ {{FileFormatUp}} โดยใช้แอปพลิเคชัน {{ProgLang}}",
    "description": "สร้างและฝังลายเซ็นบาร์โค้ดในเอกสาร {{FileFormatUp}} ด้วย {{ProgLang}} โดยใช้เพียงไม่กี่บรรทัดของโค้ด {{ProdShortName}} สนับสนุนการลงนามในหลายรูปแบบไฟล์."
  },
  "header": {
    "title": "สร้างและเพิ่มบาร์โค้ดใน {{FileFormatUp}} ได้อย่างรวดเร็ว",
    "description": "ใช้ {{ProdFullName}} เพื่อนำบาร์โค้ดไปใช้ในเอกสารธุรกิจของคุณ โดยวางไว้ในจุดที่ต้องการ โซลูชันของเรามีตัวเลือกการปรับแต่งที่หลากหลายให้คุณสามารถปรับแต่งลายเซ็นบาร์โค้ดตามความต้องการได้.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดทันที – ฟรี!"
  },
  "about": {
    "title": "การแนะนำ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือในการลงนามเอกสารที่ทรงพลัง รองรับรูปแบบลายเซ็นที่หลากหลายรวมถึงข้อความ รูปภาพ บาร์โค้ด ใบรับรองดิจิทัล และตราประทับ ด้วยความเข้ากันได้กับรูปแบบไฟล์มากกว่า 60 รูปแบบ เช่น PDFs, ไฟล์ MS Office, รูปภาพ และ ZIP archives ทำให้สามารถจัดการเอกสารได้อย่างครบถ้วน เส้นทางการลงนามในเอกสารสามารถค้นหา ตรวจสอบ แก้ไข หรือทำการลบได้ตามความต้องการ."
  },
  "more_features": {
    "title": "เสริมสร้างและรักษาความปลอดภัยให้เอกสารของคุณด้วยตัวเลือกลายเซ็นขั้นสูง",
    "description": "ไลบรารี {{ProdFullName}} ถูกออกแบบมาเพื่อทำให้กระบวนการลงนามและการจัดการกับรูปแบบเอกสารยอดนิยมทำได้ง่ายและรวดเร็ว เพิ่ม แก้ไข ตรวจสอบ หรือทำการลบลายเซ็นที่หลากหลายได้อย่างรวดเร็ว.",
    "image_description": "ฟังก์ชันหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "การลงนามเอกสารแบบไดนามิก",
      "content": "ลงนามในเอกสารของคุณในหน้าใดก็ได้โดยใช้ลายเซ็นที่หลากหลายรวมถึงข้อความ รูปภาพ บาร์โค้ด QR โค้ด และตราประทับ นอกจากนี้ คุณสามารถฝังข้อมูลเมตาดาต้าแบบซ่อน เช่น ข้อมูล EXIF ในรูปภาพ หรือรักษาความปลอดภัยให้เอกสารด้วยการใช้ใบรับรองดิจิทัลเพื่อป้องกันการแก้ไขที่ไม่ได้รับอนุญาต."
    },
    "feature_2": {
      "title": "การตรวจสอบและค้นหาลายเซ็นที่เชื่อถือได้",
      "content": "โซลูชันของเราเสนอเครื่องมือที่หลากหลายในการจัดการเอกสารที่ได้รับการลงนาม ตรวจสอบความถูกต้องของลายเซ็นเพื่อให้มั่นใจในความสมบูรณ์ของเอกสาร และใช้ฟีเจอร์ค้นหาเพื่อลิสต์ลายเซ็นทั้งหมดที่ฝังอยู่ภายในเอกสาร."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็นได้อย่างง่ายดาย",
      "content": "ลายเซ็นที่ถูกเพิ่มเข้ามาก่อนได้รับการปรับแก้ไขได้โดยง่าย อัปเดตข้อความ ปรับตำแหน่ง หรือเปลี่ยนรูปลักษณ์ของลายเซ็นให้ตรงตามความต้องการของคุณ."
    },
    "feature_4": {
      "title": "การลบลายเซ็นที่ราบรื่น",
      "content": "ด้วยการสนับสนุนการดำเนินการ CRUD อย่างครบถ้วน เครื่องมือของเราช่วยให้สามารถลบลายเซ็นจากเอกสารของคุณได้อย่างมีประสิทธิภาพ เพื่อให้แน่ใจว่าลายเซ็นที่มีความสำคัญที่สุดจะยังคงอยู่."
    }
  },
  "formats": {
    "title": "ลงนามในหลายรูปแบบเอกสาร",
    "description": "API {{EnvName}} ช่วยให้คุณสามารถลงนามในรูปแบบไฟล์มากกว่า 60 รูปแบบ ไม่ว่าจะเป็นการเพิ่มลายเซ็นในหน้าเฉพาะหรือการวางลายเซ็นในตำแหน่งที่ต้องการ เครื่องมือของเราทำให้การใช้ลายเซ็นประเภทต่าง ๆ ทำได้ง่าย."
  },
  "operations": {
    "title": "สัมผัสกับฟีเจอร์หลักของเรา",
    "description": "สำรวจลายเซ็นและเครื่องมือที่หลากหลายที่เรามีให้."
  },
  "examples": {
    "comment_1": "สร้างอ็อบเจ็กต์ {{TextSignature}} พร้อมกับพาธเอกสาร",
    "comment_2": "ใช้ {{BarcodeSignOptions}} เพื่อรวมบาร์โค้ดลงในเอกสาร",
    "comment_3": "กำหนดประเภทบาร์โค้ดและพารามิเตอร์เพิ่มเติม",
    "comment_4": "บันทึกเอกสารที่มีลายเซ็น"
  },
  "steps": {
    "title": "วิธีการสร้างและฝังบาร์โค้ดในไฟล์ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยในการสร้างและวางบาร์โค้ดในรูปแบบยอดนิยมหลากหลายอย่างในหน้า {{FileFormatUp}} โดยมีการสนับสนุนมากกว่า 60 ประเภทของบาร์โค้ด แอปพลิเคชัน {{EnvName}} สามารถปรับปรุงด้วยฟีเจอร์การลงนามบาร์โค้ดได้อย่างง่ายดายโดยการรวมไลบรารีของเราเข้าด้วยกัน.",
      "step_1": "จัดเตรียมไฟล์ {{FileFormatUp}} หรือสตรีมสำหรับการประมวลผล.",
      "step_2": "ส่งข้อความบาร์โค้ดไปยังอ็อบเจ็กต์ {{BarcodeSignOptions}}.",
      "step_3": "ปรับแต่งการตั้งค่าบาร์โค้ด เช่น ตำแหน่ง ขนาด ฯลฯ.",
      "step_4": "บันทึกเอกสารพร้อมกับบาร์โค้ดที่เพิ่มเข้าไปใหม่."
    }
  },
  "code_1": {
    "title": "วิธีการใช้ลายเซ็นบาร์โค้ด",
    "content": "ตัวอย่างนี้แสดงวิธีการฝังบาร์โค้ดที่กำหนดเองลงในหน้าเอกสาร {{FileFormatUp}}.",
    "comment_1": "จัดเตรียมเอกสารที่จะทำการลงนาม",
    "comment_2": "สร้างตัวเลือกสำหรับลายเซ็นด้วยข้อความบาร์โค้ดที่ต้องการ",
    "comment_3": "ตั้งค่าตำแหน่งสัมพัทธ์ของบาร์โค้ดบนหน้า",
    "comment_4": "กำหนดการเว้นระยะบาร์โค้ดจากขอบหน้า",
    "comment_5": "เลือกสีของบาร์",
    "comment_6": "ระบุรูปแบบฟอนต์สำหรับข้อความ",
    "comment_7": "ระบุตำแหน่งของข้อความ",
    "comment_8": "ลงนามและบันทึกเอกสาร"
  }
}