{
  "head": {
    "title": "Easily add barcodes to {{FileFormatUp}} files with {{ProgLang}}",
    "description": "Create and insert barcode signatures into {{FileFormatUp}} documents in {{ProgLang}} with ease. {{ProdShortName}} enables versatile signature integration for multiple formats."
  },
  "header": {
    "title": "Generate barcode for {{FileFormatUp}}",
    "description": "Add barcodes of popular formats to any position in your business documents with {{ProdFullName}}. Our solution provides extensive options to customize barcode signatures.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download for Free"
  },
  "about": {
    "title": "About {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is an advanced signing solution that supports a wide range of signature types. You can sign documents with text, images, barcodes, digital certificates, stamps, and more across 60+ file formats, including PDF, MS Office, images, ZIP files, and other popular business formats. Additionally, signatures in signed documents can be searched, verified, modified, or deleted at any time."
  },
  "more_features": {
    "title": "Enhance or protect document content with signatures",
    "description": "The {{ProdFullName}} library is designed for signing and further processing popular file formats. Quickly and easily add, modify, verify, or delete various types of signatures.",
    "image_description": "Features of {{ProdShortName}}",
    "feature_1": {
      "title": "Document signing",
      "content": "Sign any page of supported documents with text, images, barcodes, QR codes, or stamps. Add hidden metadata like EXIF in images or protect document content from unauthorized changes using digital certificates."
    },
    "feature_2": {
      "title": "Signature search and verification",
      "content": "There’s much more you can do with a signed document. We offer verification of signatures to ensure everything is in order. Additionally, you can retrieve a list of all document signatures through a search."
    },
    "feature_3": {
      "title": "Modify signatures",
      "content": "Most previously added signatures can be modified. Easily correct text, adjust position, or change color."
    },
    "feature_4": {
      "title": "Delete signatures",
      "content": "Our solution supports full CRUD operations for signatures. Many types of signatures can be deleted from a document when necessary."
    }
  },
  "formats": {
    "title": "Sign documents in other formats",
    "description": "Over 60 formats can be signed using our {{EnvName}} API. Apply various signatures to any page or position within the document."
  },
  "operations": {
    "title": "Discover our core capabilities",
    "description": "We proudly present an extensive variety of supported signatures and functions"
  },
  "examples": {
    "comment_1": "Create a new {{TextSignature}} instance with the document path",
    "comment_2": "Use {{BarcodeSignOptions}} to add a barcode to the document",
    "comment_3": "Set up the barcode type and other properties",
    "comment_4": "Save the signed file"
  },
  "steps": {
    "title": "Steps to generate and add a barcode to {{FileFormatUp}} file",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) can generate barcodes in various popular formats and place them on {{FileFormatUp}} pages. With support for over 60 barcode types, {{EnvName}} applications can easily be enhanced with barcode signing capabilities by incorporating our library.",
      "step_1": "Provide the {{FileFormatUp}} file or stream to be processed.",
      "step_2": "Pass the barcode text to the {{BarcodeSignOptions}} instance.",
      "step_3": "Customize barcode options such as position, size, etc.",
      "step_4": "Save the file with the newly added barcode."
    }
  },
  "code_1": {
    "title": "How to create a barcode signature",
    "content": "This example demonstrates how to place a customized barcode on {{FileFormatUp}} document pages.",
    "comment_1": "Provide the document to be signed",
    "comment_2": "Create signature options with the desired text",
    "comment_3": "Set the relative barcode position on the page",
    "comment_4": "Set the barcode padding from the page edge",
    "comment_5": "Set the color of the bars",
    "comment_6": "Define the message font style",
    "comment_7": "Specify the message position",
    "comment_8": "Sign and save the document"
  }
}