{
  "head": {
    "title": "Генерація штрих-коду для {{FileFormatUp}} за допомогою {{ProgLang}} додатків",
    "description": "Швидке генерування та вбудовування підпису штрих-коду в документ {{FileFormatUp}} за допомогою {{ProgLang}} лише за кілька рядків коду. {{ProdShortName}} підтримує підписування в різних форматах файлів."
  },
  "header": {
    "title": "Генеруйте та додавайте штрих-коди в {{FileFormatUp}}",
    "description": "Використовуйте {{ProdFullName}} для додавання штрих-кодів у ваші бізнес-документи, точно розміщуючи їх у потрібних місцях. Наше рішення пропонує широкий вибір можливостей налаштування для адаптації підписів штрих-кодів до ваших потреб.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажити зараз – безкоштовно!"
  },
  "about": {
    "title": "Ознайомлення з {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) – це потужний інструмент підписання документів, який підтримує різноманітні типи підписів, такі як текст, зображення, штрих-коди, цифрові сертифікати та штампи. За допомогою підтримки більше 60 форматів файлів, таких як PDF, файли MS Office, зображення та ZIP-архіви, ви зможете здійснювати всебічне управління документами. Підписи в документах можуть бути пошуковані, перевірені, змінені чи видалені за потребою."
  },
  "more_features": {
    "title": "Розширте та захистіть ваші документи за допомогою розширених можливостей підпису",
    "description": "Бібліотека {{ProdFullName}} розроблена для спрощення підписання та подальшого управління популярними форматами документів. Швидко та ефективно додавайте, змінюйте, перевіряйте чи видаляйте широкий спектр підписів.",
    "image_description": "Ключові функціональні можливості {{ProdShortName}}",
    "feature_1": {
      "title": "Динамічне підписання документів",
      "content": "Підписуйте будь-яку сторінку вашого документа за допомогою різноманітних типів підписів, включаючи текст, зображення, штрих-коди, QR-коди та штампи. Додатково ви можете вбудовувати приховану метадані, такі як EXIF-дані в зображеннях, або захистити документ від несанкціонованих змін за допомогою цифрових сертифікатів."
    },
    "feature_2": {
      "title": "Надійна перевірка підпису та пошук",
      "content": "Наше рішення надає широкий набір інструментів для управління підписаними документами. Перевіряйте автентичність підписів, щоб забезпечити цілісність документа, та використовуйте функцію пошуку для відображення всіх підписів, вбудованих у документ."
    },
    "feature_3": {
      "title": "Зручне редагування підписів",
      "content": "Більшість підписів, доданих раніше, можна легко змінити. Оновіть текст, змініть положення чи вигляд підпису відповідно до ваших потреб."
    },
    "feature_4": {
      "title": "Спрощене видалення підписів",
      "content": "З комплексною підтримкою операцій CRUD наш інструмент дозволяє ефективно видаляти підписи з ваших документів, забезпечуючи наявність лише найбільш актуальних підписів."
    }
  },
  "formats": {
    "title": "Підписуйте в різних форматах документів",
    "description": "API {{EnvName}} дає змогу підписувати понад 60 різних форматів. Незалежно від того, чи потрібно додати підписи до конкретних сторінок, чи точно їх розташувати, наш інструмент робить підписання різних типів підписів зручним."
  },
  "operations": {
    "title": "Зануртесь у наші основні функції",
    "description": "Відчуйте широкий спектр типів підписів та інструментів, які ми надаємо."
  },
  "examples": {
    "comment_1": "Інстанціюйте об'єкт {{TextSignature}} з шляхом до документа",
    "comment_2": "Використовуйте {{BarcodeSignOptions}} для вбудовування штрих-коду в документ",
    "comment_3": "Налаштуйте тип штрих-коду та додаткові параметри",
    "comment_4": "Збережіть підписаний документ"
  },
  "steps": {
    "title": "Як згенерувати та вбудувати штрих-коди в файл {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) дозволяє генерувати та розміщувати штрих-коди в різних популярних форматах на сторінках {{FileFormatUp}}. Підтримуючи понад 60 типів штрих-кодів, додатки {{EnvName}} можуть бути легко розширені можливостями підпису штрих-кодів за допомогою інтеграції нашої бібліотеки.",
      "step_1": "Надайте файл або потік {{FileFormatUp}} для обробки.",
      "step_2": "Передайте текст штрих-коду до екземпляра {{BarcodeSignOptions}}.",
      "step_3": "Налаштуйте параметри штрих-коду, такі як положення, розмір тощо.",
      "step_4": "Збережіть документ з новим доданим штрих-кодом."
    }
  },
  "code_1": {
    "title": "Як застосувати підпис штрих-коду",
    "content": "Цей приклад ілюструє, як вбудувати індивідуальний штрих-код на сторінки документа {{FileFormatUp}}.",
    "comment_1": "Надайте документ, який потрібно підписати",
    "comment_2": "Створіть параметри підпису з бажаним текстом штрих-коду",
    "comment_3": "Встановіть відносне положення штрих-коду на сторінці",
    "comment_4": "Визначте відстань між штрих-кодом та краєм сторінки",
    "comment_5": "Оберіть колір штрихів",
    "comment_6": "Вкажіть стиль шрифту для повідомлення",
    "comment_7": "Вкажіть позицію повідомлення",
    "comment_8": "Підпишіть і збережіть документ"
  }
}