{
  "head": {
    "title": "สร้างบาร์โค้ดสำหรับ {{FileFormatUp}} โดยใช้ {{ProgLang}} API",
    "description": "สร้างลายเซ็นบาร์โค้ดและรักษาความปลอดภัยให้กับเอกสาร {{FileFormatUp}} โดยใช้ {{ProgLang}} ด้วยโค้ดเพียงไม่กี่บรรทัด ใช้ {{ProdShortName}} สำหรับการลงนามในไฟล์รูปแบบหลากหลาย."
  },
  "header": {
    "title": "สร้างบาร์โค้ดสำหรับเอกสาร {{FileFormatUp}}",
    "description": "ใช้ {{ProdFullName}} วางบาร์โค้ดที่ใดก็ได้ภายในเอกสารธุรกิจของคุณ API ของเราเสนอทางเลือกการปรับแต่งที่กว้างขวางสำหรับลายเซ็นบาร์โค้ด.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "ภาพรวมของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชั่นการลงนามเอกสารที่ซับซ้อนซึ่งรองรับประเภทลายเซ็นที่หลากหลายรวมถึงข้อความ, รูปภาพ, บาร์โค้ด, ใบรับรองดิจิทัล, และตรายาง รองรับไฟล์รูปแบบมากกว่า 60 รูปแบบ—เช่น PDF, MS Office, รูปภาพ, ไฟล์ ZIP, และอื่นๆ—เครื่องมือนี้ช่วยให้คุณสามารถไม่เพียงแต่ใช้ลายเซ็น แต่ยังค้นหา, ตรวจสอบ, ดัดแปลง, หรือถอดออกตามความจำเป็น."
  },
  "more_features": {
    "title": "เพิ่มความสามารถและปกป้องเอกสารของคุณด้วยฟีเจอร์ลายเซ็นขั้นสูง",
    "description": "ไลบรารี {{ProdFullName}} ถูกออกแบบมาเพื่ออำนวยความสะดวกในการลงนามเอกสารและการประมวลผลควบคู่ไปกับไฟล์รูปแบบที่ใช้งานกันอย่างแพร่หลาย คุณสามารถเพิ่ม, ปรับแต่ง, ตรวจสอบ, หรือถอดลายเซ็นประเภทต่างๆ ได้อย่างสะดวก.",
    "image_description": "ฟีเจอร์เด่นของ {{ProdShortName}}",
    "feature_1": {
      "title": "การลงนามเอกสารที่หลากหลาย",
      "content": "ลงนามในเอกสารที่รองรับได้อย่างมีประสิทธิภาพโดยใช้ข้อความ, รูปภาพ, บาร์โค้ด, QR โค้ด, หรือตรายาง นอกจากนี้ยังสามารถฝังเมตาดาต้าที่ซ่อนอยู่ เช่น ข้อมูล EXIF ในรูปภาพ หรือป้องกันเนื้อหาของเอกสารของคุณจากการเปลี่ยนแปลงที่ไม่ได้รับอนุญาตโดยใช้ใบรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "การค้นหาและตรวจสอบลายเซ็นอย่างครอบคลุม",
      "content": "เครื่องมือของเราเสนอฟังก์ชันการทำงานที่เข้มแข็งสำหรับการทำงานกับเอกสารที่มีลายเซ็น ตรวจสอบความสมบูรณ์ของเอกสารของคุณโดยการตรวจสอบลายเซ็น และเรียกดูรายการลายเซ็นทั้งหมดภายในเอกสารได้อย่างง่ายดายผ่านฟีเจอร์ค้นหา."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็นได้อย่างสะดวก",
      "content": "ลายเซ็นที่ถูกนำไปใช้ก่อนหน้านี้เกือบทั้งหมดสามารถปรับแต่งได้ อัปเดตข้อความ, ปรับตำแหน่ง, หรือเปลี่ยนสีให้ตรงตามความต้องการของคุณ."
    },
    "feature_4": {
      "title": "การลบลายเซ็นอย่างมีประสิทธิภาพ",
      "content": "แนวทางของเราให้การสนับสนุนการดำเนินการ CRUD (สร้าง, อ่าน, อัปเดต, ลบ) สำหรับลายเซ็น ทำให้สามารถลบลายเซ็นที่ไม่ต้องการหรือล้าสมัยออกจากเอกสารของคุณได้อย่างรวดเร็ว."
    }
  },
  "formats": {
    "title": "ลงนามในเอกสารในรูปแบบที่หลากหลาย",
    "description": "API {{EnvName}} ของเรารองรับการลงนามในรูปแบบที่แตกต่างกันมากกว่า 60 รูปแบบ วางลายเซ็นประเภทต่างๆ ได้อย่างสะดวกในทุกหน้า หรือในตำแหน่งที่คุณต้องการภายในเอกสารของคุณ."
  },
  "operations": {
    "title": "ค้นพบฟีเจอร์หลักของเรา",
    "description": "เรามีตัวเลือกและการดำเนินการลายเซ็นที่น่าประทับใจ."
  },
  "examples": {
    "comment_1": "สร้างออบเจ็กต์ {{TextSignature}} ใหม่พร้อมกับพาธเอกสาร",
    "comment_2": "ใช้ {{BarcodeSignOptions}} เพื่อเพิ่มบาร์โค้ดลงในเอกสาร",
    "comment_3": "กำหนดประเภทบาร์โค้ดและคุณสมบัติเสริม",
    "comment_4": "บันทึกไฟล์ที่ลงนามแล้ว"
  },
  "steps": {
    "title": "ขั้นตอนการสร้างและฝังบาร์โค้ดในไฟล์ {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) อำนวยความสะดวกในการสร้างบาร์โค้ดในรูปแบบยอดนิยมหลายรูปแบบและวางบาร์โค้ดในหน้า {{FileFormatUp}} รองรับบาร์โค้ดชนิดมากกว่า 60 ชนิด แอปพลิเคชัน {{EnvName}} สามารถขยายฟังก์ชันการเซ็นบาร์โค้ดได้อย่างง่ายดายโดยการรวมไลบรารีของเราเข้าด้วยกัน.",
      "step_1": "จัดเตรียมไฟล์ {{FileFormatUp}} หรือสตรีมสำหรับการประมวลผล.",
      "step_2": "ส่งข้อความบาร์โค้ดไปยังออบเจ็กต์ {{BarcodeSignOptions}}.",
      "step_3": "ปรับแต่งตัวเลือกบาร์โค้ด เช่น ตำแหน่ง, ขนาด, เป็นต้น.",
      "step_4": "บันทึกไฟล์พร้อมบาร์โค้ดที่เพิ่มเข้ามา."
    }
  },
  "code_1": {
    "title": "วิธีสร้างลายเซ็นบาร์โค้ด",
    "content": "ตัวอย่างนี้แสดงวิธีฝังบาร์โค้ดที่กำหนดเองลงในหน้าเอกสาร {{FileFormatUp}}.",
    "comment_1": "ระบุเอกสารที่จะลงนาม",
    "comment_2": "สร้างตัวเลือกลายเซ็นด้วยข้อความที่ต้องการ",
    "comment_3": "กำหนดตำแหน่งสัมพัทธ์ของบาร์โค้ดบนหน้า",
    "comment_4": "กำหนดการตั้งค่าขอบบาร์โค้ดจากขอบหน้า",
    "comment_5": "ระบุสีของแถบ",
    "comment_6": "เลือกสไตล์ฟอนต์ข้อความ",
    "comment_7": "ระบุตำแหน่งข้อความ",
    "comment_8": "ลงนามและบันทึกเอกสาร"
  }
}