{
  "head": {
    "title": "Hasilkan kode batang untuk {{FileFormatUp}} menggunakan API {{ProgLang}}",
    "description": "Hasilkan tanda tangan kode batang dan amankan dokumen {{FileFormatUp}} menggunakan {{ProgLang}} hanya dengan beberapa baris kode. Manfaatkan {{ProdShortName}} untuk menandatangani berbagai format file."
  },
  "header": {
    "title": "Hasilkan kode batang untuk dokumen {{FileFormatUp}}",
    "description": "Manfaatkan {{ProdFullName}} untuk menempatkan kode batang di mana saja dalam dokumen bisnis Anda. API kami menawarkan opsi kustomisasi yang luas untuk tanda tangan kode batang.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Unduh gratis"
  },
  "about": {
    "title": "Ikhtisar {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) adalah solusi tanda tangan dokumen yang canggih yang mendukung berbagai jenis tanda tangan, termasuk teks, gambar, kode batang, sertifikat digital, dan cap. Kompatibel dengan lebih dari 60 format file—seperti PDF, MS Office, gambar, file ZIP, dan banyak lagi—alat ini memungkinkan Anda untuk tidak hanya menerapkan tanda tangan tetapi juga mencari, memverifikasi, memodifikasi, atau menghapusnya sesuai kebutuhan."
  },
  "more_features": {
    "title": "Tingkatkan dan lindungi dokumen Anda dengan kemampuan tanda tangan yang canggih",
    "description": "Library {{ProdFullName}} dirancang untuk memfasilitasi penandatanganan dokumen menyeluruh dan pemrosesan di berbagai format file yang umum digunakan. Anda dapat menambahkan, menyesuaikan, memverifikasi, atau menghapus berbagai jenis tanda tangan.",
    "image_description": "Fitur Utama {{ProdShortName}}",
    "feature_1": {
      "title": "Penandatanganan dokumen yang fleksibel",
      "content": "Tandatangani dengan efisien setiap halaman dalam dokumen yang didukung menggunakan teks, gambar, kode batang, kode QR, atau cap. Selain itu, tambahkan metadata tersembunyi, seperti data EXIF dalam gambar, atau amankan konten dokumen Anda dari perubahan tidak sah menggunakan sertifikat digital."
    },
    "feature_2": {
      "title": "Pencarian dan verifikasi tanda tangan yang menyeluruh",
      "content": "Alat kami menawarkan fungsi yang kuat untuk bekerja dengan dokumen yang ditandatangani. Pastikan integritas dokumen Anda dengan memverifikasi tanda tangan, dan ambil daftar lengkap semua tanda tangan dalam dokumen dengan mudah melalui fitur pencarian kami."
    },
    "feature_3": {
      "title": "Edit tanda tangan dengan gampang",
      "content": "Hampir semua tanda tangan yang telah diterapkan sebelumnya dapat dimodifikasi. Dengan nyaman, perbarui teks, sesuaikan posisi, atau ubah warna sesuai kebutuhan Anda."
    },
    "feature_4": {
      "title": "Penghapusan tanda tangan yang efisien",
      "content": "Pendekatan kami sepenuhnya mendukung operasi CRUD untuk tanda tangan, memungkinkan penghapusan cepat dari tanda tangan yang tidak diinginkan atau kadaluarsa dari dokumen Anda."
    }
  },
  "formats": {
    "title": "Tandatangani dokumen dalam berbagai format",
    "description": "API {{EnvName}} kami mendukung penandatanganan lebih dari 60 format berbeda. Dengan mudah tempatkan berbagai jenis tanda tangan pada setiap halaman atau di posisi yang diinginkan dalam dokumen Anda."
  },
  "operations": {
    "title": "Temukan fitur utama kami",
    "description": "Kami menawarkan pilihan dan operasi tanda tangan yang mengesankan"
  },
  "examples": {
    "comment_1": "Instansiasi objek {{TextSignature}} baru dengan jalur dokumen",
    "comment_2": "Gunakan {{BarcodeSignOptions}} untuk menambahkan kode batang ke dokumen",
    "comment_3": "Konfigurasikan jenis kode batang dan properti tambahan",
    "comment_4": "Simpan file yang ditandatangani"
  },
  "steps": {
    "title": "Langkah-langkah untuk menghasilkan dan menyematkan kode batang dalam file {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) memfasilitasi pembuatan kode batang dalam berbagai format populer dan penempatannya di halaman {{FileFormatUp}}. Mendukung lebih dari 60 jenis kode batang, aplikasi {{EnvName}} dapat dengan mudah ditingkatkan dengan fungsi penandatanganan kode batang dengan mengintegrasikan library kami.",
      "step_1": "Sediakan file atau stream {{FileFormatUp}} untuk diproses.",
      "step_2": "Serahkan teks kode batang ke instance {{BarcodeSignOptions}}.",
      "step_3": "Sesuaikan opsi kode batang seperti posisi, ukuran, dll.",
      "step_4": "Simpan file dengan kode batang yang baru ditambahkan."
    }
  },
  "code_1": {
    "title": "Cara menghasilkan tanda tangan kode batang",
    "content": "Contoh ini menunjukkan cara menyematkan kode batang yang dikustomisasi pada halaman dokumen {{FileFormatUp}}.",
    "comment_1": "Sediakan dokumen yang akan ditandatangani",
    "comment_2": "Rumuskan opsi tanda tangan dengan teks yang diinginkan",
    "comment_3": "Tentukan posisi relatif kode batang di halaman",
    "comment_4": "Tentukan jarak kode batang dari tepi halaman",
    "comment_5": "Tentukan warna batang",
    "comment_6": "Pilih gaya font untuk pesan",
    "comment_7": "Tentukan posisi pesan",
    "comment_8": "Tandatangani dan simpan dokumen"
  }
}