{
  "head": {
    "title": "Создание штрих-кода для {{FileFormatUp}} с использованием приложений {{ProgLang}}",
    "description": "Быстро создавайте и встраивайте штрих-код в документ {{FileFormatUp}} с помощью {{ProgLang}}, используя всего несколько строк кода. {{ProdShortName}} поддерживает подписание в нескольких форматах файлов."
  },
  "header": {
    "title": "Создавайте и добавляйте штрих-коды в {{FileFormatUp}} с минимальными усилиями",
    "description": "Используйте {{ProdFullName}} для интеграции штрих-кодов в ваши бизнес-документы, размещая их точно в нужных местах. Наше решение предлагает обширные возможности кастомизации, чтобы адаптировать штрих-кодовые подписи под ваши требования.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать сейчас — Это бесплатно!"
  },
  "about": {
    "title": "Введение в {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — это мощный инструмент для подписания документов, поддерживающий разнообразные типы подписей, включая текст, изображения, штрих-коды, цифровые сертификаты и штампы. С совместимостью более чем с 60 форматами файлов, такими как PDF, файлы MS Office, изображения и ZIP-архивы, он позволяет осуществлять комплексное управление документами. Подписи внутри документов могут быть найдены, проверены, изменены или удалены по мере необходимости."
  },
  "more_features": {
    "title": "Укрепите и защитите ваши документы с помощью расширенных опций подписания",
    "description": "Библиотека {{ProdFullName}} предназначена для упрощения подписания и последующего управления популярными форматами документов. Быстро и эффективно добавляйте, изменяйте, проверяйте или удаляйте широкий спектр подписей.",
    "image_description": "Ключевые функциональные возможности {{ProdShortName}}",
    "feature_1": {
      "title": "Динамическое подписывание документов",
      "content": "Подписывайте любую страницу ваших документов, используя различные типы подписей, включая текст, изображения, штрих-коды, QR-коды и штампы. Кроме того, вы можете встраивать скрытые метаданные, такие как EXIF-данные в изображениях, или защищать документ от несанкционированных редактирований с помощью цифровых сертификатов."
    },
    "feature_2": {
      "title": "Надежная проверка подписи и поиск",
      "content": "Наше решение предоставляет обширные инструменты для управления подписанными документами. Проверяйте подлинность подписей, чтобы гарантировать целостность документа, и используйте функцию поиска для отображения всех подписей, встроенных в документ."
    },
    "feature_3": {
      "title": "Простое редактирование подписей",
      "content": "Большинство ранее добавленных подписей можно легко изменить. Обновите текст, измените положение или внешний вид подписи в соответствии с вашими требованиями."
    },
    "feature_4": {
      "title": "Оптимизированное удаление подписей",
      "content": "С полным поддержкой операций CRUD наше средство позволяет эффективно удалять подписи из ваших документов, гарантируя, что останутся только самые актуальные подписи."
    }
  },
  "formats": {
    "title": "Подписание в различных форматах документов",
    "description": "API {{EnvName}} позволяет вам подписывать более 60 различных форматов. Будь то добавление подписей на конкретные страницы или точное их размещение, наше средство упрощает применение различных типов подписей."
  },
  "operations": {
    "title": "Откройте для себя наши основные функции",
    "description": "Ознакомьтесь с широким спектром типов подписей и инструментов, которые мы предоставляем"
  },
  "examples": {
    "comment_1": "Создайте объект {{TextSignature}} с путем к документу",
    "comment_2": "Используйте {{BarcodeSignOptions}}, чтобы интегрировать штрих-код в документ",
    "comment_3": "Настройте тип штрих-кода и дополнительные параметры",
    "comment_4": "Сохраните подписанный документ"
  },
  "steps": {
    "title": "Как создать и встроить штрих-коды в файл {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) позволяет генерировать и размещать штрих-коды в различных популярных форматах на страницах {{FileFormatUp}}. С поддержкой более 60 типов штрих-кодов, приложения {{EnvName}} могут быть легко улучшены с помощью функций подписания штрих-кодов, интегрируя нашу библиотеку.",
      "step_1": "Предоставьте файл или поток {{FileFormatUp}} для обработки.",
      "step_2": "Передайте текст штрих-кода в экземпляр {{BarcodeSignOptions}}.",
      "step_3": "Настройте параметры штрих-кода, такие как положение, размер и т. д.",
      "step_4": "Сохраните документ с вновь добавленным штрих-кодом."
    }
  },
  "code_1": {
    "title": "Как применить подпись штрих-кодом",
    "content": "Этот пример иллюстрирует, как встроить настроенный штрих-код на страницы документа {{FileFormatUp}}.",
    "comment_1": "Предоставьте документ для подписания",
    "comment_2": "Создайте параметры подписи с необходимым текстом штрих-кода",
    "comment_3": "Установите относительное положение штрих-кода на странице",
    "comment_4": "Определите отступ штрих-кода от края страницы",
    "comment_5": "Выберите цвет штриха",
    "comment_6": "Укажите стиль шрифта для сообщения",
    "comment_7": "Укажите положение сообщения",
    "comment_8": "Подпишите и сохраните документ"
  }
}