{
  "head": {
    "title": "Generate a barcode for {{FileFormatUp}} with {{ProgLang}}",
    "description": "Easily generate a barcode signature and insert it into a {{FileFormatUp}} document using {{ProgLang}}. Use {{ProdShortName}} to sign a variety of file formats with just a few lines of code."
  },
  "header": {
    "title": "Generate barcodes for {{FileFormatUp}}",
    "description": "With {{ProdFullName}}, you can place barcodes in your business documents wherever needed. Our solution provides flexible options for barcode signature customization.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Free trial"
  },
  "about": {
    "title": "About {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is a powerful document signing tool that supports a wide range of signature types, including text, images, barcodes, digital certificates, and stamps. Compatible with over 60 file formats, such as PDF, MS Office, images, ZIP, and more, it not only allows you to apply signatures but also lets you search, verify, modify, or remove them as needed."
  },
  "more_features": {
    "title": "Enhance your documents with advanced signature features",
    "description": "The {{ProdFullName}} library provides comprehensive solutions for signing and processing documents in commonly used formats. You can easily add, modify, verify, or remove various signature types to fit your needs.",
    "image_description": "Key Features of {{ProdShortName}}",
    "feature_1": {
      "title": "Flexible document signing",
      "content": "Sign any page in supported documents with text, images, barcodes, QR codes, or stamps. Add hidden metadata like EXIF data in images and ensure content protection with digital certificates to prevent unauthorized changes."
    },
    "feature_2": {
      "title": "Search and verify signatures",
      "content": "Our tool ensures the integrity of your documents by enabling signature verification. You can also retrieve a full list of all signatures in a document for easy management."
    },
    "feature_3": {
      "title": "Edit signatures easily",
      "content": "Modify existing signatures effortlessly. Adjust text, reposition elements, or change colors to suit your document's needs."
    },
    "feature_4": {
      "title": "Effortlessly remove signatures",
      "content": "With full CRUD functionality, {{ProdFullName}} makes it easy to remove any unwanted or outdated signatures from your documents."
    }
  },
  "formats": {
    "title": "Sign documents in multiple formats",
    "description": "The {{EnvName}} API supports signing more than 60 file formats, allowing you to add various types of signatures to any page or specific location within your documents."
  },
  "operations": {
    "title": "Explore our key features",
    "description": "We offer a wide array of signature options and operations for your document needs."
  },
  "examples": {
    "comment_1": "Initialize the {{TextSignature}} object with the document path",
    "comment_2": "Use {{BarcodeSignOptions}} to add a barcode to the document",
    "comment_3": "Set the barcode type and configure its properties",
    "comment_4": "Save the signed document"
  },
  "steps": {
    "title": "Steps to generate and insert a barcode in {{FileFormatUp}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) allows you to generate and embed barcodes in {{FileFormatUp}} documents quickly and easily. Supporting more than 60 barcode formats, {{EnvName}} applications can seamlessly add barcode signing functionality by integrating our library.",
      "step_1": "Provide the {{FileFormatUp}} file or stream for processing.",
      "step_2": "Assign the barcode text to the {{BarcodeSignOptions}} object.",
      "step_3": "Adjust barcode options, such as position and size.",
      "step_4": "Save the document with the embedded barcode."
    }
  },
  "code_1": {
    "title": "Customize and add a barcode signature",
    "content": "This example demonstrates how to insert a custom barcode into a {{FileFormatUp}} document.",
    "comment_1": "Provide the document to be signed",
    "comment_2": "Set the barcode text and signature options",
    "comment_3": "Choose the position for the barcode on the page",
    "comment_4": "Set padding between the barcode and page edge",
    "comment_5": "Specify the color of the barcode bars",
    "comment_6": "Choose the font style for the barcode message",
    "comment_7": "Set the position of the message text",
    "comment_8": "Sign and save the document"
  }
}
