{
  "head": {
    "title": "Удаление подписей из {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "Удаление цифровых, штрих-кодовых, текстовых, изображений, метаданных подписей из подписанных документов {{FileFormatUp}} можно выполнить с использованием {{ProdFullName}}."
  },
  "header": {
    "title": "Без усилий удалите подписи в {{FileFormatUp}}",
    "description": "Наша комплексная решение выходит за рамки простого подписания документов и предлагает надежные функции в {{ProdFullName}} для поиска и удаления широкого спектра подписей.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Получите бесплатную загрузку"
  },
  "about": {
    "title": "Откройте для себя {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — это продвинутая библиотека цифровых подписей для предприятий, разработанная для поддержки широкого спектра типов подписей, включая текст, изображения, штрих-коды, цифровые сертификаты и печати. С совместимостью более чем с 60 форматами документов — такими как PDF, файлы MS Office, изображения, ZIP-архивы и другие важные бизнес-форматы — этот инструмент предлагает непревзойденную универсальность в электронных рабочих процессах документов. Платформа не только облегчает встраивание подписи, но и предоставляет надежные функции для поиска, проверки, обновления и удаления подписей, обеспечивая полноценное управление жизненным циклом процессов цифровой подписи в корпоративной среде."
  },
  "more_features": {
    "title": "Усиление безопасности документов с помощью инструментов подписей",
    "description": "{{ProdFullName}} специально разработан для упрощения подписания и управления бизнес-форматами файлов, позволяя вам добавлять, редактировать, проверять или удалять подписи с высокой точностью.",
    "image_description": "Изучите всеобъемлющие возможности {{ProdShortName}}",
    "feature_1": {
      "title": "Подписание документов",
      "content": "Добавляйте текстовые, изображенческие, штрих-кодовые, QR-коды или печатные подписи на любую страницу поддерживаемых документов. Используйте скрытую метаданные, такие как EXIF в изображениях, или обеспечьте целостность документа с помощью цифровых сертификатов, чтобы предотвратить несанкционированные изменения."
    },
    "feature_2": {
      "title": "Поиск и проверка подписей",
      "content": "Наши инструменты позволяют тщательную проверку подписей документов, обеспечивая их подлинность. Выполняйте всесторонние поиски для извлечения всех подписей из ваших документов, улучшая контроль над документами."
    },
    "feature_3": {
      "title": "Редактирование существующих подписей",
      "content": "Модифицируйте ранее добавленные подписи, изменяя текст, перемещая положение или меняя цвета в соответствии с вашими требованиями."
    },
    "feature_4": {
      "title": "Удаление ненужных подписей",
      "content": "С полными возможностями CRUD наше решение позволяет эффективно удалять широкий спектр типов подписей из ваших документов, обеспечивая гибкость и контроль."
    }
  },
  "formats": {
    "title": "Удаление подписей из различных форматов файлов",
    "description": "Наше решение {{ProdFullName}} искусно удаляет подписи из разнообразных форматов файлов, превышающих 60, обеспечивая широкую совместимость и функциональность."
  },
  "operations": {
    "title": "Изучите предлагаемые нами функции",
    "description": "Откройте для себя полный спектр решений и операций с подписями, доступных в нашей системе"
  },
  "examples": {
    "comment_1": "Передайте документ с подписями экземпляру {{TextSignature}}",
    "comment_2": "Извлеките цифровые подписи, присутствующие в документе",
    "comment_3": "Удалите первую обнаруженную цифровую подпись",
    "comment_4": "Обработайте результат удаления"
  },
  "steps": {
    "title": "Руководство по удалению цифровых подписей из {{FileFormatUp}} с использованием {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) позволяет разработчикам {{EnvName}} эффективно удалять электронные подписи из файлов {{FileFormatUp}}, следуя ряду простых шагов.",
      "step_1": "Укажите путь к файлу {{FileFormatUp}} экземпляру класса {{TextSignature}}.",
      "step_2": "Используйте метод Search для выявления всех подписей в документе.",
      "step_3": "Удалите одну или несколько найденных подписей.",
      "step_4": "Просмотрите результаты обработки документа."
    }
  },
  "code_1": {
    "title": "Удалить все штрих-кодовые подписи",
    "content": "Изучите процедуру удаления всех штрих-кодовых подписей, встроенных в документ.",
    "comment_1": "Предоставьте документ, который включает штрих-кодовые подписи",
    "comment_2": "Удалите все штрих-кодовые подписи",
    "comment_3": "Просмотрите результаты удаления"
  }
}