{
  "head": {
    "title": "Hapus tanda tangan dari {{FileFormatUp}} menggunakan {{ProgLang}}",
    "description": "Penghapusan tanda tangan Digital, Barcode, Teks, Gambar, dan Metadata dari dokumen {{FileFormatUp}} yang ditandatangani dapat dilakukan menggunakan {{ProdFullName}}."
  },
  "header": {
    "title": "Hapus tanda tangan dari {{FileFormatUp}}",
    "description": "Solusi kami tidak hanya memungkinkan Anda untuk menandatangani dokumen bisnis tetapi juga memberikan kemampuan untuk menemukan dan menghapus berbagai jenis tanda tangan menggunakan {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Unduh gratis"
  },
  "about": {
    "title": "Tentang {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) menawarkan solusi penandatanganan yang komprehensif, mampu menangani berbagai jenis tanda tangan seperti teks, gambar, barcode, sertifikat digital, dan stempel. Alat ini mendukung lebih dari 60 format file berbeda, termasuk PDF, dokumen MS Office, file gambar, arsip ZIP, dan banyak format umum lainnya. Selain itu, setelah tanda tangan diterapkan, tanda tangan tersebut dapat dicari, diverifikasi, diedit, atau dihapus kapan saja saat diperlukan."
  },
  "more_features": {
    "title": "Tingkatkan proses bisnis dengan manajemen tanda tangan",
    "description": "{{ProdFullName}} dirancang untuk menandatangani dan mengelola format file bisnis, memungkinkan Anda menambahkan, mengubah, memverifikasi, atau menghapus tanda tangan sesuai kebutuhan.",
    "image_description": "Kemampuan {{ProdShortName}}",
    "feature_1": {
      "title": "Tandatangani dokumen",
      "content": "Tambahkan tanda tangan teks, gambar, barcode, QR code, atau stempel ke halaman dokumen yang didukung. Gunakan metadata tersembunyi seperti EXIF dalam gambar atau amankan konten dokumen dari modifikasi yang tidak sah dengan sertifikat digital."
    },
    "feature_2": {
      "title": "Pencarian dan verifikasi",
      "content": "Maksimalkan potensi dokumen yang ditandatangani dengan memverifikasi tanda tangan untuk memastikan validitasnya. Anda juga dapat mengambil daftar lengkap semua tanda tangan dalam dokumen melalui pencarian sederhana."
    },
    "feature_3": {
      "title": "Ubah tanda tangan",
      "content": "Sebagian besar tanda tangan yang ditambahkan sebelumnya dapat disesuaikan. Anda dapat dengan mudah mengubah teks, memindahkan posisi tanda tangan, atau mengubah warnanya."
    },
    "feature_4": {
      "title": "Hapus tanda tangan",
      "content": "Solusi kami mendukung sepenuhnya operasi CRUD untuk tanda tangan, memungkinkan Anda menghapus berbagai jenis tanda tangan dari dokumen sesuai kebutuhan."
    }
  },
  "formats": {
    "title": "Hapus tanda tangan dari berbagai format file",
    "description": "Solusi {{ProdFullName}} kami mendukung penghapusan tanda tangan dari lebih dari 60 format file berbeda."
  },
  "operations": {
    "title": "Pelajari tentang fitur utama kami",
    "description": "Jelajahi berbagai operasi dan metode tanda tangan yang tersedia dengan platform kami"
  },
  "examples": {
    "comment_1": "Serahkan dokumen yang berisi tanda tangan yang akan dihapus ke {{TextSignature}}",
    "comment_2": "Ambil tanda tangan digital yang ada dalam dokumen",
    "comment_3": "Hapus tanda tangan digital yang pertama ditemukan",
    "comment_4": "Proses hasil penghapusan"
  },
  "steps": {
    "title": "Langkah-langkah untuk menghapus tanda tangan elektronik dari {{FileFormatUp}} menggunakan {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) memungkinkan pengembang {{EnvName}} untuk menghapus tanda tangan elektronik dalam file {{FileFormatUp}} menggunakan aplikasi mereka dengan mengikuti beberapa langkah sederhana.",
      "step_1": "Serahkan jalur {{FileFormatUp}} ke sebuah instance dari kelas {{TextSignature}}.",
      "step_2": "Gunakan metode Pencarian untuk mengambil tanda tangan dari dokumen.",
      "step_3": "Hapus satu atau lebih tanda tangan yang ditemukan.",
      "step_4": "Analisis hasil pemrosesan dokumen."
    }
  },
  "code_1": {
    "title": "Hapus semua tanda tangan barcode",
    "content": "Pelajari cara menghapus semua tanda tangan barcode yang tersemat dalam dokumen.",
    "comment_1": "Sediakan dokumen yang mengandung tanda tangan barcode",
    "comment_2": "Hapus semua tanda tangan barcode",
    "comment_3": "Proses hasil penghapusan"
  }
}