{
  "head": {
    "title": "ลบลายเซ็นจาก {{FileFormatUp}} ผ่าน {{ProgLang}}",
    "description": "การลบลายเซ็นดิจิทัล, บาร์โค้ด, ข้อความ, รูปภาพ, ข้อมูลเมตา จากเอกสาร {{FileFormatUp}} ที่เซ็นแล้วสามารถทำได้ด้วย {{ProdFullName}}."
  },
  "header": {
    "title": "ลบลายเซ็นที่วางใน {{FileFormatUp}} ได้อย่างไม่มีข้อติดขัด",
    "description": "โซลูชันของเราไม่เพียงแค่เซ็นเอกสาร แต่ยังเสนอคุณสมบัติที่แข็งแกร่งใน {{ProdFullName}} เพื่อค้นหาและลบลายเซ็นหลากหลายประเภท.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรีของคุณ"
  },
  "about": {
    "title": "ค้นพบ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นห้องสมุดการเซ็นดิจิทัลที่มีระดับองค์กร ถูกออกแบบมาเพื่อรองรับลายเซ็นประเภทต่าง ๆ รวมถึงข้อความ, รูปภาพ, บาร์โค้ด, ใบรับรองดิจิทัล, และตราประทับ ด้วยความเข้ากันได้กับเอกสารมากกว่า 60 รูปแบบ—เช่น PDFs, ไฟล์ MS Office, รูปภาพ, ZIP archives, และรูปแบบธุรกิจสำคัญอื่น ๆ—เครื่องมือนี้จึงเสนอความยืดหยุ่นที่ไม่มีใครเทียบได้ในกระบวนการเอกสารอิเล็กทรอนิกส์ แพลตฟอร์มนี้ไม่เพียงแค่ช่วยในการฝังลายเซ็นอย่างราบรื่น แต่ยังมอบความสามารถในการค้นหา, ตรวจสอบ, อัปเดต, และลบลายเซ็น เพื่อให้แน่ใจว่ามีการจัดการวงจรชีวิตของกระบวนการเซ็นดิจิทัลในสภาพแวดล้อมขององค์กรอย่างสมบูรณ์."
  },
  "more_features": {
    "title": "เพิ่มความปลอดภัยของเอกสารด้วยเครื่องมือเซ็นชื่อ",
    "description": "{{ProdFullName}} ถูกสร้างขึ้นมาเพื่อทำให้การเซ็นและการจัดการรูปแบบไฟล์ธุรกิจเป็นไปอย่างราบรื่น ช่วยให้คุณสามารถเพิ่ม, แก้ไข, ยืนยัน, หรือทำการลบลายเซ็นได้อย่างแม่นยำ.",
    "image_description": "สำรวจความสามารถที่ครอบคลุมของ {{ProdShortName}}",
    "feature_1": {
      "title": "การเซ็นเอกสาร",
      "content": "เพิ่มลายเซ็นประเภทข้อความ, รูปภาพ, บาร์โค้ด, QR code, หรือตราประทับไปยังหน้าใดก็ได้ของเอกสารที่รองรับได้อย่างราบรื่น ใช้ข้อมูลเมตาที่ซ่อนอยู่เช่น EXIF ในรูปภาพ หรือรักษาความถูกต้องของเอกสารด้วยใบรับรองดิจิทัลเพื่อป้องกันการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต."
    },
    "feature_2": {
      "title": "การค้นหาและตรวจสอบลายเซ็น",
      "content": "เครื่องมือของเราเปิดโอกาสให้ตรวจสอบลายเซ็นในเอกสารอย่างละเอียด เพื่อให้แน่ใจในความถูกต้องของลายเซ็น ทำการค้นหาอย่างกว้างขวางเพื่อดึงลายเซ็นทั้งหมดในเอกสารของคุณ ช่วยเพิ่มการควบคุมเอกสาร."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็นที่มีอยู่",
      "content": "ปรับเปลี่ยนลายเซ็นที่เพิ่มเข้ามาก่อนหน้านี้ได้อย่างง่ายดาย โดยการปรับข้อความ, เปลี่ยนตำแหน่ง, หรือเปลี่ยนสีเพื่อตอบสนองความต้องการเฉพาะของคุณ."
    },
    "feature_4": {
      "title": "ลบลายเซ็นที่ไม่ต้องการ",
      "content": "ด้วยความสามารถในการจัดการ CRUD อย่างเต็มรูปแบบ โซลูชันของเราช่วยให้สามารถลบลายเซ็นหลากหลายประเภทจากเอกสารได้อย่างมีประสิทธิภาพ เพื่อให้ความยืดหยุ่นและการควบคุม."
    }
  },
  "formats": {
    "title": "ลบลายเซ็นจากรูปแบบไฟล์ต่าง ๆ",
    "description": "โซลูชัน {{ProdFullName}} ของเราเชี่ยวชาญในการลบลายเซ็นจากไฟล์มากกว่า 60 รูปแบบ ทำให้มีความเข้ากันได้และฟังก์ชันการทำงานอย่างกว้างขวาง."
  },
  "operations": {
    "title": "สำรวจคุณสมบัติที่เรามีให้",
    "description": "ค้นพบขอบเขตของโซลูชันและการดำเนินการลายเซ็นที่มีอยู่ในระบบของเรา"
  },
  "examples": {
    "comment_1": "ส่งเอกสารที่มีลายเซ็นไปยังอินสแตนซ์ของ {{TextSignature}}",
    "comment_2": "ดึงลายเซ็นดิจิทัลที่มีอยู่ในเอกสาร",
    "comment_3": "ลบลายเซ็นดิจิทัลที่ตรวจพบแรก",
    "comment_4": "จัดการผลลัพธ์ของการลบ"
  },
  "steps": {
    "title": "แนวทางการลบลายเซ็นดิจิทัลจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้นักพัฒนา {{EnvName}} สามารถลบลายเซ็นอิเล็กทรอนิกส์ในไฟล์ {{FileFormatUp}} ได้อย่างมีประสิทธิภาพ โดยการปฏิบัติตามขั้นตอนที่เรียบง่าย.",
      "step_1": "ระบุเส้นทางไฟล์ {{FileFormatUp}} ให้กับอินสแตนซ์ของคลาส {{TextSignature}}.",
      "step_2": "ใช้วิธีการค้นหาเพื่อระบุลายเซ็นทั้งหมดในเอกสาร.",
      "step_3": "ลบลายเซ็นที่ระบุหนึ่งหรือมากกว่า.",
      "step_4": "ตรวจสอบผลลัพธ์ของการประมวลผลเอกสาร."
    }
  },
  "code_1": {
    "title": "ลบลายเซ็นบาร์โค้ดทั้งหมด",
    "content": "เรียนรู้ขั้นตอนในการกำจัดลายเซ็นบาร์โค้ดทั้งหมดที่ฝังอยู่ในเอกสาร.",
    "comment_1": "ระบุเอกสารที่มีลายเซ็นบาร์โค้ด",
    "comment_2": "ลบลายเซ็นบาร์โค้ดทั้งหมด",
    "comment_3": "ตรวจสอบผลลัพธ์ของการลบ"
  }
}