{
  "head": {
    "title": "ลบลายเซ็นจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ลบลายเซ็นดิจิทัล, บาร์โค้ด, ข้อความ, รูปภาพ และข้อมูลเมตาจากเอกสาร {{FileFormatUp}} ได้อย่างมีประสิทธิภาพด้วย {{ProdFullName}}."
  },
  "header": {
    "title": "ลบลายเซ็นจาก {{FileFormatUp}}",
    "description": "นอกจากการลงนามในเอกสารแล้ว {{ProdFullName}} ยังมอบเครื่องมือที่ครบครันในการค้นหาและลบลายเซ็นประเภทต่าง ๆ จากไฟล์ของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันที่ทรงพลังในการจัดการลายเซ็นทุกประเภท รวมถึงข้อความ รูปภาพ บาร์โค้ด ใบรับรองดิจิทัล และตราประทับ รองรับรูปแบบมากกว่า 60 รูปแบบ เช่น PDF, เอกสาร MS Office, รูปภาพ และไฟล์ ZIP โดยมอบความยืดหยุ่นสูงสุดในการจัดการเอกสาร คุณสามารถเพิ่ม ยืนยัน ปรับปรุง หรือลบลายเซ็นตามต้องการได้อย่างสะดวก."
  },
  "more_features": {
    "title": "ปรับปรุงการจัดการเอกสารด้วยคุณสมบัติการลงนามขั้นสูง",
    "description": "{{ProdFullName}} ถูกออกแบบมาอย่างเชี่ยวชาญเพื่อปรับปรุงกระบวนการในการเพิ่ม ยืนยัน แก้ไข และลบลายเซ็นในรูปแบบเอกสารธุรกิจที่สำคัญ.",
    "image_description": "คุณสมบัติหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "ลงนามในเอกสารของคุณ",
      "content": "ใช้เวลาสั้น ๆ ในการดำเนินการลายเซ็นข้อความ รูปภาพ บาร์โค้ด รหัส QR หรือสแตมป์ลงในทุกหน้า นอกจากนี้ คุณยังสามารถจัดการข้อมูลเมตาที่ซ่อนอยู่ เช่น EXIF ในรูปภาพ และรับประกันความสมบูรณ์ของเอกสารด้วยใบรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "ค้นหาและยืนยันลายเซ็น",
      "content": "ใช้เครื่องมือที่ทรงพลังของเราค้นหาและยืนยันลายเซ็นในเอกสารของคุณ โดยให้คุณมีรายชื่อของลายเซ็นทั้งหมดเพื่อการจัดการอย่างทั่วถึง."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็น",
      "content": "ปรับแก้ลายเซ็นที่มีอยู่ได้อย่างง่ายดาย โดยเปลี่ยนข้อความ ย้ายตำแหน่งขององค์ประกอบ หรือปรับสีให้ตรงตามความต้องการของคุณ."
    },
    "feature_4": {
      "title": "ลบลายเซ็นที่ไม่ต้องการ",
      "content": "ควบคุมลายเซ็นในเอกสารอย่างเต็มที่ด้วยการดำเนินการสร้าง อ่าน ปรับปรุง และลบ (CRUD) ที่ครบถ้วน ช่วยให้คุณลบลายเซ็นประเภทใดก็ได้เมื่อจำเป็น."
    }
  },
  "formats": {
    "title": "ลบลายเซ็นจากหลายรูปแบบไฟล์",
    "description": "{{ProdFullName}} ถูกสร้างขึ้นเพื่อรองรับการลบลายเซ็นจากไฟล์มากกว่า 60 รูปแบบ ช่วยให้มั่นใจในความเข้ากันได้และการใช้งานที่สะดวก."
  },
  "operations": {
    "title": "ค้นพบคุณสมบัติหลักของเรา",
    "description": "สำรวจประเภทและการดำเนินการลายเซ็นที่มีให้กับโซลูชันของเรา."
  },
  "examples": {
    "comment_1": "ส่งเอกสารที่มีลายเซ็นไปยังอินสแตนซ์ {{TextSignature}}",
    "comment_2": "ดึงข้อมูลลายเซ็นดิจิทัลในเอกสาร",
    "comment_3": "ลบลายเซ็นแรกจากรายการ",
    "comment_4": "ประมวลผลและยืนยันผลการลบ"
  },
  "steps": {
    "title": "ขั้นตอนในการลบลายเซ็นอิเล็กทรอนิกส์จาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้ผู้พัฒนา {{EnvName}} สามารถลบลายเซ็นอิเล็กทรอนิกส์จากไฟล์ {{FileFormatUp}} ได้โดยปฏิบัติตามขั้นตอนง่าย ๆ เหล่านี้:",
      "step_1": "โหลดเอกสาร {{FileFormatUp}} เข้าไปในอินสแตนซ์ของคลาส {{TextSignature}}.",
      "step_2": "ใช้ฟังก์ชันการค้นหาเพื่อตรวจสอบลายเซ็นทั้งหมดในเอกสาร.",
      "step_3": "ลบลายเซ็นที่พบหนึ่งหรือหลายลายเซ็น.",
      "step_4": "ตรวจสอบผลลัพธ์หลังจากประมวลผล."
    }
  },
  "code_1": {
    "title": "ลบลายเซ็นบาร์โค้ดทั้งหมด",
    "content": "เรียนรู้วิธีลบลายเซ็นบาร์โค้ดทั้งหมดจากเอกสาร.",
    "comment_1": "จัดเตรียมเอกสารที่มีลายเซ็นบาร์โค้ด",
    "comment_2": "ลบลายเซ็นบาร์โค้ดทั้งหมด",
    "comment_3": "ตรวจสอบผลลัพธ์ของกระบวนการลบ"
  }
}