{
  "head": {
    "title": "Видалення підписів з {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Видалення цифрових, штрих-коду, текстових, зображень, метаданих підписів з підписаних {{FileFormatUp}} документів можна здійснити за допомогою {{ProdFullName}}."
  },
  "header": {
    "title": "Ефективне видалення підписів з {{FileFormatUp}}",
    "description": "Крім підписання бізнес-документів, наше рішення пропонує повний набір інструментів для пошуку та видалення різних підписів за допомогою {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажити безкоштовно"
  },
  "about": {
    "title": "Огляд {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) є потужним інструментом для підписання, який полегшує додавання різноманітних типів підписів, починаючи від текстових та зображень і закінчуючи штрих-кодами, цифровими сертифікатами та штампами. Підтримуючи понад 60 форматів файлів — зокрема PDF, MS Office, зображення, ZIP та інші широко використовувані бізнес-формати — це рішення забезпечує гнучкість у управлінні документами. Крім того, застосовані підписи можна легко знаходити, перевіряти, змінювати або видаляти за необхідності."
  },
  "more_features": {
    "title": "Оптимізуйте управління документами за допомогою вдосконалених інструментів підпису",
    "description": "{{ProdFullName}} ретельно розроблено для покращення підписання та обробки бізнес-файлів, дозволяючи додавати, змінювати, перевіряти або видаляти підписи ефективно.",
    "image_description": "Вивчайте різноманітні функції {{ProdShortName}}",
    "feature_1": {
      "title": "Підписання документів",
      "content": "Без зусиль вбудовуйте текстові, зображення, підписи штрих-кодів, QR-кодів або штампів на будь-якій сторінці підтримуваних документів. Додатково використовуйте приховані метадані, такі як EXIF в зображеннях, або захищайте цілісність документів за допомогою цифрових сертифікатів, запобігаючи несанкціонованим змінам."
    },
    "feature_2": {
      "title": "Пошук та перевірка підписів",
      "content": "Скористайтеся нашими інструментами, щоб забезпечити достовірність підписів у ваших документах. Проведіть ретельний пошук, щоб отримати повний список усіх підписів, забезпечуючи всебічне управління документами."
    },
    "feature_3": {
      "title": "Зміна підписів",
      "content": "Легко вдосконалюйте раніше додані підписи, змінюючи текст, позицію або колір відповідно до ваших конкретних потреб."
    },
    "feature_4": {
      "title": "Видалення підписів",
      "content": "Наше рішення надає повні можливості CRUD для підписів, що дозволяє вам ефективно видаляти різні типи підписів з ваших документів за необхідності."
    }
  },
  "formats": {
    "title": "Видалення підписів у різних форматах файлів",
    "description": "{{ProdFullName}} розроблено для того, щоб полегшити видалення підписів з широкого спектру понад 60 формати файлів, забезпечуючи широку сумісність та функціональність."
  },
  "operations": {
    "title": "Ознайомтесь з нашими виділеними функціями",
    "description": "Ми раді запропонувати широкий вибір підтримуваних типів підписів та операцій."
  },
  "examples": {
    "comment_1": "Передайте документ, що містить підписи, в екземпляр {{TextSignature}}",
    "comment_2": "Отримайте цифрові підписи, присутні в документі",
    "comment_3": "Видаліть перший виявлений цифровий підпис",
    "comment_4": "Обробіть результати видалення"
  },
  "steps": {
    "title": "Як видалити електронні підписи з {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) спрощує завдання для розробників {{EnvName}} з видалення електронних підписів у {{FileFormatUp}} файлах, реалізуючи кілька зрозумілих кроків.",
      "step_1": "Надайте шлях до файлу {{FileFormatUp}} для екземпляра класу {{TextSignature}}.",
      "step_2": "Використовуйте метод Search, щоб отримати всі підписи в документі.",
      "step_3": "Видаліть один або кілька знайдених підписів.",
      "step_4": "Перевірте результати обробки документа."
    }
  },
  "code_1": {
    "title": "Видалення всіх підписів штрих-коду",
    "content": "Дізнайтеся, як видалити всі підписи штрих-коду, вбудовані в документ.",
    "comment_1": "Надайте документ, що містить підписи штрих-коду",
    "comment_2": "Видаліть всі підписи штрих-коду",
    "comment_3": "Оцініть результати процесу видалення"
  }
}