{
  "head": {
    "title": "Видалення підписів з {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Видалення цифрових, штрихових, текстових, графічних, метаданих підписів з підписаних документів {{FileFormatUp}} може бути виконано за допомогою {{ProdFullName}}."
  },
  "header": {
    "title": "Легко видаляйте підписи, розміщені в {{FileFormatUp}}",
    "description": "Наш комплексний розв'язок виходить за рамки простого підписання документів, надаючи надійні функції в рамках {{ProdFullName}} для пошуку та видалення різноманітних підписів.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Отримайте безкоштовне завантаження"
  },
  "about": {
    "title": "Ознайомтеся з {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — це просунута бібліотека цифрових підписів рівня «підприємства», розроблена для підтримки різних типів підписів, включаючи текст, зображення, штрих-коди, цифрові сертифікати та штампи. Завдяки сумісності з понад 60 форматами документів – такими як PDF, файли MS Office, зображення, ZIP-архіви та інші критично важливі бізнес-формати – цей інструмент забезпечує неперевершену універсальність у цифрових документах. Платформа не лише полегшує вбудовування підписів, але і надає потужний функціонал для пошуку, валідації, оновлення та видалення підписів, що забезпечує повне управління циклом цифрових підписів у корпоративному середовищі."
  },
  "more_features": {
    "title": "Покращте безпеку документів за допомогою інструментів підпису",
    "description": "{{ProdFullName}} спеціально розроблений для оптимізації підписання та управління бізнес-форматами файлів, що дозволяє вам з точністю додавати, редагувати, перевіряти або видаляти підписи.",
    "image_description": "Досліджуйте широкі можливості {{ProdShortName}}",
    "feature_1": {
      "title": "Підписання документів",
      "content": "Додавайте текстові, графічні, штрихові, QR-коди або штампи на будь-яку сторінку підтримуваних документів. Використовуйте приховані метадані, такі як EXIF в зображеннях, або захищайте цілісність документу за допомогою цифрових сертифікатів, щоб запобігти несанкціонованим змінам."
    },
    "feature_2": {
      "title": "Пошук і валідація підписів",
      "content": "Наші інструменти забезпечують всебічну перевірку підписів документів, гарантуючи їхню автентичність. Проведіть комплексний пошук, щоб отримати всі підписи у ваших документах, покращуючи контроль документів."
    },
    "feature_3": {
      "title": "Редагування існуючих підписів",
      "content": "Модифікуйте раніше додані підписи, змінюючи текст, позицію або кольори відповідно до ваших конкретних вимог."
    },
    "feature_4": {
      "title": "Видалення непотрібних підписів",
      "content": "Завдяки повним можливостям CRUD, наше рішення забезпечує ефективне видалення різних типів підписів з ваших документів, гарантуючи гнучкість та контроль."
    }
  },
  "formats": {
    "title": "Видалення підписів з різних форматів файлів",
    "description": "Наше рішення {{ProdFullName}} є досконалим у видаленні підписів з широкого спектру понад 60 форматів файлів, що гарантує широку сумісність та функціональність."
  },
  "operations": {
    "title": "Ознайомтеся з функціями, які ми надаємо",
    "description": "Досліджуйте повний спектр рішень для підписів та операцій, доступних у нашій системі"
  },
  "examples": {
    "comment_1": "Передайте документ з підписами до екземпляра {{TextSignature}}",
    "comment_2": "Витягніть цифрові підписи, присутні в документі",
    "comment_3": "Видаліть перший виявлений цифровий підпис",
    "comment_4": "Обробіть результат видалення"
  },
  "steps": {
    "title": "Інструкції щодо видалення цифрових підписів з {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) дозволяє розробникам {{EnvName}} ефективно видаляти електронні підписи у файлах {{FileFormatUp}} слідуючи серії простих кроків.",
      "step_1": "Надайте шлях до файлу {{FileFormatUp}} екземпляру класу {{TextSignature}}.",
      "step_2": "Використовуйте метод Search для ідентифікації всіх підписів у документі.",
      "step_3": "Видаліть один або кілька з виявлених підписів.",
      "step_4": "Перегляньте результати обробки документа."
    }
  },
  "code_1": {
    "title": "Видалення всіх штрихових підписів",
    "content": "Досліджуйте процедуру видалення всіх вбудованих у документ штрихових підписів.",
    "comment_1": "Надайте документ, що містить штрихові підписи",
    "comment_2": "Стирайте всі штрихові підписи",
    "comment_3": "Оцініть результати видалення"
  }
}