{
  "head": {
    "title": "ลบลายเซ็นจาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "การลบลายเซ็นดิจิตอล, บาร์โค้ด, ข้อความ, รูปภาพ, และเมตาดาต้าจากเอกสาร {{FileFormatUp}} ที่เซ็นต์แล้วสามารถทำได้โดยใช้ {{ProdFullName}}."
  },
  "header": {
    "title": "ลบลายเซ็นจาก {{FileFormatUp}}",
    "description": "โซลูชันของเราไม่ได้ให้เพียงแค่การเซ็นเอกสารทางธุรกิจ แต่ยังมีความสามารถในการค้นหาและลบประเภทของลายเซ็นต่างๆ โดยใช้ {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มอบโซลูชันการเซ็นที่ครบครัน สามารถจัดการประเภทของลายเซ็นได้หลากหลาย เช่น ข้อความ, รูปภาพ, บาร์โค้ด, ใบรับรองดิจิตอล, และตราประทับ เครื่องมือนี้รองรับรูปแบบไฟล์กว่า 60 รูปแบบ รวมถึง PDF, เอกสาร MS Office, ไฟล์รูปภาพ, ZIP และรูปแบบที่ใช้กันทั่วไปอื่นๆ นอกจากนี้ เมื่อมีการนำลายเซ็นไปใช้แล้ว สามารถค้นหา, ตรวจสอบ, แก้ไข หรือ ลบเมื่อจำเป็นได้ตลอดเวลา."
  },
  "more_features": {
    "title": "ปรับปรุงกระบวนการทางธุรกิจด้วยการจัดการลายเซ็น",
    "description": "{{ProdFullName}} ได้รับการออกแบบมาเพื่อการเซ็นและการจัดการรูปแบบไฟล์ธุรกิจ ทำให้คุณสามารถเพิ่ม, แก้ไข, ตรวจสอบ หรือ ลบลายเซ็นตามต้องการ.",
    "image_description": "ความสามารถของ {{ProdShortName}}",
    "feature_1": {
      "title": "เซ็นเอกสาร",
      "content": "เพิ่มลายเซ็นประเภทข้อความ, รูปภาพ, บาร์โค้ด, QR โค้ด หรือ ตราประทับลงในเอกสารที่รองรับได้ในทุกหน้า ใช้เมตาดาต้าที่ซ่อนอยู่เช่น EXIF ในรูปภาพหรือปกป้องเนื้อหาเอกสารจากการดัดแปลงที่ไม่ได้รับอนุญาตด้วยใบรับรองดิจิตอล."
    },
    "feature_2": {
      "title": "ค้นหาและการตรวจสอบ",
      "content": "เพิ่มศักยภาพให้เอกสารที่เซ็นแล้วโดยการตรวจสอบลายเซ็นเพื่อให้แน่ใจว่าลายเซ็นนั้นถูกต้อง นอกจากนี้ยังสามารถดึงข้อมูลรายการลายเซ็นทั้งหมดจากเอกสารได้ผ่านการค้นหาที่ง่าย."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็น",
      "content": "ลายเซ็นที่ถูกเพิ่มไว้ก่อนหน้านี้ส่วนใหญ่สามารถปรับเปลี่ยนได้ คุณสามารถแก้ไขข้อความ, ย้ายตำแหน่งของลายเซ็น, หรือเปลี่ยนสีได้อย่างง่ายดาย."
    },
    "feature_4": {
      "title": "ลบลายเซ็น",
      "content": "โซลูชันของเรารองรับการทำงานแบบ CRUD สำหรับลายเซ็น ทำให้คุณสามารถลบลายเซ็นประเภทต่างๆ ออกจากเอกสารได้ตามต้องการ."
    }
  },
  "formats": {
    "title": "ลบลายเซ็นจากรูปแบบไฟล์ที่หลากหลาย",
    "description": "โซลูชัน {{ProdFullName}} ของเรารองรับการลบลายเซ็นจากรูปแบบไฟล์มากกว่า 60 รูปแบบ."
  },
  "operations": {
    "title": "เรียนรู้เกี่ยวกับคุณสมบัติหลักของเรา",
    "description": "สำรวจการดำเนินงานที่หลากหลายและวิธีการลายเซ็นที่มีอยู่ในแพลตฟอร์มของเรา."
  },
  "examples": {
    "comment_1": "ส่งเอกสารที่มีลายเซ็นที่จะลบไปยัง {{TextSignature}}",
    "comment_2": "ดึงลายเซ็นดิจิตอลที่มีอยู่ในเอกสาร",
    "comment_3": "ลบลายเซ็นดิจิตอลแรกที่ถูกพบ",
    "comment_4": "ประมวลผลผลลัพธ์ของการลบ"
  },
  "steps": {
    "title": "ขั้นตอนในการลบลายเซ็นอิเล็กทรอนิกส์จาก {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ทำให้การลบลายเซ็นอิเล็กทรอนิกส์ในไฟล์ {{FileFormatUp}} ง่ายสำหรับนักพัฒนา {{EnvName}} โดยการปฏิบัติตามขั้นตอนที่เรียบง่าย.",
      "step_1": "ส่งพาธของ {{FileFormatUp}} ไปยังอ็อบเจ็กต์ของคลาส {{TextSignature}}.",
      "step_2": "ใช้วิธีค้นหาเพื่อดึงลายเซ็นจากเอกสาร.",
      "step_3": "ลบลายเซ็นที่ค้นพบหนึ่งหรือมากกว่า.",
      "step_4": "วิเคราะห์ผลลัพธ์จากการประมวลผลเอกสาร."
    }
  },
  "code_1": {
    "title": "ลบลายเซ็นบาร์โค้ดทั้งหมด",
    "content": "เรียนรู้วิธีการลบลายเซ็นบาร์โค้ดทั้งหมดที่ฝังอยู่ในเอกสาร.",
    "comment_1": "จัดเตรียมเอกสารที่มีลายเซ็นบาร์โค้ด",
    "comment_2": "ลบลายเซ็นบาร์โค้ดทั้งหมด",
    "comment_3": "ประมวลผลผลลัพธ์ของการลบ"
  }
}