{
  "head": {
    "title": "เพิ่มลายเซ็นดิจิทัลในไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "เพิ่มลายเซ็นดิจิทัลในไฟล์ {{FileFormatUp}} โดยใช้ {{ProgLang}} ด้วยโค้ดเพียงไม่กี่บรรทัด ใช้ {{ProdFullName}} สำหรับเซ็นชื่อในรูปแบบไฟล์ที่หลากหลาย"
  },
  "header": {
    "title": "ปกป้อง {{FileFormatUp}} ด้วยใบรับรองดิจิทัล",
    "description": "มั่นใจในความปลอดภัยของเอกสารธุรกิจของคุณโดยการฝังใบรับรองดิจิทัลด้วยความสามารถที่ก้าวหน้าของ {{ProdFullName}} เรามีตัวเลือกที่ยืดหยุ่นในการปกป้องและยืนยันเอกสารของคุณ",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันการเซ็นชื่อที่ครบวงจรที่ออกแบบมาเพื่อตอบสนองความต้องการในการประมวลผลเอกสารที่หลากหลาย ช่วยให้คุณสามารถรวมข้อความ รูปภาพ ใบรับรองดิจิทัล และแสตมป์ลงในรูปแบบไฟล์กว่า 60 รูปแบบ รวมถึง PDF, MS Office, รูปภาพ และไฟล์ ZIP นอกจากนี้ เอกสารที่ถูกเซ็นสามารถค้นหา ยืนยัน แก้ไข หรือถูกลบได้อย่างง่ายดายเมื่อจำเป็น"
  },
  "more_features": {
    "title": "ปรับปรุงหรือปกป้องเนื้อหาเอกสารด้วยลายเซ็น",
    "description": "{{ProdFullName}} สร้างขึ้นเพื่อเซ็นชื่อในรูปแบบไฟล์หลักทั้งหมด ช่วยให้คุณมีความสามารถในการเพิ่ม ปรับแต่ง ยืนยัน หรือถอนลายเซ็นประเภทต่างๆ ได้อย่างมีประสิทธิภาพ",
    "image_description": "คุณสมบัติสำคัญของ {{ProdShortName}}",
    "feature_1": {
      "title": "เพิ่มลายเซ็นในเอกสารของคุณ",
      "content": "วางลายเซ็นข้อความ รูปภาพ บาร์โค้ด QR-Code หรือแสตมป์ในหน้าทุกหน้าของเอกสารที่รองรับ คุณยังสามารถแทรกหรือแก้ไขเมตาดาต้าที่ซ่อนอยู่ เช่น EXIF ในรูปภาพ ปกป้องเนื้อหาเอกสารของคุณจากการเปลี่ยนแปลงที่ไม่ได้รับอนุญาตด้วยใบรับรองดิจิทัล"
    },
    "feature_2": {
      "title": "ค้นหาและยืนยันลายเซ็น",
      "content": "หลังจากการเซ็น เอกสารของคุณสามารถผ่านการตรวจสอบหลายครั้ง ยืนยันความสมบูรณ์ของเนื้อหาที่เซ็นชื่อ หรือดำเนินการค้นหารายละเอียดเพื่อลิสต์ลายเซ็นที่มีอยู่ทั้งหมด"
    },
    "feature_3": {
      "title": "ปรับปรุงลายเซ็นที่มีอยู่",
      "content": "ลายเซ็นส่วนใหญ่สามารถแก้ไขหลังการสร้างได้ คุณสามารถปรับเปลี่ยนข้อความ เปลี่ยนตำแหน่งองค์ประกอบ ปรับสี เปลี่ยนขนาด และทำการเปลี่ยนแปลงอื่นๆ ที่จำเป็นได้อย่างง่ายดาย"
    },
    "feature_4": {
      "title": "ลบลายเซ็นที่ไม่จำเป็น",
      "content": "โซลูชันของเราสามารถดำเนินการ CRUD เต็มรูปแบบสำหรับลายเซ็น หากจำเป็น คุณสามารถลบลายเซ็นประเภทต่างๆ รวมถึงใบรับรองดิจิทัลจากเอกสารของคุณ"
    }
  },
  "formats": {
    "title": "เซ็นเอกสารหลายรูปแบบ",
    "description": "API {{EnvName}} รองรับรูปแบบกว่า 60 รูปแบบ ทำให้คุณสามารถใช้ลายเซ็นหลายประเภทในหน้าต่างๆ กำหนดมาตรการความปลอดภัยเนื้อหาด้วยใบรับรองดิจิทัล และจัดการลายเซ็นภายในเอกสารได้อย่างมีประสิทธิภาพ"
  },
  "operations": {
    "title": "มาทำความรู้จักกับฟังก์ชันหลักของเรา",
    "description": "เราภูมิใจที่จะสนับสนุนชุดทางเลือกและฟังก์ชันของลายเซ็นที่ครบถ้วน"
  },
  "examples": {
    "comment_1": "ใช้ {{TextSignature}} เพื่อนำลายเซ็นดิจิทัลไปใช้ในเอกสาร",
    "comment_2": "จัดเตรียมใบรับรองดิจิทัลและรหัสผ่านที่จำเป็น",
    "comment_3": "กำหนดค่าการตั้งค่าลายเซ็นที่ปรากฏหากจำเป็น",
    "comment_4": "เข้ารหัสเอกสารโดยใช้ใบรับรองดิจิทัล"
  },
  "steps": {
    "title": "แนวทางการป้องกัน {{FileFormatUp}} ด้วยใบรับรองดิจิทัลใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้นักพัฒนา {{EnvName}} สามารถปกป้องเอกสาร {{FileFormatUp}} จากการดัดแปลงโดยใช้ลายเซ็นดิจิทัล ปรับปรุงแอปพลิเคชันธุรกิจของคุณด้วยฟีเจอร์ด้านความปลอดภัยข้อมูลที่ครบถ้วน",
      "step_1": "ส่งเอกสาร {{FileFormatUp}} ไปยังตัวสร้างคลาส {{TextSignature}}",
      "step_2": "ใช้ใบรับรองดิจิทัลและรหัสผ่านที่สอดคล้องกันเพื่อทำให้เอกสารปลอดภัย",
      "step_3": "เลือกเพิ่มการแสดงภาพของลายเซ็นดิจิทัลในหน้าของเอกสาร",
      "step_4": "เซ็นเอกสารเพื่อต้านการเปลี่ยนแปลงในอนาคต"
    }
  },
  "code_1": {
    "title": "ปกป้องเอกสารด้วยลายเซ็นดิจิทัล",
    "content": "เรียนรู้วิธีล็อกเอกสารเพื่อป้องกันการเปลี่ยนแปลงโดยใช้ลายเซ็นดิจิทัล",
    "comment_1": "จัดเตรียมเอกสารที่ต้องการเซ็น",
    "comment_2": "ใช้ใบรับรองดิจิทัลและรหัสผ่านที่เหมาะสม",
    "comment_3": "รวมข้อมูลข้อความเพิ่มเติมเมื่อจำเป็น",
    "comment_4": "เพิ่มองค์ประกอบภาพ เช่น รูปภาพ สำหรับการแสดงผลลายเซ็น",
    "comment_5": "บันทึกเอกสารที่รักษาความปลอดภัยด้วยดิจิทัลไปยังตำแหน่งที่กำหนด"
  }
}