{
  "head": {
    "title": "Створіть електронні підписи для {{FileFormatUp}} з використанням {{ProgLang}}",
    "description": "Електронно підписуйте документи {{FileFormatUp}} за допомогою {{ProgLang}} всього за кілька рядків коду. Використовуйте {{ProdFullName}} для підписання широкого спектра форматов файлів."
  },
  "header": {
    "title": "Електронне підписання {{FileFormatUp}}",
    "description": "Забезпечте безпеку і автентичність своїх документів, застосовуючи цифрові сертифікати через {{ProdFullName}}. Наше рішення дозволяє підписувати та захищати ваші документи потужними інструментами.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Отримайте безкоштовно"
  },
  "about": {
    "title": "Що таке {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) - це комплексний інструмент підписання, який підтримує широкий спектр завдань обробки документів. Він дозволяє додавати текст, зображення, цифрові сертифікати і штампи до більше ніж 60 форматов файлів — включаючи PDF, MS Office, зображення та ZIP. З {{ProdFullName}} ви також можете шукати, перевіряти, оновлювати або видаляти підписи, коли це необхідно."
  },
  "more_features": {
    "title": "Покращте та захистіть документи за допомогою електронних підписів",
    "description": "Бібліотека {{ProdFullName}} розроблена для підписання всіх основних форматів файлів. Спростіть своє робоче середовище, легко додаючи, перевіряючи, оновлюючи або видаляючи різні типи підписів.",
    "image_description": "Ключові особливості {{ProdShortName}}",
    "feature_1": {
      "title": "Додавайте підписи до ваших документів",
      "content": "Вставляйте текстові, зображення, штрих-коди, QR-коди або штамповані підписи точно в будь-якому місці в підтримуваних документах. Ви також можете керувати прихованими метаданими, наприклад EXIF в зображеннях, для забезпечення цілісності документів з електронними підписами."
    },
    "feature_2": {
      "title": "Перевіряйте та шукайте підписи",
      "content": "Після підписання ви можете легко перевірити документи, щоб упевнитися в правильному обробленні. Отримуйте та керуйте всіма підписами у ваших файлах з потужними можливостями пошуку."
    },
    "feature_3": {
      "title": "Редагуйте існуючі підписи",
      "content": "Більшість підписів можна повністю налаштувати. Ви можете редагувати текст, переміщати елементи, змінювати кольори, регулювати розміри та інше, щоб відповідати вашим потребам."
    },
    "feature_4": {
      "title": "Видаляйте непотрібні підписи",
      "content": "Наше рішення підтримує комплексне управління підписами, що дозволяє вам видаляти підписи, включаючи цифрові сертифікати, з будь-якого документа, коли це потрібно."
    }
  },
  "formats": {
    "title": "Підписуйте документи в різних форматах",
    "description": "За допомогою API {{EnvName}} ви можете обробити понад 60 різних форматів, додаючи підписи, застосовуючи цифрові сертифікати для безпеки та керуючи підписами на різних сторінках."
  },
  "operations": {
    "title": "Досліджуйте наші ключові функції",
    "description": "Ми пропонуємо широкий спектр варіантів підпису та потужних операцій з документами."
  },
  "examples": {
    "comment_1": "Використовуйте {{TextSignature}} для електронного підписання документа",
    "comment_2": "Введіть цифровий сертифікат та його пароль",
    "comment_3": "За бажанням налаштуйте вигляд підпису",
    "comment_4": "Заверште документ цифровим сертифікатом"
  },
  "steps": {
    "title": "Як захистити {{FileFormatUp}} цифровими сертифікатами в {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) допомагає розробникам {{EnvName}} забезпечити файли {{FileFormatUp}} шляхом додавання електронних підписів. Покращте свої бізнес-додатки за допомогою потужних функцій захисту документів.",
      "step_1": "Завантажте файл {{FileFormatUp}} в клас {{TextSignature}}.",
      "step_2": "Застосуйте цифровий сертифікат та його пароль для захисту файлу.",
      "step_3": "За бажанням додайте візуальне відображення електронного підпису на сторінках документа.",
      "step_4": "Підпишіть документ, щоб запобігти несанкціонованим змінам."
    }
  },
  "code_1": {
    "title": "Захистіть документи з електронними підписами",
    "content": "Дізнайтеся, як захистити свої документи за допомогою електронних підписів, щоб запобігти несанкціонованим змінам.",
    "comment_1": "Завантажте документ для підписання",
    "comment_2": "Використовуйте дійсний цифровий сертифікат з відповідним паролем",
    "comment_3": "Додайте будь-яку додаткову текстову інформацію за необхідності",
    "comment_4": "Включте зображення або інші варіанти для візуального подання підпису",
    "comment_5": "Збережіть підписаний документ у безпечному місці"
  }
}