{
  "head": {
    "title": "Создайте цифровые подписи для {{FileFormatUp}} с использованием {{ProgLang}}",
    "description": "Цифровая подпись документов {{FileFormatUp}} с использованием {{ProgLang}} всего за несколько строк кода. Используйте {{ProdFullName}} для подписи широкого спектра форматов файлов."
  },
  "header": {
    "title": "Цифровая подпись {{FileFormatUp}}",
    "description": "Обеспечьте безопасность и подлинность ваших документов, применяя цифровые сертификаты через {{ProdFullName}}. Наше решение позволяет подписывать и защищать ваши документы с помощью мощных инструментов.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Получите бесплатно"
  },
  "about": {
    "title": "Что такое {{ProdFullName}}?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — это комплексный инструмент для подписания, который поддерживает широкий спектр задач обработки документов. Он позволяет добавлять текст, изображения, цифровые сертификаты и штампы в более чем 60 форматов файлов, включая PDF, файлы MS Office, изображения и ZIP. С помощью {{ProdFullName}} вы также можете искать, проверять, обновлять или удалять подписи по мере необходимости."
  },
  "more_features": {
    "title": "Усовершенствуйте и защитите документы с помощью цифровых подписей",
    "description": "Библиотека {{ProdFullName}} предназначена для подписи всех основных форматов файлов. Упрощайте рабочий процесс, легко добавляя, проверяя, обновляя или удаляя различные типы подписей.",
    "image_description": "Основные функции {{ProdShortName}}",
    "feature_1": {
      "title": "Добавьте подписи к вашим документам",
      "content": "Вставляйте текстовые, графические, штрих-кодовые, QR-кодов или штамповые подписи точно в любом месте поддерживаемых документов. Также вы можете управлять скрытыми метаданными, такими как EXIF в изображениях, чтобы гарантировать целостность документа с цифровыми подписями."
    },
    "feature_2": {
      "title": "Проверка и поиск подписей",
      "content": "После подписания вы можете легко проверять документы, чтобы обеспечить правильную обработку. Извлекайте и управляйте всеми подписями в ваших файлах с помощью мощных функций поиска."
    },
    "feature_3": {
      "title": "Редактирование существующих подписей",
      "content": "Большинство подписей можно полностью настроить. Вы можете редактировать текст, перемещать элементы, изменять цвета, настраивать размеры и многое другое в соответствии с вашими требованиями."
    },
    "feature_4": {
      "title": "Удаление ненужных подписей",
      "content": "Наше решение поддерживает полное управление подписями, позволяя вам удалять подписи, включая цифровые сертификаты, из любого документа при необходимости."
    }
  },
  "formats": {
    "title": "Подписывайте документы в различных форматах",
    "description": "С помощью API {{EnvName}} вы можете обрабатывать более 60 различных форматов, добавляя подписи, применяя цифровые сертификаты для обеспечения безопасности и управляя подписями на различных страницах."
  },
  "operations": {
    "title": "Изучите наши ключевые функции",
    "description": "Мы предлагаем широкий спектр опций подписей и мощных операций с документами."
  },
  "examples": {
    "comment_1": "Используйте {{TextSignature}} для цифровой подписи документа",
    "comment_2": "Введите цифровой сертификат и его пароль",
    "comment_3": "При необходимости настройте внешний вид подписи",
    "comment_4": "Завершите документ с цифровым сертификатом"
  },
  "steps": {
    "title": "Как защитить {{FileFormatUp}} с цифровыми сертификатами в {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) помогает разработчикам {{EnvName}} защищать файлы {{FileFormatUp}}, добавляя цифровые подписи. Укрепите свои бизнес-приложения с помощью надежных функций защиты документов.",
      "step_1": "Загрузите файл {{FileFormatUp}} в класс {{TextSignature}}.",
      "step_2": "Примените цифровой сертификат и его пароль для защиты файла.",
      "step_3": "Опционально добавьте визуальное отображение цифровой подписи на страницах документа.",
      "step_4": "Подпишите документ, чтобы предотвратить несанкционированные изменения."
    }
  },
  "code_1": {
    "title": "Защита документов с помощью цифровых подписей",
    "content": "Узнайте, как защитить ваши документы, применяя цифровые подписи для предотвращения несанкционированных изменений.",
    "comment_1": "Загрузите документ, который нужно подписать",
    "comment_2": "Используйте действительный цифровой сертификат с соответствующим паролем",
    "comment_3": "При необходимости добавьте дополнительную текстовую информацию",
    "comment_4": "Включите изображение или другие варианты визуального представления подписи",
    "comment_5": "Сохраните подписанный документ в надежном месте"
  }
}