{
  "head": {
    "title": "Добавление цифровых электронных подписей к файлам {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "Разместите цифровую подпись на файле {{FileFormatUp}} с помощью {{ProgLang}} всего за несколько строк кода. Используйте {{ProdFullName}} для подписания множества форматов файлов."
  },
  "header": {
    "title": "Электронная подпись {{FileFormatUp}} с цифровыми подписями",
    "description": "Защитите целостность ваших бизнес-документов, запечатав их цифровыми сертификатами с помощью мощных возможностей {{ProdFullName}}. Мы предлагаем универсальные решения для маркировки и защиты ваших документов.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать бесплатно"
  },
  "about": {
    "title": "О {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — это сложное решение для подписания, которое облегчает широкий спектр задач по обработке документов. Оно позволяет встраивать текст, изображения, цифровые сертификаты и печати в файлы более чем 60 форматов, включая PDF, MS Office, изображения, ZIP файлы и другие важные бизнес-форматы. Более того, подписанные документы могут быть легко найдены, проверены, изменены или удалены по мере необходимости."
  },
  "more_features": {
    "title": "Улучшите или защищайте содержание документов с помощью подписей",
    "description": "Библиотека {{ProdFullName}} разработана для подписания всех распространенных форматов файлов. Оптимизируйте свои бизнес-процессы, добавляя, изменяя, проверяя или удаляя различные подписи.",
    "image_description": "Ключевые функции {{ProdShortName}}",
    "feature_1": {
      "title": "Встраивание подписей в документы",
      "content": "Точно встраивайте текстовые, изображенческие, штриховые, QR-код и печать подписи на странице любого поддерживаемого документа. Вы также можете добавлять или редактировать скрытые метаданные, такие как EXIF, в изображениях и большинстве типов файлов. Обеспечьте целостность содержимого вашего документа с помощью цифровых подписей."
    },
    "feature_2": {
      "title": "Поиск и проверка подписей",
      "content": "Обработка после подписания предлагает множество возможностей. Проверьте, что ваши подписанные документы были правильно обработаны. Для большего контроля получите полный список всех подписей через функцию поиска."
    },
    "feature_3": {
      "title": "Изменение подписей",
      "content": "Большинство типов подписей полностью редактируемы. У вас есть гибкость в настройке текста, перемещении элементов, изменении цветов, изменении размера и многом другом."
    },
    "feature_4": {
      "title": "Удаление дублирующихся подписей",
      "content": "Наше решение предоставляет полные операции CRUD для подписей. При необходимости вы можете удалить различные типы подписей, включая цифровые сертификаты, из вашего документа."
    }
  },
  "formats": {
    "title": "Подписывайте документы в различных форматах",
    "description": "API {{EnvName}} позволяет вам обрабатывать более 60 различных форматов. Вы можете без проблем создавать и встраивать различные подписи на любой странице, применять цифровые сертификаты для обеспечения безопасности содержимого и эффективно управлять существующими подписями внутри документа."
  },
  "operations": {
    "title": "Изучите наши выдающиеся особенности",
    "description": "Мы предоставляем широкое множество форматов подписей и мощных операций."
  },
  "examples": {
    "comment_1": "Используйте {{TextSignature}} для цифровой подписи документа",
    "comment_2": "Предоставьте цифровой сертификат и связанный с ним пароль",
    "comment_3": "При необходимости настройте визуальное представление",
    "comment_4": "Защитите документ с помощью цифрового сертификата"
  },
  "steps": {
    "title": "Как защитить {{FileFormatUp}} с помощью цифровых сертификатов в {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) позволяет разработчикам {{EnvName}} защищать документы {{FileFormatUp}} от изменений с помощью цифровых подписей. Усовершенствуйте свои бизнес-приложения с надежными возможностями защиты данных.",
      "step_1": "Передайте документ {{FileFormatUp}} в конструктор класса {{TextSignature}}.",
      "step_2": "Используйте цифровой сертификат и его пароль для защиты документа.",
      "step_3": "При желании добавьте визуальное представление цифровой подписи на страницы документа.",
      "step_4": "Подпишите документ, чтобы обеспечить его неизменность."
    }
  },
  "code_1": {
    "title": "Защита документов с помощью цифровых подписей",
    "content": "Узнайте, как предотвратить изменения в документе с помощью цифровых подписей.",
    "comment_1": "Предоставьте документ, который нужно подписать",
    "comment_2": "Используйте действительный цифровой сертификат с соответствующим паролем",
    "comment_3": "Укажите любую дополнительную текстовую информацию",
    "comment_4": "Включите изображение и другие опции для визуального представления",
    "comment_5": "Сохраните защищенный документ в назначенном месте"
  }
}