{
  "head": {
    "title": "สร้างลายเซ็นดิจิทัลสำหรับ {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "description": "ลงนามเอกสาร {{FileFormatUp}} อย่างเป็นทางการด้วย {{ProgLang}} ในไม่กี่บรรทัดของโค้ด ใช้ {{ProdFullName}} ในการลงนามไฟล์รูปแบบต่างๆ ได้อย่างกว้างขวาง"
  },
  "header": {
    "title": "ลงนามเอกสาร {{FileFormatUp}} อย่างเป็นทางการ",
    "description": "รับประกันความปลอดภัยและความถูกต้องของเอกสารของคุณโดยการใช้ใบรับรองดิจิทัลผ่าน {{ProdFullName}} โซลูชันของเราช่วยให้คุณสามารถลงนามและปกป้องเอกสารของคุณด้วยเครื่องมือที่ทรงพลังได้อย่างสะดวก",
    "subtitle": "{{ProdFullName}}",
    "action_title": "รับฟรี"
  },
  "about": {
    "title": "{{ProdFullName}} คืออะไร?",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นเครื่องมือการลงนามที่ครอบคลุมซึ่งรองรับการประมวลผลเอกสารที่หลากหลาย ช่วยให้คุณสามารถเพิ่มข้อความ ภาพ ใบรับรองดิจิทัล และตราประทับไปยังไฟล์มากกว่า 60 รูปแบบ รวมถึง PDFs, ไฟล์ MS Office, รูปภาพ และ ZIPs ด้วย {{ProdFullName}} คุณยังสามารถค้นหา ตรวจสอบ อัปเดต หรือ ลบลายเซ็นเมื่อจำเป็น"
  },
  "more_features": {
    "title": "เสริมและปกป้องเอกสารด้วยลายเซ็นดิจิทัล",
    "description": "ไลบรารี {{ProdFullName}} ถูกออกแบบมาเพื่อลงนามไฟล์รูปแบบหลักทั้งหมด ปรับปรุงกระบวนการทำงานของคุณด้วยการเพิ่ม การตรวจสอบ อัปเดต หรือ ลบลายเซ็นประเภทต่างๆ ได้อย่างง่ายดาย",
    "image_description": "ฟีเจอร์หลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "เพิ่มลายเซ็นลงในเอกสารของคุณ",
      "content": "แทรกลายเซ็นข้อความ รูปภาพ บาร์โค้ด รหัส QR หรือ ตราประทับในตำแหน่งที่แน่นอนในเอกสารที่รองรับ คุณยังสามารถจัดการข้อมูลเมตาที่ซ่อนอยู่ เช่น EXIF ในรูปภาพ เพื่อรับประกันความสมบูรณ์ของเอกสารด้วยลายเซ็นดิจิทัล"
    },
    "feature_2": {
      "title": "ตรวจสอบและค้นหาลายเซ็น",
      "content": "หลังจากการลงนาม คุณสามารถตรวจสอบเอกสารได้อย่างง่ายดายเพื่อรับประกันกระบวนการที่ถูกต้อง ดึงข้อมูลและจัดการลายเซ็นทั้งหมดภายในไฟล์ของคุณด้วยความสามารถในการค้นหาที่ทรงพลัง"
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็นที่มีอยู่",
      "content": "ลายเซ็นส่วนใหญ่นั้นสามารถปรับแต่งได้อย่างเต็มที่ คุณสามารถแก้ไขข้อความ ย้ายองค์ประกอบ เปลี่ยนสี ปรับขนาด และอื่นๆ ตามที่คุณต้องการ"
    },
    "feature_4": {
      "title": "ลบลายเซ็นที่ไม่จำเป็น",
      "content": "โซลูชันของเรารองรับการจัดการลายเซ็นอย่างครบถ้วน ช่วยให้คุณสามารถลบลายเซ็นรวมถึงใบรับรองดิจิทัลออกจากเอกสารใดๆ เมื่อจำเป็น"
    }
  },
  "formats": {
    "title": "ลงนามเอกสารในหลายรูปแบบ",
    "description": "ด้วย API {{EnvName}} คุณสามารถประมวลผลไฟล์ได้มากกว่า 60 รูปแบบที่แตกต่างกัน โดยการเพิ่มลายเซ็นการใช้ใบรับรองดิจิทัลเพื่อความปลอดภัย และการจัดการลายเซ็นในหน้าต่างๆ"
  },
  "operations": {
    "title": "สำรวจฟีเจอร์หลักของเรา",
    "description": "เรามีตัวเลือกในการลงนามและการดำเนินการเอกสารที่ทรงพลังให้เลือกหลากหลาย"
  },
  "examples": {
    "comment_1": "ใช้ {{TextSignature}} เพื่อลงนามเอกสารอย่างเป็นทางการ",
    "comment_2": "ป้อนใบรับรองดิจิทัลและรหัสผ่านของมัน",
    "comment_3": "ตั้งค่าเพิ่มเติมเกี่ยวกับลักษณะของลายเซ็นได้ตามต้องการ",
    "comment_4": "เสร็จสิ้นเอกสารด้วยใบรับรองดิจิทัล"
  },
  "steps": {
    "title": "วิธีปกป้อง {{FileFormatUp}} ด้วยใบรับรองดิจิทัลใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยนักพัฒนา {{EnvName}} ปกป้องไฟล์ {{FileFormatUp}} โดยการเพิ่มลายเซ็นดิจิทัล เสริมสร้างแอปพลิเคชันธุรกิจของคุณด้วยฟีเจอร์ป้องกันเอกสารที่แข็งแกร่ง",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} ลงในคลาส {{TextSignature}}",
      "step_2": "ใช้ใบรับรองดิจิทัลและรหัสผ่านของมันเพื่อความปลอดภัยของไฟล์",
      "step_3": "เพิ่มเติม แสดงภาพลายเซ็นดิจิทัลบนหน้าเอกสาร",
      "step_4": "ลงนามเอกสารเพื่อป้องกันการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต"
    }
  },
  "code_1": {
    "title": "ปกป้องเอกสารด้วยลายเซ็นดิจิทัล",
    "content": "เรียนรู้วิธีการความปลอดภัยเอกสารของคุณโดยการใช้ลายเซ็นดิจิทัลเพื่อป้องกันการแก้ไขที่ไม่ได้รับอนุญาต",
    "comment_1": "โหลดเอกสารที่ต้องลงนาม",
    "comment_2": "ใช้ใบรับรองดิจิทัลที่ถูกต้องพร้อมรหัสผ่านที่เกี่ยวข้อง",
    "comment_3": "เพิ่มข้อมูลข้อความเพิ่มเติมหากจำเป็น",
    "comment_4": "รวมภาพหรือทางเลือกอื่นๆ สำหรับการแสดงภาพลายเซ็น",
    "comment_5": "บันทึกเอกสารที่ลงนามไว้ในที่ที่ปลอดภัย"
  }
}