{
  "head": {
    "title": "Додавання цифрових електронних підписів до файлів {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Додайте цифровий підпис на файл {{FileFormatUp}} за допомогою {{ProgLang}} всього за кілька рядків коду. Використовуйте {{ProdFullName}} для підписання численних форматів файлів."
  },
  "header": {
    "title": "eSign {{FileFormatUp}} з цифровими підписами",
    "description": "Захистіть цілісність ваших бізнес-документів, запечатуючи їх цифровими сертифікатами, використовуючи надійні можливості {{ProdFullName}}. Ми пропонуємо універсальні рішення для маркування і безпеки ваших документів.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажити безкоштовно"
  },
  "about": {
    "title": "Про {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) є складним рішенням для підписання, яке полегшує виконання широкого спектра завдань обробки документів. Він дозволяє встраювати текст, зображення, цифрові сертифікати та штампи у файли більше ніж 60 форматів, включаючи PDF, MS Office, зображення, ZIP файли та інші основні бізнес-формати. Крім того, підписані документи можуть бути легко пошуковані, перевірені, змінені або видалені за необхідності."
  },
  "more_features": {
    "title": "Покращте або захистіть вміст документа за допомогою підписів",
    "description": "Бібліотека {{ProdFullName}} розроблена для підписання всіх поширених форматів файлів. Оптимізуйте ваші бізнес-процеси, додаючи, змінюючи, перевіряючи чи видаляючи різноманітні підписи.",
    "image_description": "Ключові Особливості {{ProdShortName}}",
    "feature_1": {
      "title": "Включайте підписи в документи",
      "content": "Точно вбудовуйте підписи тексту, зображень, штрих-кодів, QR-кодів або штампів на будь-якій сторінці будь-якого підтримуваного документа. Ви також можете додавати або редагувати приховану метадані, такі як EXIF, в зображеннях та більшості типів файлів. Забезпечте цілісність вмісту вашого документа за допомогою цифрових підписів."
    },
    "feature_2": {
      "title": "Пошук та перевірка підписів",
      "content": "Обробка після підпису надає численні можливості. Перевірте, що ваші підписані документи були оброблені коректно. Для більшого контролю ви можете отримати повний список усіх підписів за допомогою функції пошуку."
    },
    "feature_3": {
      "title": "Зміна підписів",
      "content": "Більшість типів підписів повністю редаговані. Ви маєте можливість налаштовувати текст, переміщати елементи, змінювати кольори, змінювати розмір і багато іншого."
    },
    "feature_4": {
      "title": "Видалення зайвих підписів",
      "content": "Наше рішення надає повні CRUD-операції для підписів. За потреби ви можете видалити різні типи підписів, включаючи цифрові сертифікати, з вашого документа."
    }
  },
  "formats": {
    "title": "Підписуйте документи в різних форматах",
    "description": "API {{EnvName}} надає можливість обробки понад 60 різних форматів. Ви можете безперешкодно створювати та вбудовувати різноманітні підписи на будь-якій сторінці, застосовувати цифрові сертифікати для безпеки вмісту та ефективно керувати існуючими підписами в документі."
  },
  "operations": {
    "title": "Ознайомтеся з нашими видатними функціями",
    "description": "Ми пропонуємо багатий вибір форматів підписів та потужних операцій."
  },
  "examples": {
    "comment_1": "Використовуйте {{TextSignature}} для цифрового підписання документа",
    "comment_2": "Надайте цифровий сертифікат та відповідний пароль",
    "comment_3": "Налаштуйте візуальне представлення за потреби",
    "comment_4": "Захистіть документ за допомогою цифрового сертифіката"
  },
  "steps": {
    "title": "Як захистити {{FileFormatUp}} цифровими сертифікатами в {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) надає розробникам {{EnvName}} можливість захистити документи {{FileFormatUp}} від змін за допомогою цифрових підписів. Покращте свої бізнес-додатки потужними можливостями захисту даних.",
      "step_1": "Передайте документ {{FileFormatUp}} в конструктор класу {{TextSignature}}.",
      "step_2": "Використовуйте цифровий сертифікат та його пароль для захисту документа.",
      "step_3": "За бажанням, додайте візуальне представлення цифрового підпису на сторінки документа.",
      "step_4": "Підпишіть документ, щоб забезпечити його незмінність."
    }
  },
  "code_1": {
    "title": "Захистіть документи за допомогою цифрових підписів",
    "content": "Дізнайтеся, як запобігти модифікації документа за допомогою цифрових підписів.",
    "comment_1": "Надайте документ, що підписується",
    "comment_2": "Використовуйте дійсний цифровий сертифікат з відповідним паролем",
    "comment_3": "Вкажіть будь-яку додаткову текстову інформацію",
    "comment_4": "Включте зображення та інші параметри для візуального представлення",
    "comment_5": "Збережіть захищений документ у визначеному місці"
  }
}