{
  "head": {
    "title": "Додавання цифрових електронних підписів до файлів {{FileFormatUp}} з {{ProgLang}}",
    "description": "Поставте цифровий підпис на файл {{FileFormatUp}} за допомогою {{ProgLang}} всього за кілька рядків коду. Використовуйте {{ProdFullName}} для підписання численних форматів файлів."
  },
  "header": {
    "title": "Захистіть {{FileFormatUp}} за допомогою цифрових сертифікатів",
    "description": "Забезпечте безпеку ваших бізнес-документів, впроваджуючи цифрові сертифікати за допомогою розширених можливостей {{ProdFullName}}. Ми пропонуємо гнучкі варіанти для захисту та автентифікації ваших документів.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажити безкоштовно"
  },
  "about": {
    "title": "Про {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) є комплексним рішенням для підписання, що призначене для задоволення різноманітних потреб обробки документів. Воно дозволяє вам додавати текст, зображення, цифрові сертифікати та штампи у понад 60 різних форматів файлів, включаючи PDF, MS Office, зображення та ZIP файли. Крім того, підписані документи можна легко шукати, перевіряти, редагувати або видаляти за потреби."
  },
  "more_features": {
    "title": "Оптимізуйте або захистіть вміст документа за допомогою підписів",
    "description": "{{ProdFullName}} створено для підписання всіх основних форматів файлів, пропонуючи вам можливість додавати, коригувати, перевіряти або видаляти різні типи підписів.",
    "image_description": "Ключові можливості {{ProdShortName}}",
    "feature_1": {
      "title": "Додавайте підписи до своїх документів",
      "content": "Легко розміщуйте текстові, зображеневі, штрих-кодові, QR-кодові або штамповані підписи на будь-якій сторінці підтримуваних документів. Ви також можете вставити або редагувати приховані метадані, такі як EXIF у зображеннях. Захищайте зміст вашого документа від несанкціонованих змін за допомогою цифрових сертифікатів."
    },
    "feature_2": {
      "title": "Знаходьте та перевіряйте підписи",
      "content": "Після підписання ваш документ може проходити кілька перевірок. Підтверджуйте цілісність підписаного вмісту або проведіть детальний пошук, щоб перерахувати всі існуючі підписи."
    },
    "feature_3": {
      "title": "Редагуйте наявні підписи",
      "content": "Більшість типів підписів дозволяють редагувати після створення. Ви можете легко змінювати текст, пересувати елементи, коригувати кольори, змінювати розмір і вносити інші необхідні зміни."
    },
    "feature_4": {
      "title": "Видаляйте непотрібні підписи",
      "content": "Наше рішення забезпечує повну функціональність CRUD для підписів. У разі потреби ви можете видаляти різні типи підписів, включаючи цифрові сертифікати, з ваших документів."
    }
  },
  "formats": {
    "title": "Підписуйте документи в різних форматах",
    "description": "API {{EnvName}} підтримує понад 60 форматів, дозволяючи вам застосовувати різноманітні підписи на будь-якій сторінці, забезпечувати безпеку вмісту з допомогою цифрових сертифікатів та ефективно керувати підписами у документі."
  },
  "operations": {
    "title": "Ознайомтеся з нашими основними функціями",
    "description": "Ми з гордістю підтримуємо широкий спектр варіантів підпису та функціональностей."
  },
  "examples": {
    "comment_1": "Використовуйте {{TextSignature}} для застосування цифрового підпису до документа.",
    "comment_2": "Надайте необхідний цифровий сертифікат і пароль.",
    "comment_3": "Налаштуйте візуальні налаштування підпису за потреби.",
    "comment_4": "Зашифруйте документ, використовуючи цифровий сертифікат."
  },
  "steps": {
    "title": "Інструкції для захисту {{FileFormatUp}} за допомогою цифрових сертифікатів у {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) дозволяє розробникам {{EnvName}} захищати документи {{FileFormatUp}} від змін, використовуючи цифрові підписи. Покращте свої бізнес-додатки комплексними функціями захисту даних.",
      "step_1": "Передайте документ {{FileFormatUp}} до конструктора класу {{TextSignature}}.",
      "step_2": "Застосуйте цифровий сертифікат та відповідний пароль для забезпечення документа.",
      "step_3": "За бажанням, додайте візуальне представлення цифрового підпису на сторінках документа.",
      "step_4": "Підпишіть документ, щоб запобігти будь-яким майбутнім змінам."
    }
  },
  "code_1": {
    "title": "Захист документів цифровими підписами",
    "content": "Дізнайтеся, як заблокувати документ від змін за допомогою цифрових підписів.",
    "comment_1": "Надайте документ, який потрібно підписати.",
    "comment_2": "Використовуйте відповідний цифровий сертифікат і його пароль.",
    "comment_3": "Додайте будь-яку додаткову текстову інформацію.",
    "comment_4": "Додайте візуальні елементи, такі як зображення для представлення підпису.",
    "comment_5": "Збережіть цифрово захищений документ у зазначеному місці."
  }
}