{
  "head": {
    "title": "Protect {{FileFormatUp}} with digital certificates using {{ProgLang}}",
    "description": "Harness the power of {{ProgLang}} applications with {{ProdShortName}} to secure {{FileFormatUp}} documents through digital certificates."
  },
  "header": {
    "title": "Safeguard {{FileFormatUp}} with digital certificates",
    "description": "Ensure the security of your business documents by embedding digital certificates using the advanced capabilities of {{ProdFullName}}. We offer flexible options to protect and authenticate your documents.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download for free"
  },
  "about": {
    "title": "About {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is a comprehensive signing solution designed to handle a variety of document processing needs. It allows you to incorporate text, images, digital certificates, and stamps into over 60 different file formats, including PDF, MS Office, images, and ZIP files. Additionally, signed documents can be easily searched, verified, edited, or deleted when necessary."
  },
  "more_features": {
    "title": "Optimize or secure document content with signatures",
    "description": "{{ProdFullName}} is built to sign all major file formats, offering you the ability to add, adjust, verify, or remove various types of signatures with ease.",
    "image_description": "Key features of {{ProdShortName}}",
    "feature_1": {
      "title": "Add signatures to your documents",
      "content": "Easily place Text, Image, Barcode, QR-Code, or Stamp signatures on any page of supported documents. You can also insert or edit hidden metadata, such as EXIF in images. Protect your document content from unauthorized alterations with digital certificates."
    },
    "feature_2": {
      "title": "Locate and verify signatures",
      "content": "Post-signing, your document can undergo multiple verifications. Confirm the integrity of the signed content, or conduct a detailed search to list all existing signatures."
    },
    "feature_3": {
      "title": "Revise existing signatures",
      "content": "Most signature types allow for post-creation edits. You can easily modify text, reposition elements, adjust colors, resize, and make other necessary changes."
    },
    "feature_4": {
      "title": "Eliminate unnecessary signatures",
      "content": "Our solution enables full CRUD operations for signatures. If required, you can remove various signature types, including digital certificates, from your document."
    }
  },
  "formats": {
    "title": "Sign documents across multiple formats",
    "description": "The {{EnvName}} API supports over 60 formats, enabling you to apply a range of signatures on any page, enforce content security with digital certificates, and manage signatures within the document effectively."
  },
  "operations": {
    "title": "Get to know our main functions",
    "description": "We proudly support a comprehensive suite of signature options and functionalities"
  },
  "examples": {
    "comment_1": "Utilize {{TextSignature}} to apply a digital signature to the document",
    "comment_2": "Provide the required digital certificate and password",
    "comment_3": "Configure visual signature settings if necessary",
    "comment_4": "Encrypt the document using the digital certificate"
  },
  "steps": {
    "title": "Guidelines for securing {{FileFormatUp}} documents with digital certificates in {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) enables {{EnvName}} developers to protect {{FileFormatUp}} documents from modifications by employing digital signatures. Enhance your business applications with comprehensive data security features.",
      "step_1": "Pass the {{FileFormatUp}} document to the {{TextSignature}} class constructor.",
      "step_2": "Apply a digital certificate and its corresponding password to secure the document.",
      "step_3": "Optionally, add a visual representation of the digital signature on the document pages.",
      "step_4": "Sign the document to prevent any future alterations."
    }
  },
  "code_1": {
    "title": "Protect documents with digital signatures",
    "content": "Learn how to lock a document against changes using digital signatures.",
    "comment_1": "Provide the document that requires signing",
    "comment_2": "Use an appropriate digital certificate and its password",
    "comment_3": "Include any additional text information",
    "comment_4": "Add visual elements like images for the signature representation",
    "comment_5": "Save the digitally secured document to a specified location"
  }
}