{
  "head": {
    "title": "Add Metadata to {{FileFormatUp}} Files in {{ProgLang}} Applications",
    "description": "{{ProgLang}} metadata processing API to add metadata information to {{FileFormatUp}} files. Work with metadata standards XMP, EXIF, IPTC, ID3 etc"
  },
  "header": {
    "title": "Adding Metadata To {{FileFormatUp}} In {{ProgLang}}",
    "description": "Add custom metadata properties to a wide range of business documents, images, audio & video file formats using {{ProdFullName}} API",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download Free Trial"
  },
  "about": {
    "title": "About {{ProdFullName}} API",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) offers an advanced set of metadata management and manipulation features, allowing {{EnvName}} programmers to easily view, edit, delete, find, compare, swap and export metadata information from images and document formats without using any external software. Add metadata details to PDF, Microsoft Word, Excel, PowerPoint, Outlook, OneNote, Visio, Project, AutoCAD, Archive and Multimedia file formats with additional support to perform metadata operations on any {{ProdShortName}}-based applications with true flexibility"
  },
  "formats": {
    "title": "Adding Metadata Properties To Other File Formats",
    "description": "Multi format documents and images metadata addition API for {{ProdShortName}}. Retrieve metadata of some of the popular file formats as stated below."
  },
  "examples": {
    "comment_1": "Leverage {{TextSignature}} to digitally sign the document",
    "comment_2": "Provide the digital certificate and associated password",
    "comment_3": "Configure visual representation if required",
    "comment_4": "Secure the document with the digital certificate"
  },
  "steps": {
    "title": "Procedure for Securing {{FileFormatUp}} Files with Digital Certificates in {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) empowers {{EnvName}} developers to safeguard {{FileFormatUp}} documents against alterations using digital signatures. Augment your business applications with robust data protection capabilities.",
      "step_1": "Pass the {{FileFormatUp}} document to the {{TextSignature}} class constructor.",
      "step_2": "Utilize a digital certificate and its password to secure the document.",
      "step_3": "Optionally, add a visual representation of the digital signature on the document pages.",
      "step_4": "Sign the document to ensure it remains unaltered."
    }
  },
  "more_features": {
    "title": "Document Metadata Management",
    "description": "Our robust API simplifies the management of document metadata. Seamlessly access, edit, and manipulate a variety of document properties to enhance organization and searchability.",
    "image_description": "Metadata Manipulation Features",
    "feature_1": {
      "title": "Metadata Control",
      "content": "Easily retrieve and process metadata from documents. Gain valuable insights into properties such as author, creation date, and more."
    },
    "feature_2": {
      "title": "Metadata Editing",
      "content": "Directly modify document metadata. Update properties to improve organization, boost searchability, and ensure accurate information."
    },
    "feature_3": {
      "title": "Advanced Metadata Management",
      "content": "Execute complex operations on document metadata. Efficiently add custom properties, remove unnecessary data, and maintain data consistency."
    },
    "code_1": {
      "title": "Secure Documents with Digital Signatures",
      "content": "Discover how to prevent document modifications using digital signatures.",
      "comment_1": "Provide the document to be signed",
      "comment_2": "Use a valid digital certificate with the corresponding password",
      "comment_3": "Specify any additional text information",
      "comment_4": "Incorporate an image and other options for visual representation",
      "comment_5": "Save the secured document to a designated location"
    }
  }
}