{
  "head": {
    "title": "اضافه کردن امضاهای الکترونیکی دیجیتال به فایل {{FileFormatUp}} با {{ProgLang}}",
    "description": "روی یک فایل {{FileFormatUp}} امضای دیجیتال قرار دهید با استفاده از {{ProgLang}} تنها با چند خط کد. از {{ProdFullName}} برای امضای فرمت‌های مختلف فایل استفاده کنید."
  },
  "header": {
    "title": "امضای دیجیتال {{FileFormatUp}} با امضاهای دیجیتال",
    "description": "سلامت اسناد تجاری خود را با استفاده از گواهی‌های دیجیتال و ویژگی‌های قوی {{ProdFullName}} محکم کنید. ما راهکارهای متنوعی برای نشانه‌گذاری و ایمن‌سازی اسناد شما ارائه می‌دهیم.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "دانلود رایگان"
  },
  "about": {
    "title": "درباره {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) یک راه‌حل پیشرفته امضا است که طیف وسیعی از وظایف پردازش سند را تسهیل می‌کند. این نرم‌افزار به شما اجازه می‌دهد تا متن، تصاویر، گواهی‌های دیجیتال و مهرها را به فایل‌ها در بیش از 60 فرمت، از جمله PDF، MS Office، تصاویر، فایل‌های ZIP و سایر فرمت‌های ضروری تجاری وارد کنید. علاوه بر این، اسناد امضا شده می‌توانند به راحتی جستجو، تأیید، ویرایش یا حذف شوند."
  },
  "more_features": {
    "title": "محتوای سند را با امضاها افزایش یا ایمن کنید",
    "description": "کتابخانه {{ProdFullName}} برای امضای تمام فرمت‌های فایل رایج طراحی شده است. فرآیندهای تجاری خود را با افزودن، ویرایش، تأیید یا حذف انواع مختلف امضاها ساده کنید.",
    "image_description": "ویژگی‌های کلیدی {{ProdShortName}}",
    "feature_1": {
      "title": "گنجاندن امضاها در اسناد",
      "content": "امضاهای متنی، تصویری، بارکد، QR-Code یا مهر را با دقت در هر صفحه از هر سند پشتیبانی شده وارد کنید. همچنین می‌توانید متادیتای پنهان، مانند EXIF، در تصاویر و بیشتر انواع فایل‌ها را اضافه یا ویرایش کنید. با استفاده از امضاهای دیجیتال اطمینان حاصل کنید که محتوای سند شما دست نخورده باقی مانده است."
    },
    "feature_2": {
      "title": "جستجو و تأیید امضاها",
      "content": "پردازش پس از امضا امکانات زیادی را ارائه می‌دهد. بررسی کنید که آیا اسناد امضا شده شما به درستی پردازش شده‌اند یا خیر. برای کنترل بیشتر، می‌توانید فهرست کاملی از تمام امضاها را از طریق تابع جستجو استخراج کنید."
    },
    "feature_3": {
      "title": "ویرایش امضاها",
      "content": "اکثر انواع امضاها به طور کامل قابل ویرایش هستند. شما می‌توانید متن را تنظیم کنید، عناصر را جابجا کنید، رنگ‌ها را تغییر دهید، اندازه را تغییر دهید و موارد دیگر."
    },
    "feature_4": {
      "title": "حذف امضاهای زائد",
      "content": "راه‌حل ما عملیات کامل CRUD را برای امضاها فراهم می‌کند. در صورت لزوم، می‌توانید انواع مختلف امضاها، از جمله گواهی‌های دیجیتال را از سند خود حذف کنید."
    }
  },
  "formats": {
    "title": "امضای اسناد در فرمت‌های مختلف",
    "description": "API {{EnvName}} به شما این امکان را می‌دهد که بیش از 60 فرمت مختلف را پردازش کنید. شما می‌توانید به‌طور یکپارچه امضاهای متنوعی را در هر صفحه ایجاد و گنجانده، گواهی‌های دیجیتال را برای امنیت محتوا اعمال کرده و به‌طور کارآمد امضاهای موجود را مدیریت کنید."
  },
  "operations": {
    "title": "به ویژگی‌های برجسته ما نگاهی بیندازید",
    "description": "ما تنوع بالایی از فرمت‌های امضا و عملیات قدرتمند را ارائه می‌دهیم"
  },
  "examples": {
    "comment_1": "از {{TextSignature}} برای امضای دیجیتال سند استفاده کنید",
    "comment_2": "گواهی دیجیتال و رمز عبور مرتبط را ارائه دهید",
    "comment_3": "اگر نیاز است، نمای تصویری را تنظیم کنید",
    "comment_4": "سند را با گواهی دیجیتال ایمن کنید"
  },
  "steps": {
    "title": "چگونه {{FileFormatUp}} را با گواهی‌های دیجیتال در {{ProgLang}} ایمن کنید",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) به توسعه‌دهندگان {{EnvName}} اجازه می‌دهد سندهای {{FileFormatUp}} را در مقابل تغییرات با استفاده از امضاهای دیجیتال ایمن کنند. برنامه‌های تجاری خود را با قابلیت‌های قوی حفاظت از داده‌ها تقویت کنید.",
      "step_1": "فایل {{FileFormatUp}} را به سازنده کلاس {{TextSignature}} پاس دهید.",
      "step_2": "برای ایمن‌سازی سند از یک گواهی دیجیتال و رمز عبور آن استفاده کنید.",
      "step_3": "اختیاری، نمای تصویری امضای دیجیتال را در صفحات سند اضافه کنید.",
      "step_4": "سند را امضا کنید تا مطمئن شوید که دست نخورده باقی مانده است."
    }
  },
  "code_1": {
    "title": "ایمن‌سازی اسناد با امضاهای دیجیتال",
    "content": "یاد بگیرید چگونه با استفاده از امضاهای دیجیتال از تغییرات در اسناد جلوگیری کنید.",
    "comment_1": "فایل را برای امضا کردن ارائه دهید",
    "comment_2": "از یک گواهی دیجیتال معتبر با رمز عبور مربوطه استفاده کنید",
    "comment_3": "هر اطلاعات متنی اضافی را مشخص کنید",
    "comment_4": "یک تصویر و گزینه‌های دیگر برای نمای تصویری وارد کنید",
    "comment_5": "سند ایمن شده را در یک مکان مشخص ذخیره کنید"
  }
}