{
  "head": {
    "title": "เพิ่มลายเซ็นดิจิทัลอิเล็กทรอนิกส์ลงในไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ใส่ลายเซ็นดิจิทัลลงในไฟล์ {{FileFormatUp}} โดยใช้ {{ProgLang}} ด้วยโค้ดเพียงไม่กี่บรรทัด ใช้ {{ProdFullName}} เพื่อเซ็นชื่อไฟล์หลายรูปแบบ."
  },
  "header": {
    "title": "เซ็นไฟล์ {{FileFormatUp}} ด้วยลายเซ็นดิจิทัล",
    "description": "ปกป้องเนื้อหาของเอกสารธุรกิจของคุณโดยการปิดผนึกด้วยใบรับรองดิจิทัลโดยใช้คุณสมบัติของ {{ProdFullName}} เรามีหลายวิธีในการทำเครื่องหมายและรักษาความปลอดภัยให้กับเอกสารของคุณ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันการเซ็นชื่อที่ครอบคลุมซึ่งรองรับการประมวลผลเอกสารหลายประเภท คุณสามารถเพิ่มข้อความ รูปภาพ ใบรับรองดิจิทัล และตราไว้ในไฟล์กว่า 60 รูปแบบ รวมถึง PDF, MS Office, รูปภาพ, ไฟล์ ZIP และรูปแบบธุรกิจอื่นๆ ที่นิยม นอกจากนี้ เอกสารที่ลงนามสามารถค้นหา ตรวจสอบ แก้ไข หรือ ลบโดยอัตโนมัติได้อย่างสะดวก."
  },
  "more_features": {
    "title": "ปรับปรุงหรือปกป้องเนื้อหาเอกสารด้วยลายเซ็น",
    "description": "ไลบรารี {{ProdFullName}} สามารถเซ็นชื่อไฟล์รูปแบบยอดนิยมทั้งหมดได้ เพิ่ม แก้ไข ตรวจสอบ หรือ ลบลายเซ็นประเภทต่างๆ โดยอัตโนมัติเพื่อทำให้กระบวนการทางธุรกิจของคุณราบรื่นยิ่งขึ้น.",
    "image_description": "คุณสมบัติของ {{ProdShortName}}",
    "feature_1": {
      "title": "เพิ่มลายเซ็นลงในเอกสาร",
      "content": "ลายเซ็นประเภท ข้อความ, รูปภาพ, บาร์โค้ด, QR-Code, หรือ ตราสามารถเพิ่มเติมได้อย่างแม่นยำในทุกหน้าของเอกสารที่รองรับ เมตาดาทาที่ซ่อนอยู่ เช่น EXIF สามารถเพิ่มหรือแก้ไขในรูปภาพและประเภทไฟล์ส่วนใหญ่ ใช้ลายเซ็นดิจิทัลเพื่อปกป้องเนื้อหาเอกสารจากการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต."
    },
    "feature_2": {
      "title": "ค้นหาและตรวจสอบลายเซ็น",
      "content": "เอกสารสามารถประมวลผลในหลายวิธีหลังจากการเซ็นชื่อ ตรวจสอบเอกสารที่ลงนามเพื่อให้แน่ใจว่ามีการประมวลผลอย่างถูกต้อง หากคุณต้องการการควบคุมเพิ่มเติม ให้ดึงรายการลายเซ็นทั้งหมดผ่านการค้นหา."
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็น",
      "content": "ลายเซ็นส่วนใหญ่รองรับการปรับเปลี่ยนเพิ่มเติม คุณสามารถแก้ไขข้อความ เปลี่ยนตำแหน่ง สี ขนาด และอื่นๆ."
    },
    "feature_4": {
      "title": "ลบลายเซ็นที่ไม่จำเป็น",
      "content": "โซลูชันของเรารองรับการดำเนินการ CRUD อย่างครบถ้วนสำหรับลายเซ็น ลายเซ็นหลายประเภท รวมถึงใบรับรองดิจิทัล สามารถลบออกจากเอกสารได้เมื่อจำเป็น."
    }
  },
  "formats": {
    "title": "เซ็นเอกสารในรูปแบบอื่นๆ",
    "description": "API {{EnvName}} อนุญาตให้คุณประมวลผลมากกว่า 60 รูปแบบ สร้างและเพิ่มลายเซ็นต่างๆ ลงในทุกหน้า ปิดผนึกเนื้อหาด้วยใบรับรองดิจิทัล และจัดการและแก้ไขลายเซ็นที่มีอยู่ภายในเอกสาร."
  },
  "operations": {
    "title": "ตรวจสอบชุดฟีเจอร์ที่ครอบคลุมของเรา",
    "description": "เราภูมิใจในฟังก์ชันการทำงานที่มากมายและการสนับสนุนลายเซ็นที่แพลตฟอร์มของเราเสนอ."
  },
  "examples": {
    "comment_1": "ใช้ {{TextSignature}} กับเอกสารเพื่อการเซ็นชื่อดิจิทัล",
    "comment_2": "จัดเตรียมใบรับรองดิจิทัลและรหัสผ่าน",
    "comment_3": "ตั้งค่าการแสดงผลลักษณะหากจำเป็น",
    "comment_4": "ปกป้องเอกสารด้วยใบรับรองดิจิทัล"
  },
  "steps": {
    "title": "ขั้นตอนในการปกป้อง {{FileFormatUp}} ด้วยใบรับรองดิจิทัลใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) อนุญาตให้นักพัฒนา {{EnvName}} ป้องกันการเปลี่ยนแปลงในเอกสาร {{FileFormatUp}} โดยใช้ลายเซ็นดิจิทัล มอบความสามารถให้กับแอปพลิเคชันธุรกิจของคุณในการรักษาความปลอดภัยข้อมูลสำคัญ.",
      "step_1": "ส่งเอกสาร {{FileFormatUp}} ไปยังตัวสร้างของคลาส {{TextSignature}}.",
      "step_2": "ใช้ใบรับรองดิจิทัลและรหัสผ่านเพื่อป้องกันเอกสาร.",
      "step_3": "สามารถเลือกที่จะเพิ่มการแสดงผลลักษณะลงในหน้าของเอกสารได้.",
      "step_4": "เซ็นเอกสารเพื่อป้องกันไม่ให้มีการเปลี่ยนแปลงในอนาคต."
    }
  },
  "code_1": {
    "title": "ปกป้องเอกสารด้วยลายเซ็นดิจิทัล",
    "content": "เรียนรู้วิธีในการรักษาความปลอดภัยเอกสารจากการเปลี่ยนแปลงโดยใช้ลายเซ็นดิจิทัล.",
    "comment_1": "จัดเตรียมเอกสารสำหรับการเซ็นชื่อ",
    "comment_2": "ใช้ใบรับรองดิจิทัลที่ถูกต้องพร้อมรหัสผ่าน",
    "comment_3": "ระบุข้อมูลข้อความเพิ่มเติม",
    "comment_4": "ใช้ภาพและตัวเลือกอื่นๆ สำหรับการแสดงผลเชิงภาพ",
    "comment_5": "บันทึกเอกสารที่ได้รับการปกป้องไปยังตำแหน่งอื่น"
  }
}