{
  "head": {
    "title": "Додавання цифрових електронних підписів до файлу {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Додайте цифровий підпис до файлу {{FileFormatUp}} за допомогою {{ProgLang}} всього за кілька рядків коду. Використовуйте {{ProdFullName}}, щоб підписувати численні формати файлів."
  },
  "header": {
    "title": "Підпишіть {{FileFormatUp}} цифровими підписами",
    "description": "Захистіть вміст ваших бізнес-документів, накладаючи на них цифрові сертифікати за допомогою можливостей {{ProdFullName}}. Ми пропонуємо безліч способів маркування та захисту ваших документів.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажити безкоштовно"
  },
  "about": {
    "title": "Про {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — це комплексне рішення для підписання, яке підтримує різні типи обробки документів. Ви можете додавати текст, зображення, цифрові сертифікати та штампи до файлів у понад 60 форматах, включаючи PDF, MS Office, зображення, ZIP-файли та інші популярні бізнес-формати. Крім цього, підписані документи можуть бути автоматично проіндексовані, перевірені, змінені або видалені зручним способом."
  },
  "more_features": {
    "title": "Покращте або захистіть вміст документа за допомогою підписів",
    "description": "Бібліотека {{ProdFullName}} здатна підписувати всі популярні формати файлів. Додавайте, модифікуйте, перевіряйте або видаляйте різні типи підписів автоматично, щоб оптимізувати ваші бізнес-процеси.",
    "image_description": "Можливості {{ProdShortName}}",
    "feature_1": {
      "title": "Додавання підписів до документів",
      "content": "Текстові, зображеневі, штрих-кодові, QR-коди або штампні підписи можуть бути точно додані на будь-яку сторінку будь-якого підтримуваного документа. Приховані метадані, такі як EXIF, можуть бути додані або змінені в зображеннях та більшості типів файлів. Захистіть вміст документа від несанкціонованих змін за допомогою цифрових підписів."
    },
    "feature_2": {
      "title": "Пошук і перевірка підписів",
      "content": "Документи можуть оброблятися різними способами після підписання. Перевірте підписані документи, щоб упевнитися, що вони були правильно оброблені. Якщо вам потрібно більше контролю, отримайте список усіх підписів через пошук."
    },
    "feature_3": {
      "title": "Редагування підписів",
      "content": "Більшість типів підписів підтримують подальше модифікування. Ви можете коригувати текст, змінювати позицію, колір, розмір тощо."
    },
    "feature_4": {
      "title": "Видалення непотрібних підписів",
      "content": "Наше рішення підтримує повні CRUD-операції для підписів. Багато типів підписів, включаючи цифрові сертифікати, можуть бути видалені з документа за необхідності."
    }
  },
  "formats": {
    "title": "Підписуйте документи в інших форматах",
    "description": "API {{EnvName}} дозволяє обробляти більше 60 форматів. Створюйте та додавайте різноманітні підписи на будь-яку сторінку, захищайте вміст цифровими сертифікатами, а також керуйте та редагуйте існуючі підписи в документі."
  },
  "operations": {
    "title": "Ознайомтеся з нашим комплексним набором функцій",
    "description": "Ми пишаємося широкою функціональністю та підтримкою підпису, які наша платформа пропонує."
  },
  "examples": {
    "comment_1": "Використовуйте {{TextSignature}} з документом для цифрового підписання",
    "comment_2": "Надайте цифровий сертифікат та пароль",
    "comment_3": "Налаштуйте візуальне представлення за необхідності",
    "comment_4": "Захистіть документ цифровим сертифікатом"
  },
  "steps": {
    "title": "Кроки для захисту {{FileFormatUp}} за допомогою цифрових сертифікатів у {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) дозволяє розробникам {{EnvName}} запобігати змінам у документах {{FileFormatUp}} за допомогою цифрових підписів. Наддайте вашим бізнес-додаткам можливість захищати важливі дані.",
      "step_1": "Передайте документ {{FileFormatUp}} в конструктор класу {{TextSignature}}.",
      "step_2": "Використовуйте цифровий сертифікат та його пароль для захисту документа.",
      "step_3": "За бажанням, додайте візуальне представлення цифрового підпису на сторінках документа.",
      "step_4": "Підпишіть документ, щоб запобігти будь-яким змінам у майбутньому."
    }
  },
  "code_1": {
    "title": "Захист документів цифровими підписами",
    "content": "Дізнайтеся, як забезпечити документ від змін за допомогою цифрових підписів.",
    "comment_1": "Надайте документ для підписання",
    "comment_2": "Використовуйте дійсний цифровий сертифікат з паролем",
    "comment_3": "Вкажіть додаткові текстові дані",
    "comment_4": "Використовуйте зображення та інші параметри для візуального представлення",
    "comment_5": "Збережіть захищений документ в іншому місці"
  }
}