{
  "head": {
    "title": "Добавление цифровых электронных подписей к файлам {{FileFormatUp}} с использованием {{ProgLang}}",
    "description": "Добавьте цифровую подпись к файлу {{FileFormatUp}} с помощью {{ProgLang}} всего за несколько строк кода. Используйте {{ProdFullName}} для подписания различных форматов файлов."
  },
  "header": {
    "title": "Подпись {{FileFormatUp}} цифровыми подписями",
    "description": "Защитите содержимое своих бизнес-документов, запечатав их цифровыми сертификатами с использованием возможностей {{ProdFullName}}. Мы предоставляем множество способов маркировки и защиты ваших документов.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать бесплатно"
  },
  "about": {
    "title": "О {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — это комплексное решение для подписи, поддерживающее различные типы обработки документов. Вы можете добавлять текст, изображения, цифровые сертификаты и штампы к файлам в более чем 60 форматах, включая PDF, MS Office, изображения, ZIP-файлы и другие популярные бизнес-форматы. Кроме того, подписанные документы можно удобно искать, проверять, изменять или удалять автоматически."
  },
  "more_features": {
    "title": "Улучшите или защитите содержимое документа с помощью подписей",
    "description": "Библиотека {{ProdFullName}} способна подписывать все популярные форматы файлов. Добавляйте, изменяйте, проверяйте или удаляйте различные типы подписей автоматически, чтобы оптимизировать ваши бизнес-процессы.",
    "image_description": "Функции {{ProdShortName}}",
    "feature_1": {
      "title": "Добавление подписей к документам",
      "content": "Подписи в текстовом, изображенческом, штрих-кодном, QR-кодном или штампированном виде можно точно добавлять на любые страницы поддерживаемых документов. Скрытые метаданные, такие как EXIF, можно добавлять или редактировать в изображениях и большинстве типов файлов. Защитите содержимое документа от несанкционированных изменений с помощью цифровых подписей."
    },
    "feature_2": {
      "title": "Поиск и проверка подписей",
      "content": "Документы могут быть обработаны различными способами после подписания. Проверяйте подписанные документы, чтобы убедиться, что они были правильно обработаны. Если вам нужно больше контроля, вы можете получить список всех подписей через поиск."
    },
    "feature_3": {
      "title": "Редактирование подписей",
      "content": "Большинство типов подписей поддерживают дальнейшее изменение. Вы можете исправлять текст, изменять положение, цвет, размер и многое другое."
    },
    "feature_4": {
      "title": "Удаление ненужных подписей",
      "content": "Наше решение поддерживает полные операции CRUD для подписей. Многие типы подписей, включая цифровые сертификаты, можно удалить из документа при необходимости."
    }
  },
  "formats": {
    "title": "Подписывайте документы в других форматах",
    "description": "API {{EnvName}} позволяет обрабатывать более 60 форматов. Создавайте и добавляйте различные подписи на любые страницы, запечатывайте содержимое цифровыми сертификатами и управляйте и редактируйте существующие подписи в документе."
  },
  "operations": {
    "title": "Изучите наш обширный набор функций",
    "description": "Мы гордимся обширной функциональностью и поддержкой подписей, которые предлагает наша платформа."
  },
  "examples": {
    "comment_1": "Используйте {{TextSignature}} для цифровой подписи документа",
    "comment_2": "Предоставьте цифровой сертификат и пароль",
    "comment_3": "Настройте визуальное представление при необходимости",
    "comment_4": "Защитите документ цифровым сертификатом"
  },
  "steps": {
    "title": "Шаги по защите {{FileFormatUp}} с помощью цифровых сертификатов в {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) позволяет разработчикам {{EnvName}} предотвращать изменения в документах {{FileFormatUp}} с использованием цифровых подписей. Усовершенствуйте ваши бизнес-приложения, обеспечив возможность защиты важных данных.",
      "step_1": "Передайте документ {{FileFormatUp}} в конструктор класса {{TextSignature}}.",
      "step_2": "Используйте цифровой сертификат и его пароль для защиты документа.",
      "step_3": "При необходимости добавьте визуальное представление цифровой подписи на страницы документа.",
      "step_4": "Подпишите документ, чтобы предотвратить любые будущие изменения."
    }
  },
  "code_1": {
    "title": "Защита документов с помощью цифровых подписей",
    "content": "Узнайте, как защитить документ от изменений с помощью цифровых подписей.",
    "comment_1": "Предоставьте документ для подписания",
    "comment_2": "Используйте действующий цифровой сертификат с паролем",
    "comment_3": "Укажите дополнительные текстовые данные",
    "comment_4": "Используйте изображение и другие параметры для визуального представления",
    "comment_5": "Сохраните защищенный документ в другое место"
  }
}