{
  "head": {
    "title": "การเพิ่มลายเซ็นดิจิทัลลงในไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "เพิ่มลายเซ็นดิจิทัลลงในไฟล์ {{FileFormatUp}} โดยใช้ {{ProgLang}} ด้วยโค้ดเพียงไม่กี่บรรทัด ใช้ {{ProdFullName}} เพื่อเซ็นชื่อในรูปแบบไฟล์หลายรูปแบบ"
  },
  "header": {
    "title": "eSign {{FileFormatUp}} ด้วยลายเซ็นดิจิทัล",
    "description": "ปกป้องความสมบูรณ์ของเอกสารทางธุรกิจของคุณโดยการปิดผนึกด้วยใบรับรองดิจิทัลโดยใช้คุณสมบัติที่แข็งแกร่งของ {{ProdFullName}} เรามีโซลูชันที่หลากหลายเพื่อทำเครื่องหมายและรักษาความปลอดภัยของเอกสารของคุณ",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) เป็นโซลูชันการเซ็นชื่อที่ซับซ้อนซึ่งช่วยให้จัดการงานการประมวลผลเอกสารได้หลากหลาย มันช่วยให้คุณสามารถฝังข้อความ, รูปภาพ, ใบรับรองดิจิทัล และตราประทับลงในไฟล์กว่า 60 แฟ้มฟอร์แมต รวมถึง PDF, MS Office, รูปภาพ, ไฟล์ ZIP และรูปแบบธุรกิจที่สำคัญอื่น ๆ นอกจากนี้ เอกสารที่ลงนามสามารถค้นหา, ยืนยัน, แก้ไข หรือถูกลบได้ตามความจำเป็น"
  },
  "more_features": {
    "title": "เพิ่มหรือปกป้องเนื้อหาเอกสารด้วยลายเซ็น",
    "description": "ไลบรารี {{ProdFullName}} ได้รับการออกแบบมาเพื่อเซ็นชื่อในรูปแบบไฟล์ที่แพร่หลายทั้งหมด ทำให้กระบวนการทางธุรกิจของคุณเร็วขึ้นโดยการเพิ่ม แก้ไข ยืนยัน หรือเอาลายเซ็นหลากหลายประเภทออกได้อย่างง่ายดาย",
    "image_description": "คุณสมบัติหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "ฝังลายเซ็นลงในเอกสาร",
      "content": "ฝังลายเซ็นประเภทข้อความ, รูปภาพ, บาร์โค้ด, QR-Code หรือ ตราประทับด้วยความแม่นยำบนหน้าทุกหน้าของเอกสารที่รองรับ คุณยังสามารถเพิ่มหรือแก้ไขข้อมูลเมตาภาพที่ซ่อนอยู่ เช่น EXIF ในรูปภาพและประเภทไฟล์ส่วนใหญ่ เพื่อให้มั่นใจในความสมบูรณ์ของเนื้อหาเอกสารของคุณด้วยลายเซ็นดิจิทัล"
    },
    "feature_2": {
      "title": "ค้นหาและยืนยันลายเซ็น",
      "content": "การประมวลผลหลังการเซ็นชื่อเปิดโอกาสมากมาย ยืนยันว่าเอกสารที่ลงนามของคุณได้รับการประมวลผลอย่างถูกต้อง เพื่อความควบคุมที่มากขึ้น รับรายการลายเซ็นทั้งหมดอย่างครอบคลุมผ่านฟังก์ชันค้นหา"
    },
    "feature_3": {
      "title": "แก้ไขลายเซ็น",
      "content": "ลายเซ็นประเภทส่วนใหญ่สามารถแก้ไขได้เต็มที่ คุณสามารถปรับแก้ข้อความ, ย้ายอิลิเมนต์, เปลี่ยนสี, เปลี่ยนขนาด และอีกมากมาย"
    },
    "feature_4": {
      "title": "ลบลายเซ็นที่ไม่จำเป็น",
      "content": "โซลูชันของเรามีการดำเนินการ CRUD เต็มรูปแบบสำหรับลายเซ็น หากจำเป็น คุณสามารถลบประเภทลายเซ็นที่หลากหลาย รวมถึงใบรับรองดิจิทัล ออกจากเอกสารของคุณ"
    }
  },
  "formats": {
    "title": "เซ็นเอกสารในรูปแบบต่างๆ",
    "description": "API {{EnvName}} ช่วยให้คุณสามารถประมวลผลรูปแบบต่างๆ กว่า 60 รูปแบบ คุณสามารถสร้างและฝังลายเซ็นที่หลากหลายอย่างราบรื่นในทุกหน้า ใช้ใบรับรองดิจิทัลเพื่อรักษาความปลอดภัยของเนื้อหา และจัดการลายเซ็นที่มีอยู่ในเอกสารได้อย่างมีประสิทธิภาพ"
  },
  "operations": {
    "title": "ดูคุณสมบัติที่โดดเด่นของเรา",
    "description": "เรานำเสนอคุณสมบัติของลายเซ็นที่หลากหลายและการดำเนินการที่ทรงพลัง"
  },
  "examples": {
    "comment_1": "ใช้ {{TextSignature}} ในการเซ็นชื่อเอกสารดิจิทัล",
    "comment_2": "จัดเตรียมใบรับรองดิจิทัลและรหัสผ่านที่เกี่ยวข้อง",
    "comment_3": "กำหนดการนำเสนอภาพลักษณ์ตามต้องการ",
    "comment_4": "รักษาความปลอดภัยของเอกสารด้วยใบรับรองดิจิทัล"
  },
  "steps": {
    "title": "วิธีการรักษาความปลอดภัยให้กับ {{FileFormatUp}} ด้วยใบรับรองดิจิทัลใน {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้นักพัฒนา {{EnvName}} สามารถรักษาความปลอดภัยเอกสาร {{FileFormatUp}} จากการเปลี่ยนแปลงโดยใช้ลายเซ็นดิจิทัล เสริมสร้างแอปพลิเคชันทางธุรกิจของคุณด้วยความสามารถในการป้องกันข้อมูลที่มีความแข็งแกร่ง",
      "step_1": "ส่งเอกสาร {{FileFormatUp}} ไปยังตัวสร้างของคลาส {{TextSignature}}",
      "step_2": "ใช้ใบรับรองดิจิทัลและรหัสผ่านของมันเพื่อรักษาความปลอดภัยให้กับเอกสาร",
      "step_3": "เพิ่มการนำเสนอภาพลักษณ์ของลายเซ็นดิจิทัลลงในหน้าของเอกสารถ้าจำเป็น",
      "step_4": "เซ็นเอกสารเพื่อให้แน่ใจว่าเอกสารถูกเก็บไว้ไม่เปลี่ยนแปลง"
    }
  },
  "code_1": {
    "title": "รักษาความปลอดภัยเอกสารด้วยลายเซ็นดิจิทัล",
    "content": "ค้นพบวิธีป้องกันการเปลี่ยนแปลงเอกสารโดยใช้ลายเซ็นดิจิทัล",
    "comment_1": "จัดเตรียมเอกสารที่จะเซ็นชื่อ",
    "comment_2": "ใช้ใบรับรองดิจิทัลที่ใช้งานได้กับรหัสผ่านที่เกี่ยวข้อง",
    "comment_3": "ระบุข้อมูลข้อความเพิ่มเติม",
    "comment_4": "ฝังภาพและตัวเลือกอื่น ๆ สำหรับการนำเสนอภาพลักษณ์",
    "comment_5": "บันทึกเอกสารที่ปลอดภัยไปยังตำแหน่งที่กำหนด"
  }
}