{
  "head": {
    "title": "Оновлення підписів у документах {{FileFormatUp}} за допомогою додатків {{ProgLang}}",
    "description": "Використовуйте API {{ProgLang}} для перегляду та управління цифровими підписами в форматах {{FileFormatUp}}, включаючи PDF, Word, Excel, PowerPoint та зображення."
  },
  "header": {
    "title": "Налаштування підписів у {{FileFormatUp}}",
    "description": "З {{ProdFullName}} ви можете змінювати різноманітні електронні підписи, вбудовані у ваші бізнес-документи, включаючи PDF, Word, Excel, презентації та формати зображень.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажити безкоштовно"
  },
  "about": {
    "title": "Огляд {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) дозволяє не лише додавати підписи, але й вносити в них зміни за потреби. Незалежно від того, чи працюєте ви з PDF, документами Word, таблицями Excel або презентаціями, {{ProdFullName}} забезпечує безперешкодний контроль над управлінням підписами, що робить майбутні модифікації простими та інтуїтивними."
  },
  "more_features": {
    "title": "Управління підписами для документів",
    "description": "{{ProdFullName}} пропонує потужний набір інструментів для додавання, модифікації, перевірки, пошуку та видалення підписів у широкому спектрі форматів документів, підвищуючи вашу продуктивність та безпеку документів.",
    "image_description": "Редагування підписів",
    "feature_1": {
      "title": "Гнучке підписання документів",
      "content": "Підписуйте свої документи з різноманітними опціями — текстом, зображеннями, штрих-кодами та печатками — у будь-якому місці вашого файлу. Ви також можете редагувати вбудовані метадані, такі як дані EXIF в зображеннях, і захищати конфіденційну інформацію за допомогою цифрових сертифікатів."
    },
    "feature_2": {
      "title": "Перевірка та пошук підписів",
      "content": "Забезпечте цілісність ваших документів, перевіряючи підписи без зусиль. Використовуйте вбудовану функції пошуку, щоб знаходити та керувати всіма підписами у файлі, гарантуючи, що нічого не буде проігноровано."
    },
    "feature_3": {
      "title": "Оновлення існуючих підписів",
      "content": "Коли підпис потребує корекцій, будь то зміна зовнішнього вигляду, позиції чи вмісту, наш API робить процес гладким і безпроблемним, дозволяючи вам швидко налаштувати будь-який підпис."
    },
    "feature_4": {
      "title": "Видалення небажаних підписів",
      "content": "Чи потрібно видалити застарілий підпис, чи просто очистити документ, {{ProdFullName}} надає повний контроль над видаленням підписів, забезпечуючи актуальність ваших файлів."
    }
  },
  "formats": {
    "title": "Редагуйте підписи в різних форматах файлів",
    "description": "За допомогою API {{EnvName}} підписані документи можна переглядати в будь-який час, що дозволяє вам витягувати та змінювати властивості підписів для популярних бізнес-форматів, гарантуючи повну гнучкість і контроль."
  },
  "operations": {
    "title": "Досліджуйте наші можливості підписів та функціональності",
    "description": "Ми пропонуємо багатий набір можливостей підпису разом з численними інструментами для операцій."
  },
  "examples": {
    "comment_1": "Ініціалізуйте об'єкт {{TextSignature}} із шляхом до документа",
    "comment_2": "Виконайте пошук, щоб знайти текстові підписи в документі",
    "comment_3": "Редагуйте текст першого знайденого підпису",
    "comment_4": "Перевірте внесені зміни до підпису"
  },
  "steps": {
    "title": "Покрокова інструкція щодо зміни текстових підписів у {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) надає розробникам {{EnvName}} можливість оновлювати вміст текстових підписів, які раніше були вбудовані у файли {{FileFormatUp}}. Покращте додатки {{EnvName}} з потужними можливостями редагування.",
      "step_1": "Імпортуйте документ {{FileFormatUp}} в об'єкт {{TextSignature}}.",
      "step_2": "Отримайте список усіх підписів у документі.",
      "step_3": "Оновіть вміст необхідного підпису.",
      "step_4": "Перегляньте результати модифікацій."
    }
  },
  "code_1": {
    "title": "Редагування підписів зі штрих-кодом",
    "content": "Цей приклад демонструє, як програмно редагувати підписи зі штрих-кодом у документі.",
    "comment_1": "Завантажте документ, який містить підписи зі штрих-кодами",
    "comment_2": "Визначте всі підписи зі штрих-кодами в документі",
    "comment_3": "Змініть місце розташування першого підпису зі штрих-кодом і збережіть документ",
    "comment_4": "Підтвердіть успішну модифікацію штрих-коду"
  }
}