{
  "head": {
    "title": "ปรับปรุงลายเซ็นในเอกสาร {{FileFormatUp}} ด้วยแอป {{ProgLang}}",
    "description": "ใช้ API {{ProgLang}} ในการแก้ไขและจัดการลายเซ็นดิจิตอลในรูปแบบ {{FileFormatUp}} รวมถึง PDF, Word, Excel, PowerPoint และไฟล์ภาพ."
  },
  "header": {
    "title": "ปรับลายเซ็นใน {{FileFormatUp}} ได้อย่างมีประสิทธิภาพ",
    "description": "ด้วย {{ProdFullName}} คุณสามารถปรับเปลี่ยนลายเซ็นอิเล็กทรอนิกส์ที่ฝังอยู่ในเอกสารธุรกิจของคุณ รวมถึงไฟล์ PDF, Word, Excel, การนำเสนอและรูปภาพ.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "ภาพรวมของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ทำให้คุณสามารถไม่เพียงแค่เพิ่มลายเซ็น แต่ยังปรับแต่งได้ตามที่จำเป็น ไม่ว่าคุณจะทำงานกับ PDF, เอกสาร Word, สเปรดชีต Excel หรือการนำเสนอ, {{ProdFullName}} มีความสามารถในการจัดการลายเซ็นที่ราบรื่น ทำให้การปรับเปลี่ยนในอนาคตเป็นเรื่องง่ายและเป็นธรรมชาติ."
  },
  "more_features": {
    "title": "การจัดการลายเซ็นสำหรับเอกสาร",
    "description": "{{ProdFullName}} มีเครื่องมือที่ทรงพลังในการเพิ่ม แก้ไข ตรวจสอบ ค้นหา และลบลายเซ็นในเอกสารหลากหลายรูปแบบ ช่วยเพิ่มประสิทธิภาพการทำงานและความปลอดภัยของเอกสาร.",
    "image_description": "การแก้ไขลายเซ็น",
    "feature_1": {
      "title": "การลงนามเอกสารที่ยืดหยุ่น",
      "content": "ลงนามเอกสารของคุณด้วยตัวเลือกที่หลากหลาย—ข้อความ, รูปภาพ, บาร์โค้ด และตราประทับ—ที่ตำแหน่งใดก็ได้ในไฟล์ของคุณ คุณยังสามารถปรับเปลี่ยนเมตาดาต้าที่ฝังอยู่เช่น EXIF ในภาพและปกป้องข้อมูลที่ละเอียดอ่อนด้วยใบรับรองดิจิตอล."
    },
    "feature_2": {
      "title": "ตรวจสอบและค้นหาลายเซ็น",
      "content": "รับประกันความสมบูรณ์ของเอกสารของคุณโดยการตรวจสอบลายเซ็นได้อย่างง่ายดาย ใช้ฟังก์ชันค้นหาในตัวเพื่อตรวจสอบและจัดการลายเซ็นทั้งหมดในไฟล์ เพื่อให้แน่ใจว่าไม่มีสิ่งใดถูกมองข้าม."
    },
    "feature_3": {
      "title": "อัปเดตลายเซ็นที่มีอยู่",
      "content": "เมื่อใดก็ตามที่ลายเซ็นต้องการการปรับเปลี่ยน ไม่ว่าจะเป็นรูปลักษณ์ ตำแหน่ง หรือเนื้อหา API ของเราทำให้กระบวนการราบรื่นและไม่ยุ่งยาก ช่วยให้คุณสามารถปรับแต่งลายเซ็นได้อย่างรวดเร็ว."
    },
    "feature_4": {
      "title": "ลบลายเซ็นที่ไม่ต้องการ",
      "content": "ไม่ว่าคุณจะต้องลบลายเซ็นที่ล้าสมัยหรือทำความสะอาดเอกสาร {{ProdFullName}} มอบการควบคุมเต็มรูปแบบในการลบลายเซ็น เพื่อให้แน่ใจว่าไฟล์ของคุณยังคงทันสมัยและถูกต้อง."
    }
  },
  "formats": {
    "title": "แก้ไขลายเซ็นในหลายรูปแบบไฟล์",
    "description": "ด้วย API {{EnvName}} เอกสารที่ลงนามสามารถกลับไปตรวจสอบได้ตลอดเวลา ช่วยให้คุณสามารถสกัดและปรับเปลี่ยนคุณสมบัติของลายเซ็นสำหรับรูปแบบธุรกิจยอดนิยม เพื่อให้แน่ใจว่ามีความยืดหยุ่นและการควบคุมอย่างสมบูรณ์."
  },
  "operations": {
    "title": "สำรวจตัวเลือกทางลายเซ็นและฟังก์ชันการทำงาน",
    "description": "เรามีความสามารถทางลายเซ็นที่หลากหลายพร้อมด้วยเครื่องมือปฏิบัติการมากมาย."
  },
  "examples": {
    "comment_1": "เริ่มต้นวัตถุ {{TextSignature}} ด้วยเส้นทางเอกสาร",
    "comment_2": "ทำการค้นหาเพื่อตรวจสอบลายเซ็นข้อความในเอกสาร",
    "comment_3": "แก้ไขข้อความของลายเซ็นแรกที่ถูกระบุ",
    "comment_4": "ตรวจสอบการเปลี่ยนแปลงที่ทำกับลายเซ็น"
  },
  "steps": {
    "title": "แนวทางการปรับเปลี่ยนลายเซ็นข้อความใน {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้ผู้พัฒนาระบบ {{EnvName}} สามารถอัปเดตเนื้อหาของลายเซ็นข้อความที่ฝังไว้ก่อนหน้านี้ในไฟล์ {{FileFormatUp}} ปรับปรุงแอปพลิเคชัน {{EnvName}} ด้วยความสามารถในการแก้ไขที่แข็งแกร่ง.",
      "step_1": "นำเข้าเอกสาร {{FileFormatUp}} ไปยังอินสแตนซ์ {{TextSignature}}.",
      "step_2": "ดึงรายชื่อของลายเซ็นทั้งหมดในเอกสาร.",
      "step_3": "อัปเดตเนื้อหาของลายเซ็นที่ต้องการ.",
      "step_4": "ตรวจสอบผลลัพธ์ของการปรับเปลี่ยน."
    }
  },
  "code_1": {
    "title": "แก้ไขลายเซ็นบาร์โค้ด",
    "content": "ตัวอย่างนี้จะแสดงวิธีการแก้ไขลายเซ็นบาร์โค้ดในเอกสารทางโปรแกรม.",
    "comment_1": "โหลดเอกสารที่มีลายเซ็นบาร์โค้ดรวมอยู่",
    "comment_2": "ระบุทุกรายการลายเซ็นบาร์โค้ดในเอกสาร",
    "comment_3": "เปลี่ยนตำแหน่งของลายเซ็นบาร์โค้ดแรกและบันทึกเอกสาร",
    "comment_4": "ยืนยันการปรับเปลี่ยนลายเซ็นบาร์โค้ดที่สำเร็จ"
  }
}