{
  "head": {
    "title": "แก้ไขลายเซ็น {{FileFormatUp}} ในแอปพลิเคชัน {{ProgLang}}",
    "description": "ใช้ API {{ProgLang}} เพื่อแก้ไขลายเซ็นในเอกสาร {{FileFormatUp}} รวมถึง PDF, ไฟล์ Word, แผ่น Excel, งานนำเสนอ และภาพถ่าย"
  },
  "header": {
    "title": "อัปเดตลายเซ็น {{FileFormatUp}} ได้อย่างง่ายดาย",
    "description": "ควบคุมการแก้ไขลายเซ็นอิเล็กทรอนิกส์ที่หลากหลายในรูปแบบหลัก ๆ เช่น PDF, Word, Excel, งานนำเสนอ และภาพถ่ายด้วยฟีเจอร์ที่ทรงพลังของ {{ProdFullName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "ปลดล็อกความสามารถของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) ไม่เพียงแต่มีฟังก์ชันการลงนามเอกสารที่ทรงพลังเท่านั้น แต่ยังช่วยให้คุณสามารถแก้ไขลายเซ็นที่มีอยู่ได้อย่างง่ายดาย ปรับเปลี่ยนคุณสมบัติของลายเซ็นในรูปแบบที่ใช้กันอย่างแพร่หลายเช่น PDF, Word, Excel และการนำเสนอ PowerPoint โดยใช้ความพยายามน้อยที่สุด"
  },
  "more_features": {
    "title": "การจัดการลายเซ็นอย่างครบถ้วนสำหรับเอกสาร",
    "description": "{{ProdFullName}} ทำให้การทำงานกับเอกสารของคุณเรียบง่ายโดยการเปิดใช้งานการเพิ่ม อัปเดต ค้นหา ตรวจสอบ หรือการลบลายเซ็นในรูปแบบไฟล์หลักทั้งหมด",
    "image_description": "การแก้ไขลายเซ็นขั้นสูง",
    "feature_1": {
      "title": "การลงนามเอกสารที่ยืดหยุ่น",
      "content": "นำเสนอลายเซ็นในรูปแบบที่หลากหลาย เช่น ข้อความ รูปภาพ บาร์โค้ด และตรา ประยุกต์ใช้ในทุกส่วนของเอกสารของคุณ แก้ไขเมตาดาทาในรูปแบบที่ฝังอยู่ เช่น ข้อมูล EXIF ในภาพ และป้องกันเอกสารจากการเปลี่ยนแปลงโดยไม่ได้รับอนุญาตด้วยการใช้ใบรับรองดิจิทัล"
    },
    "feature_2": {
      "title": "การค้นหาและการตรวจสอบลายเซ็น",
      "content": "ตรวจสอบลายเซ็นได้อย่างง่ายดายด้วยเครื่องมือที่ทรงพลังของเรา ค้นหารายการลายเซ็นทั้งหมดในเอกสารเพื่อให้การตรวจสอบรวดเร็วและแม่นยำ"
    },
    "feature_3": {
      "title": "การอัปเดตลายเซ็นที่ถูกทำให้เรียบง่าย",
      "content": "อัปเดตลายเซ็นที่ได้ฝังไว้อย่างง่ายดาย ปรับเนื้อหา สไตล์ ตำแหน่ง หรือสิ่งอื่นใดของลายเซ็นเพื่อตอบสนองความต้องการใหม่"
    },
    "feature_4": {
      "title": "การลบลายเซ็นอย่างง่ายดาย",
      "content": "ควบคุมการจัดการลายเซ็นได้อย่างเต็มที่ โดยสามารถลบลายเซ็นประเภทใดก็ได้จากเอกสารของคุณ ทำให้คุณมีความยืดหยุ่นในการจัดการเนื้อหาของเอกสาร"
    }
  },
  "formats": {
    "title": "แก้ไขลายเซ็นในหลายรูปแบบ",
    "description": "ด้วย API {{EnvName}} คุณสามารถแก้ไขเอกสารที่มีลายเซ็นได้อย่างง่ายดาย สกัดและอัปเดตข้อมูลลายเซ็นจากรูปแบบที่รองรับ โดยรักษาความสมบูรณ์ของเอกสารของคุณเป็นสำคัญ"
  },
  "operations": {
    "title": "สำรวจฟีเจอร์ทั้งหมด",
    "description": "เรียกดูรายการรูปแบบลายเซ็นและการดำเนินการที่รองรับโดยแพลตฟอร์มของเรา"
  },
  "examples": {
    "comment_1": "สร้างวัตถุ {{TextSignature}} พร้อมกับเส้นทางเอกสาร",
    "comment_2": "ค้นหาลายเซ็นข้อความในเอกสาร",
    "comment_3": "อัปเดตเนื้อหาของลายเซ็นที่พบเป็นลำดับแรก",
    "comment_4": "ตรวจสอบผลลัพธ์ของการอัปเดตลายเซ็น"
  },
  "steps": {
    "title": "วิธีแก้ไขลายเซ็นใน {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้นักพัฒนา {{EnvName}} แก้ไขลายเซ็นข้อความที่ฝังอยู่ในไฟล์ {{FileFormatUp}} เสริมฟังก์ชันการทำงานให้อย่างทรงพลัง",
      "step_1": "โหลดเอกสาร {{FileFormatUp}} ไปยังอินสแตนซ์ {{TextSignature}}",
      "step_2": "ดึงรายการลายเซ็นทั้งหมดในเอกสาร",
      "step_3": "แก้ไขเนื้อหาของลายเซ็นที่พบ",
      "step_4": "ตรวจสอบผลลัพธ์ของการปรับเปลี่ยนลายเซ็น"
    }
  },
  "code_1": {
    "title": "แก้ไขลายเซ็นบาร์โค้ด",
    "content": "ตัวอย่างนี้แสดงให้เห็นถึงวิธีการแก้ไขลายเซ็นบาร์โค้ดในเอกสารโดยโปรแกรม",
    "comment_1": "โหลดเอกสารที่มีลายเซ็นบาร์โค้ด",
    "comment_2": "ค้นหาลายเซ็นบาร์โค้ดทั้งหมดที่มีอยู่",
    "comment_3": "เปลี่ยนตำแหน่งของลายเซ็นบาร์โค้ดที่พบเป็นลำดับแรกและบันทึกเอกสาร",
    "comment_4": "ตรวจสอบว่าการปรับเปลี่ยนบาร์โค้ดประสบความสำเร็จ"
  }
}