{
  "head": {
    "title": "Добавьте текстовые подписи к {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "Используйте API {{ProgLang}} для бесшовной интеграции текстовых подписей в документы {{FileFormatUp}}. Наш API поддерживает широкий спектр форматов, включая PDF, Word, Excel, Презентации, Изображения и ZIP файлы."
  },
  "header": {
    "title": "Добавьте текстовые подписи к {{FileFormatUp}}",
    "description": "Внедрите персонализированные текстовые подписи в ваши деловые документы с помощью {{ProdFullName}}. Возьмите под контроль свои рабочие процессы документов, улучшив их с помощью безопасных и настраиваемых опций подписей.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Начать бесплатную пробную версию"
  },
  "about": {
    "title": "Представляем {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) — это инновационное решение, разработанное для упрощения добавления текстовых подписей в документы. Настраивайте и размещайте подписи на любой странице, повышая эффективность обработки документов. Оптимизируйте рабочие процессы вашей организации, интегрируя персонализированные текстовые маркировки, которые повышают как функциональность, так и профессионализм."
  },
  "more_features": {
    "title": "Расширенный контроль текстовых подписей",
    "description": "С помощью {{ProdFullName}} вы можете значительно улучшить управление текстовыми подписями в ключевых форматах документов. Инструмент позволяет настраивать стиль, размещение и содержание подписей, обеспечивая компаниям возможность адаптации своих процессов документации.",
    "image_description": "Основные функции {{ProdShortName}}",
    "feature_1": {
      "title": "Динамические документные подписи",
      "content": "Вставляйте различные типы подписей — такие как текст, изображения, штрих-коды, QR-коды или печати — на любую страницу поддерживаемых документов. Встраивайте метаданные, чтобы передавать скрытую информацию или применяйте цифровые сертификаты для повышения уровня безопасности."
    },
    "feature_2": {
      "title": "Поиск и проверка подписей",
      "content": "Проверяйте подлинность подписей, встроенных в ваши документы. Выполняйте эффективный поиск, чтобы находить все экземпляры подписей, обеспечивая тщательный контроль и управление документами."
    },
    "feature_3": {
      "title": "Редактирование или удаление подписей",
      "content": "При необходимости изменяйте или удаляйте ранее добавленные подписи. Вы можете настраивать внешний вид, положение или содержание любой подписи в соответствии с изменяющимися требованиями, обеспечивая гибкость в обработке документов."
    },
    "feature_4": {
      "title": "Настройка встроенных подписей",
      "content": "Для определенных типов файлов настраивайте размещение подписи с помощью встроенных функций документа, таких как добавление водяных знаков в файлы Word или индивидуальных печатей в PDF, увеличивая уникальность ваших документов."
    }
  },
  "formats": {
    "title": "Применение текстовых подписей в различных форматах",
    "description": "Используйте возможности API {{EnvName}} для интеграции текстовых подписей в широкий спектр форматов Office. Контролируйте поток информации на каждом этапе жизненного цикла вашего документа, добавляя высоконастраиваемые текстовые маркировки."
  },
  "operations": {
    "title": "Всеобъемлющие функции управления подписями",
    "description": "Наша платформа предлагает полный набор операций CRUD и продвинутые функции для управления семью различными типами подписей, позволяя вам точно и эффективно управлять подписями документов."
  },
  "examples": {
    "comment_1": "Инициализируйте класс {{TextSignature}} с путем к документу",
    "comment_2": "Создайте {{TextSignOptions}} с необходимым текстом подписи",
    "comment_3": "Настройте цвет и свойства шрифта текста",
    "comment_4": "Добавьте текстовую подпись в документ"
  },
  "steps": {
    "title": "Руководство по созданию текстовых подписей для {{FileFormatUp}} с использованием {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) позволяет добавлять текстовые подписи к документам {{FileFormatUp}} в приложениях {{EnvName}}. Быстро улучшайте возможности вашего продукта с помощью наших надежных решений.",
      "step_1": "Предоставьте документ {{FileFormatUp}} в качестве аргумента классу {{TextSignature}}.",
      "step_2": "Создайте экземпляр {{TextSignOptions}} с необходимым текстом.",
      "step_3": "Настройте визуальные свойства текстовой подписи.",
      "step_4": "Добавьте текстовую подпись на желаемую страницу(ы) документа."
    }
  },
  "code_1": {
    "title": "Реализация текстовых подписей в документах",
    "content": "Узнайте, как встроить текстовые подписи в деловые документы для оптимизации процессов.",
    "comment_1": "Выберите документ для подписи",
    "comment_2": "Определите текстовые параметры с заданным содержимым",
    "comment_3": "Установите размер и положение подписи на странице",
    "comment_4": "Примените отступ для подписи от краев страницы",
    "comment_5": "Настройте цвет текста и стиль шрифта",
    "comment_6": "Добавьте обводку к текстовой подписи, если необходимо",
    "comment_7": "Настройте фон подписи",
    "comment_8": "При необходимости сохраните текст как изображение для совместимости",
    "comment_9": "Сохраните документ с добавленной текстовой подписью"
  }
}