{
  "head": {
    "title": "Створіть текстові підписи для {{FileFormatUp}} за допомогою додатків {{ProgLang}}",
    "description": "Скористайтеся потужністю API {{ProgLang}}, щоб вставити текстові підписи у файли {{FileFormatUp}}, підтримуючи широкий спектр форматів, включаючи PDF, Word, Excel, Презентації, Зображення та ZIP."
  },
  "header": {
    "title": "Безперешкодно вставляйте текстові підписи у {{FileFormatUp}}",
    "description": "Інтегруйте власні текстові підписи у свої бізнес-документи за допомогою {{ProdFullName}}. Оптимізуйте організаційні процеси завдяки багатофункціональним можливостям налаштування підписів.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Спробуйте безкоштовно сьогодні"
  },
  "about": {
    "title": "Відкрийте для себе рішення {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує складну платформу для вставки високоіндивідуалізованих текстових підписів, оптимізуючи ваші документообіги. Налаштуйте вміст і візуальні атрибути текстових підписів, без проблем застосовуючи їх на всіх сторінках для покращення управління документами та підвищення ефективності роботи."
  },
  "more_features": {
    "title": "Комплексне управління текстовими підписами",
    "description": "{{ProdFullName}} надає вашій організації можливість покращувати документообіги завдяки додаванню налаштованих текстових підписів у популярні формати файлів. Легко керуйте виглядом, розташуванням та вмістом цих підписів відповідно до ваших специфічних потреб.",
    "image_description": "Досліджуйте функції {{ProdShortName}}",
    "feature_1": {
      "title": "Різноманітні підписи для документів",
      "content": "Застосовуйте різноманітні підписи — текстові, зображення, штрих-коди, QR-коди та печатки — на будь-якій сторінці підтримуваних документів. Використовуйте метадані для вставки прихованого вмісту, захищаючи конфіденційну інформацію за допомогою цифрових сертифікатів."
    },
    "feature_2": {
      "title": "Пошук та підтвердження підписів",
      "content": "Забезпечте дійсність і цілісність своїх підписаних документів, використовуючи наші надійні інструменти перевірки підписів. Проводьте пошук, щоб отримати комплексний список усіх підписів у документі для подальшого аналізу."
    },
    "feature_3": {
      "title": "Оновлення або видалення підписів",
      "content": "Легко змініть вміст, візуальні властивості чи розташування раніше вставлених підписів. При необхідності видаляйте непотрібні підписи, щоб підтримувати точність та актуальність вмісту документа."
    },
    "feature_4": {
      "title": "Спеціалізовані текстові підписи",
      "content": "Реалізуйте специфічні для документів текстові підписи, такі як водяні знаки для документів Word або наліпки для PDF, щоб надати додатковий рівень індивідуалізації та контролю."
    }
  },
  "formats": {
    "title": "Вставляйте текстові підписи в різноманітні формати файлів",
    "description": "З API {{EnvName}} ви зможете вставити текстові підписи в широкий спектр Office документів. Повністю контролюйте життєвий цикл ваших документів, додаючи текстові підписи, які підвищують функціональність та безпеку."
  },
  "operations": {
    "title": "Розширені функції та опції підписів",
    "description": "Наш API підтримує повне управління життєвим циклом семи типів підписів, пропонуючи комплексні можливості CRUD для управління, перевірки та налаштування ваших підписів."
  },
  "examples": {
    "comment_1": "Ініціалізуйте {{TextSignature}} із шляхом до документа",
    "comment_2": "Створіть екземпляр {{TextSignOptions}} з бажаним текстом підпису",
    "comment_3": "Налаштуйте кольори тексту та атрибути шрифту",
    "comment_4": "Інтегруйте текстовий підпис у документ"
  },
  "steps": {
    "title": "Як створити та додати текстові підписи до {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) полегшує внесення текстових підписів у файли {{FileFormatUp}} в додатках {{EnvName}}. Швидко підвищте можливості вашого продукту за допомогою наших комплексних рішень.",
      "step_1": "Передайте документ {{FileFormatUp}} як параметр в конструктор класу {{TextSignature}}.",
      "step_2": "Створіть {{TextSignOptions}} з необхідним текстом підпису.",
      "step_3": "Визначте візуальні атрибути для підпису.",
      "step_4": "Вставте текстовий підпис на будь-які вказані сторінки документа."
    }
  },
  "code_1": {
    "title": "Вставити текстові підписи в документи",
    "content": "Досліджуйте, як інтегрувати текстові підписи в бізнес-документи для оптимізації процесів.",
    "comment_1": "Виберіть документ, який потрібно підписати",
    "comment_2": "Сформуйте текстові параметри з вказаним вмістом",
    "comment_3": "Визначте розміри та позицію підпису на сторінці",
    "comment_4": "Встановіть відступ від країв сторінки для підписів",
    "comment_5": "Налаштуйте колір тексту та стиль шрифту",
    "comment_6": "Додайте рамку навколо текстового підпису",
    "comment_7": "Застосуйте налаштування фону, якщо необхідно",
    "comment_8": "За бажанням збережіть текст як зображення для забезпечення сумісності",
    "comment_9": "Збережіть документ з інтегрованим текстовим підписом"
  }
}