{
  "head": {
    "title": "Создайте текстовые подписи для {{FileFormatUp}} с помощью приложений {{ProgLang}}",
    "description": "Используйте возможности API {{ProgLang}}, чтобы встроить текстовые подписи в файлы {{FileFormatUp}}, поддерживающие широкий спектр форматов, включая PDF, Word, Excel, презентации, изображения и ZIP."
  },
  "header": {
    "title": "Бесшовно встраивайте текстовые подписи в {{FileFormatUp}}",
    "description": "Интегрируйте настраиваемые текстовые подписи в ваши бизнес-документы с помощью {{ProdFullName}}. Оптимизируйте организационные процессы с помощью универсальных возможностей настройки подписей.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Попробуйте бесплатно сегодня"
  },
  "about": {
    "title": "Откройте для себя решение {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предоставляет сложную платформу для встраивания высоконастраиваемых текстовых подписей, упрощающих ваши рабочие процессы с документами. Настраивайте содержимое и визуальные характеристики текстовых подписей, применяя их без швов по страницам для повышения эффективности управления документами."
  },
  "more_features": {
    "title": "Комплексное управление текстовыми подписями",
    "description": "{{ProdFullName}} усиливает вашу организацию, улучшая рабочие процессы с документами через добавление настраиваемых текстовых подписей в популярных форматах файлов. Управляйте внешним видом, позиционированием и содержанием этих подписей в соответствии с вашими конкретными требованиями.",
    "image_description": "Изучите возможности {{ProdShortName}}",
    "feature_1": {
      "title": "Универсальные подписи для документов",
      "content": "Наносите разнообразные подписи, включая текст, изображения, штрих-коды, QR-коды и печати, на любую страницу поддерживаемых документов. Используйте метаданные для встраивания скрытого содержимого, одновременно защищая конфиденциальную информацию с помощью цифровых сертификатов."
    },
    "feature_2": {
      "title": "Поиск и аутентификация подписей",
      "content": "Обеспечьте действительность и целостность подписанных документов с помощью наших надежных инструментов проверки подписей. Проводите поиск, чтобы получить полный список всех подписей в документе для дальнейшего анализа."
    },
    "feature_3": {
      "title": "Обновление или удаление подписей",
      "content": "Легко изменяйте содержимое, визуальные свойства или позиционирование ранее встроенных подписей. При необходимости удаляйте ненужные подписи, чтобы поддерживать точность и актуальность содержимого документа."
    },
    "feature_4": {
      "title": "Специфические текстовые подписи",
      "content": "Реализуйте текстовые подписи, специфичные для документов, такие как водяные знаки для документов Word или наклейки для PDF, чтобы обеспечить дополнительный уровень настраиваемости и контроля."
    }
  },
  "formats": {
    "title": "Встраивайте текстовые подписи в различные форматы файлов",
    "description": "С помощью нашего API {{EnvName}} вы можете встроить текстовые подписи в широкий спектр офисных документов. Полностью контролируйте жизненный цикл ваших документов, добавляя текстовые подписи, которые улучшают как функциональность, так и безопасность."
  },
  "operations": {
    "title": "Расширенные функции и варианты подписей",
    "description": "Наш API поддерживает полное управление жизненным циклом семи типов подписей, предлагая полные возможности CRUD для управления, проверки и настройки ваших подписей."
  },
  "examples": {
    "comment_1": "Инициализируйте {{TextSignature}} с путем к документу",
    "comment_2": "Создайте экземпляр {{TextSignOptions}} с желаемым текстом подписи",
    "comment_3": "Настройте цвет текста и атрибуты шрифта",
    "comment_4": "Интегрируйте текстовую подпись в документ"
  },
  "steps": {
    "title": "Как создать и добавить текстовые подписи в {{FileFormatUp}} с использованием {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) упрощает внедрение текстовых подписей в файлы {{FileFormatUp}} в приложениях {{EnvName}}. Быстро улучшайте возможности вашего продукта с нашими комплексными решениями.",
      "step_1": "Передайте документ {{FileFormatUp}} в качестве параметра конструктору класса {{TextSignature}}.",
      "step_2": "Создайте {{TextSignOptions}} с необходимым текстом подписи.",
      "step_3": "Определите визуальные атрибуты для подписи.",
      "step_4": "Встроите текстовую подпись на любые указанные страницы документа."
    }
  },
  "code_1": {
    "title": "Встраивание текстовых подписей в документы",
    "content": "Узнайте, как интегрировать текстовые подписи в бизнес-документы, чтобы упростить процессы.",
    "comment_1": "Выберите документ для подписи",
    "comment_2": "Сформулируйте параметры текста с указанным содержимым",
    "comment_3": "Определите размеры и положение подписи на странице",
    "comment_4": "Реализуйте отступ от краев страницы для подписей",
    "comment_5": "Настройте цвет текста и стиль шрифта",
    "comment_6": "Добавьте рамку вокруг текстовой подписи",
    "comment_7": "При необходимости примените настройку фона",
    "comment_8": "При желании сохраните текст как изображение для обеспечения совместимости",
    "comment_9": "Сохраните документ с интегрированной текстовой подписью"
  }
}