{
  "head": {
    "title": "Додайте текстові підписи до {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Використайте API {{ProgLang}} для безшовної інтеграції текстових підписів у документи {{FileFormatUp}}. Наш API підтримує широкий спектр форматів, включаючи PDF, Word, Excel, Презентації, зображення та ZIP файли."
  },
  "header": {
    "title": "Додайте текстові підписи до {{FileFormatUp}}",
    "description": "Включайте персоналізовані текстові підписи до ваших бізнес-документів за допомогою {{ProdFullName}}. Візьміть під контроль свої документи та вдоскональте їх за допомогою безпечних і налаштованих опцій підписів.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Розпочати безкоштовну пробну версію"
  },
  "about": {
    "title": "Представляємо {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) - це інноваційне рішення, призначене для полегшення додавання текстових підписів до документів. Налаштуйте та розміщуйте підписи на будь-якій сторінці, підвищуючи ефективність роботи з документами. Спрощуйте робочі процеси у вашій організації, інтегруючи персоналізовані текстові позначки, які покращують функціональність і професіоналізм."
  },
  "more_features": {
    "title": "Розширений контроль текстових підписів",
    "description": "З {{ProdFullName}} ви можете значно покращити управління текстовими підписами в ключових форматах документів. Інструмент дозволяє налаштовувати стиль, розташування та вміст підписів, що дає змогу бізнесу адаптувати свої документи.",
    "image_description": "Основні функції {{ProdShortName}}",
    "feature_1": {
      "title": "Динамічні підписи документів",
      "content": "Вставляйте різноманітні типи підписів, такі як текст, зображення, штрих-коди, QR-коди чи штампи, на будь-якій сторінці підтримуваних документів. Вбудовуйте метадані для передачі прихованої інформації або застосовуйте цифрові сертифікати для підвищення рівня безпеки."
    },
    "feature_2": {
      "title": "Перевірка та валідація підписів",
      "content": "Перевіряйте справжність підписів, вмонтованих у ваші документи. Виконуйте ефективні пошуки для знаходження всіх випадків підписів, забезпечуючи ретельне відстеження та управління документами."
    },
    "feature_3": {
      "title": "Редагування або видалення підписів",
      "content": "За необхідності змініть або видаліть підписи, додані раніше. Ви можете налаштувати вигляд, позицію або вміст будь-якого підпису відповідно до змінюваних вимог, забезпечуючи гнучкість у роботі з документами."
    },
    "feature_4": {
      "title": "Нативне налаштування підписів",
      "content": "Для певних типів файлів налаштуйте розташування підпису за допомогою вбудованих функцій документа, таких як додавання водяних знаків до документів Word або індивідуальних штампів до PDF, підвищуючи унікальність ваших документів."
    }
  },
  "formats": {
    "title": "Застосовуйте текстові підписи в різних форматах",
    "description": "Скористайтеся можливостями API {{EnvName}}, щоб інтегрувати текстові підписи в широкий спектр форматів Office. Контролюйте потік інформації на кожному етапі життя документа, додаючи гнучкі текстові позначки."
  },
  "operations": {
    "title": "Комплексні функції управління підписами",
    "description": "Наша платформа пропонує повні CRUD операції та розширені функції для управління сімома різними типами підписів, дозволяючи вам точно та легко керувати підписами у ваших документах."
  },
  "examples": {
    "comment_1": "Ініціалізуйте клас {{TextSignature}} з шляхом до документа",
    "comment_2": "Створіть {{TextSignOptions}} з необхідним текстом підпису",
    "comment_3": "Налаштуйте колір тексту та властивості шрифта",
    "comment_4": "Додайте текстовий підпис до документа"
  },
  "steps": {
    "title": "Посібник із створення текстових підписів для {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) дає змогу додати текстові підписи до документів {{FileFormatUp}} в додатках {{EnvName}}. Швидко розширте можливості вашого продукту за допомогою наших потужних рішень.",
      "step_1": "Надайте документ {{FileFormatUp}} у якості аргументу класу {{TextSignature}}.",
      "step_2": "Інстанціюйте {{TextSignOptions}} з необхідним текстом.",
      "step_3": "Встановіть візуальні властивості текстового підпису.",
      "step_4": "Додайте текстовий підпис на бажані сторінки документа."
    }
  },
  "code_1": {
    "title": "Впроваджуйте текстові підписи в документи",
    "content": "Навчіться, як вбудовувати текстові підписи в бізнес-документи для оптимізації процесів.",
    "comment_1": "Виберіть документ для підписання",
    "comment_2": "Визначте текстові параметри з указаним вмістом",
    "comment_3": "Встановіть розмір і позицію підпису на сторінці",
    "comment_4": "Застосуйте відступ для підпису від країв сторінки",
    "comment_5": "Налаштуйте колір тексту та стиль шрифта",
    "comment_6": "Додайте рамку до текстового підпису, якщо потрібно",
    "comment_7": "Налаштуйте фон підпису",
    "comment_8": "За бажанням, збережіть текст як зображення для сумісності",
    "comment_9": "Збережіть документ з доданим текстовим підписом"
  }
}