{
  "head": {
    "title": "สร้างลายเซ็นข้อความ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ใช้ API {{ProgLang}} เพื่อแทรกลายเซ็นข้อความลงในไฟล์ {{FileFormatUp}} ประมวลผลรูปแบบเอกสารยอดนิยมเช่น PDF, Word, Excel, การนำเสนอ, รูปภาพ และ ZIP อย่างราบรื่น."
  },
  "header": {
    "title": "สร้างลายเซ็นข้อความสำหรับ {{FileFormatUp}}",
    "description": "เพิ่มลายเซ็นข้อความที่กำหนดเองลงในเอกสารธุรกิจของคุณด้วย {{ProdFullName}} ปรับปรุงการจัดการเวิร์กโฟลว์ในองค์กรด้วยตัวเลือกการปรับแต่งลายเซ็น.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "เริ่มใช้งานฟรี"
  },
  "about": {
    "title": "เกี่ยวกับโซลูชัน {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีลายเซ็นข้อความที่ยืดหยุ่นและสามารถปรับแต่งได้เพื่อนำความสะดวกมาให้กับการจัดการเอกสารของคุณ กำหนดเนื้อหาและการออกแบบของลายเซ็นข้อความและใช้มันบนทุกหน้า เพื่อปรับปรุงการเวิร์กโฟลว์เอกสารขององค์กรของคุณ."
  },
  "more_features": {
    "title": "บริหารจัดการลายเซ็นข้อความในเอกสาร",
    "description": "ด้วย {{ProdFullName}} คุณสามารถปรับปรุงเวิร์กโฟลว์ของเอกสารในบริษัทของคุณโดยการเพิ่มลายเซ็นข้อความในรูปแบบไฟล์ยอดนิยม ปรับแต่งรูปลักษณ์และเนื้อหาของลายเซ็นได้อย่างง่ายดาย.",
    "image_description": "คุณสมบัติหลักของ {{ProdShortName}}",
    "feature_1": {
      "title": "ลายเซ็นเอกสาร",
      "content": "สามารถใช้ลายเซ็นข้อความ, รูปภาพ, บาร์โค้ด, รหัส QR หรือประทับตราในหน้าใดก็ได้ของเอกสารที่รองรับ ใช้ข้อมูลเมตาเพื่อฝังเนื้อหาที่ซ่อนอยู่และรักษาความปลอดภัยเอกสารของคุณด้วยใบรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "การค้นหาและการตรวจสอบลายเซ็น",
      "content": "ตรวจสอบความสมบูรณ์ของเอกสารที่ลงนามด้วยเครื่องมือการตรวจสอบลายเซ็นของเรา นอกจากนี้ยังสามารถดึงและค้นหาทุกลายเซ็นที่ฝังอยู่ในเอกสาร."
    },
    "feature_3": {
      "title": "ปรับเปลี่ยนหรือลบลายเซ็น",
      "content": "ปรับเปลี่ยนเนื้อหา ตำแหน่ง และรูปลักษณ์ของลายเซ็นที่เพิ่มเข้ามาก่อนหน้านี้ หรือสามารถลบออกจากเอกสารได้ทั้งหมด."
    },
    "feature_4": {
      "title": "ลายเซ็นข้อความที่เป็นธรรมชาติ",
      "content": "เพิ่มลายเซ็นข้อความเฉพาะเอกสาร เช่น สติ๊กเกอร์ใน PDF หรือลายน้ำในเอกสาร Word เพื่อการปรับแต่งที่เพิ่มขึ้น."
    }
  },
  "formats": {
    "title": "เพิ่มลายเซ็นข้อความในรูปแบบไฟล์ต่าง ๆ",
    "description": "ใช้ API {{EnvName}} เพื่อแทรกลายเซ็นข้อความลงในเอกสาร Office โดยมั่นใจได้ว่าคุณมีการควบคุมเนื้อหาในทุกขั้นตอนของวงจรชีวิตเอกสาร."
  },
  "operations": {
    "title": "คุณสมบัติหลักและตัวเลือกสำหรับลายเซ็น",
    "description": "โซลูชันของเราให้การสนับสนุนการดำเนินการ CRUD เต็มรูปแบบและเพิ่มเติมสำหรับลายเซ็นประเภทต่าง ๆ จำนวนเจ็ดประเภท."
  },
  "examples": {
    "comment_1": "ส่งเส้นทางเอกสารไปยังตัวสร้าง {{TextSignature}}",
    "comment_2": "สร้าง {{TextSignOptions}} ด้วยข้อความลายเซ็น",
    "comment_3": "ตั้งค่าสีและคุณลักษณะของฟอนต์",
    "comment_4": "เพิ่มลายเซ็นข้อความไปยังเอกสาร"
  },
  "steps": {
    "title": "ขั้นตอนการเพิ่มลายเซ็นข้อความใน {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) สามารถรวมเข้ากับแอปพลิเคชัน {{EnvName}} เพื่อเพิ่มลายเซ็นข้อความในเอกสาร {{FileFormatUp}} นักพัฒนาสามารถปรับปรุงฟังก์ชันของผลิตภัณฑ์ของตนได้อย่างรวดเร็วด้วยโซลูชันของเรา.",
      "step_1": "ใช้เอกสาร {{FileFormatUp}} เป็นพารามิเตอร์สำหรับตัวสร้างคลาส {{TextSignature}}.",
      "step_2": "สร้าง {{TextSignOptions}} ด้วยข้อความที่เหมาะสม.",
      "step_3": "กำหนดตัวเลือกด้านสรีรศาสตร์สำหรับลายเซ็น.",
      "step_4": "เพิ่มลายเซ็นข้อความไปยังหน้าใดก็ได้ของเอกสาร."
    }
  },
  "code_1": {
    "title": "ทำเครื่องหมายเอกสารด้วยลายเซ็นข้อความ",
    "content": "เรียนรู้วิธีแนบข้อมูลข้อความลงในเอกสารธุรกิจเพื่อปรับปรุงกระบวนการทางธุรกิจ.",
    "comment_1": "เลือกเอกสารที่ต้องการลงนาม",
    "comment_2": "สร้างตัวเลือกข้อความด้วยข้อความที่ต้องการ",
    "comment_3": "ระบุขนาดและตำแหน่งของลายเซ็นบนหน้า",
    "comment_4": "ลายเซ็นรองรับการตั้งค่าขอบจากมุมของหน้า",
    "comment_5": "สามารถปรับแต่งสีข้อความและรูปแบบฟอนต์ได้",
    "comment_6": "ลายเซ็นข้อความสามารถมีกรอบได้",
    "comment_7": "การปรับแต่งพื้นหลังยังมีให้บริการ",
    "comment_8": "ข้อความสามารถบันทึกเป็นภาพเพื่อความเข้ากันได้",
    "comment_9": "บันทึกเอกสารพร้อมลายเซ็นข้อความที่เพิ่มเข้ามา"
  }
}