{
  "head": {
    "title": "{{FileFormatUp}} เพิ่มลายเซ็นข้อความโดยใช้ {{ProgLang}}",
    "description": "ใช้ API {{ProgLang}} เพื่อฝังลายเซ็นที่ใช้ข้อความในไฟล์ {{FileFormatUp}} รองรับรูปแบบต่างๆ เช่น PDF, Word, Excel, PowerPoint, รูปภาพ และ ZIP."
  },
  "header": {
    "title": "เพิ่มลายเซ็นข้อความใน {{FileFormatUp}}",
    "description": "รวมลายเซ็นข้อความที่กำหนดเองเข้ากับเอกสารของคุณโดยใช้ {{ProdFullName}} ปรับปรุงกระบวนการทำงานของคุณด้วยตัวเลือกการปรับแต่งลายเซ็นที่ยืดหยุ่น",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ลองใช้งานฟรีวันนี้"
  },
  "about": {
    "title": "สำรวจพลังของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มอบแพลตฟอร์มที่ครอบคลุมสำหรับการฝังลายเซ็นข้อความที่ปรับแต่งได้ ช่วยให้การทำงานกับเอกสารราบรื่นยิ่งขึ้น ปรับแต่งเนื้อหาและลักษณะของลายเซ็นในเอกสารเพื่อเพิ่มประสิทธิภาพและปรับปรุงการจัดการเอกสาร"
  },
  "more_features": {
    "title": "การจัดการลายเซ็นข้อความอย่างครบวงจร",
    "description": "{{ProdFullName}} ช่วยให้คุณจัดการกระบวนการทำงานของเอกสารโดยการเพิ่มลายเซ็นข้อความที่กำหนดเองในรูปแบบยอดนิยม ควบคุมรูปลักษณ์ ตำแหน่ง และเนื้อหาของลายเซ็นให้เหมาะกับความต้องการของคุณ",
    "image_description": "ค้นพบคุณสมบัติของ {{ProdShortName}}",
    "feature_1": {
      "title": "ลายเซ็นเอกสารที่ยืดหยุ่น",
      "content": "เพิ่มประเภทลายเซ็นต่างๆ—ข้อความ, รูปภาพ, รหัสบาร์, QR โค้ด และตราประทับ—ในหน้าเอกสารใดก็ได้ ใช้ข้อมูลเมตาเพื่อรวมข้อมูลที่ซ่อนอยู่และรักษาความปลอดภัยไฟล์ของคุณด้วยใบรับรองดิจิทัล"
    },
    "feature_2": {
      "title": "ตรวจสอบและค้นหาลายเซ็น",
      "content": "ใช้เครื่องมือขั้นสูงเพื่อตรวจสอบความถูกต้องของเอกสารที่ลงนาม ค้นหาและวิเคราะห์ลายเซ็นทั้งหมดในไฟล์สำหรับการตรวจสอบเพิ่มเติม"
    },
    "feature_3": {
      "title": "แก้ไขหรือยกเลิกลายเซ็น",
      "content": "ปรับปรุงเนื้อหา ลักษณะ หรือตำแหน่งของลายเซ็นที่มีอยู่ได้อย่างรวดเร็ว ลบลายเซ็นที่ล้าสมัยเพื่อให้เอกสารของคุณทันสมัย"
    },
    "feature_4": {
      "title": "ลายเซ็นข้อความเฉพาะ",
      "content": "ใช้ลายเซ็นข้อความที่เฉพาะเจาะจงต่อเอกสาร เช่น เครื่องหมายพื้นหลังสำหรับไฟล์ Word หรือตราประทับสำหรับ PDF เพื่อเพิ่มระดับการควบคุมและการปรับแต่ง"
    }
  },
  "formats": {
    "title": "ฝังลายเซ็นข้อความในรูปแบบต่างๆ",
    "description": "ด้วย API {{EnvName}} คุณสามารถเพิ่มลายเซ็นข้อความในเอกสาร Office ต่างๆ ให้คุณควบคุมวงจรการใช้งานของเอกสารได้อย่างเต็มที่และปรับปรุงความปลอดภัย"
  },
  "operations": {
    "title": "คุณสมบัติลายเซ็นขั้นสูง",
    "description": "API ของเราสนับสนุนการจัดการวงจรชีวิตลายเซ็นประเภทต่างๆ ได้อย่างครบถ้วน เจ็ดประเภท ช่วยให้คุณสร้าง จัดการ ตรวจสอบ และปรับแต่งลายเซ็นของคุณได้"
  },
  "examples": {
    "comment_1": "เริ่มต้น {{TextSignature}} พร้อมกับเส้นทางเอกสาร",
    "comment_2": "ตั้งค่า {{TextSignOptions}} ด้วยข้อความลายเซ็นที่ต้องการ",
    "comment_3": "เลือกสีและฟอนต์สำหรับลายเซ็น",
    "comment_4": "นำลายเซ็นข้อความไปใช้ในเอกสาร"
  },
  "steps": {
    "title": "วิธีสร้างลายเซ็นข้อความใน {{FileFormatUp}} ด้วย {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ช่วยให้การรวมลายเซ็นข้อความในไฟล์ {{FileFormatUp}} ภายในแอปพลิเคชัน {{EnvName}} เป็นเรื่องง่าย เพิ่มฟังก์ชันการทำงานให้กับผลิตภัณฑ์ของคุณอย่างรวดเร็วด้วยโซลูชันนี้",
      "step_1": "ให้เอกสาร {{FileFormatUp}} กับตัวสร้าง {{TextSignature}}",
      "step_2": "สร้าง {{TextSignOptions}} พร้อมข้อความลายเซ็นของคุณ",
      "step_3": "กำหนดคุณสมบัติการแสดงผลของลายเซ็น",
      "step_4": "แทรกลายเซ็นลงในหน้าเอกสารที่ต้องการ"
    }
  },
  "code_1": {
    "title": "เพิ่มลายเซ็นข้อความในเอกสาร",
    "content": "เรียนรู้วิธีฝังลายเซ็นข้อความลงในเอกสารเพื่อปรับปรุงกระบวนการของคุณ",
    "comment_1": "เลือกเอกสารที่ต้องการเซ็น",
    "comment_2": "ตั้งค่าตัวเลือกข้อความด้วยเนื้อหาที่ต้องการ",
    "comment_3": "กำหนดขนาดและตำแหน่งของลายเซ็น",
    "comment_4": "ตั้งค่าระยะห่างจากขอบหน้า",
    "comment_5": "เลือกสีและสไตล์ฟอนต์ของข้อความ",
    "comment_6": "เพิ่มกรอบรอบลายเซ็นข้อความ",
    "comment_7": "ปรับแต่งพื้นหลังหากจำเป็น",
    "comment_8": "อาจบันทึกลายเซ็นเป็นรูปภาพเพื่อความเข้ากันได้",
    "comment_9": "บันทึกเอกสารพร้อมลายเซ็นที่ฝังอยู่"
  }
}