{
  "head": {
    "title": "Add Metadata to {{FileFormatUp}} Files in {{ProgLang}} Applications",
    "description": "{{ProgLang}} metadata processing API to add metadata information to {{FileFormatUp}} files. Work with metadata standards XMP, EXIF, IPTC, ID3 etc."
  },
  "header": {
    "title": "Adding Metadata To {{FileFormatUp}} In {{ProgLang}}",
    "description": "Add custom metadata properties to a wide range of business documents, images, audio & video file formats using {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Download Free Trial"
  },
  "about": {
    "title": "About {{ProdFullName}} API",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) is an advanced metadata fields management and manipulation solution to easily view, update, remove, find, compare, exchange and export metadata information from images and document formats without using any external software. Add metadata details to Word documents, Excel spreadsheets, PowerPoint presentations, Outlook emails, OneNote, Visio, Project, PDF, AutoCAD, ZIp, Audio and Video file formats along with the support for working with many other metadata processing features."
  },
  "operations": {
    "title": "Additional Features",
    "description": "{{ProdFullName}} offers numerous methods to safeguard your documents. Explore the full range of features available."
  },
  "formats": {
    "title": "Adding Metadata Properties To Other File Formats",
    "description": "Multi format documents and images metadata addition API for {{EnvName}}. Retrieve metadata of some of the popular file formats as stated below."
  },
  "examples": {
    "comment_1": "Instantiate a {{TextSignature}} with the document",
    "comment_2": "Create {{TextVerifyOptions}} to validate signatures containing specific text",
    "comment_3": "Verify the signatures in the document",
    "comment_4": "Process the verification results"
  },
  "steps": {
    "title": "Steps for Verifying Signatures in {{FileFormatUp}} using {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) can verify the presence of specific signatures in a {{FileFormatUp}} document. {{EnvName}} developers can easily empower their applications by adding features provided by our solution.",
      "step_1": "Load the {{FileFormatUp}} file into the {{TextSignature}} instance.",
      "step_2": "Instantiate and configure {{TextVerifyOptions}} to achieve the desired result.",
      "step_3": "Initiate the verification process.",
      "step_4": "Review the verification results."
    }
  },
  "more_features": {
    "title": "Document Metadata Management",
    "description": "Our comprehensive API streamlines managing document metadata. Access, edit, and manipulate various document properties for improved organization and searchability.",
    "image_description": "Metadata Functionality",
    "feature_1": {
      "title": "Metadata Access",
      "content": "Effortlessly retrieve and process a document's metadata. Gain insights into properties like author, creation date, and many others."
    },
    "feature_2": {
      "title": "Metadata Editing",
      "content": "Modify document metadata directly. Update properties for better organization, searchability, and information accuracy."
    },
    "feature_3": {
      "title": "Advanced Metadata Management",
      "content": "Perform complex operations on document metadata. Efficiently handle tasks like adding custom properties, deleting irrelevant data, and ensuring data consistency."
    },
    "code_1": {
      "title": "Verify Barcode Signatures",
      "content": "This example demonstrates how to verify barcode signatures in a document.",
      "comment_1": "Provide the document that contains barcode signatures",
      "comment_2": "Configure options to verify barcodes against specific text",
      "comment_3": "Verify the signatures that were applied to the document",
      "comment_4": "Display the results of the verification"
    }
  }
}