{
  "head": {
    "title": "การตรวจสอบลายเซ็นดิจิทัล {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ใช้ประโยชน์จาก {{ProdFullName}} ที่ทรงพลังในการรับรองลายเซ็นที่ฝังอยู่ในไฟล์ {{FileFormatUp}} ยืนยันความถูกต้องของลายเซ็นทั่วทั้ง PDF, Word, Excel, งานนำเสนอ, รูปภาพ และ ZIP"
  },
  "header": {
    "title": "การตรวจสอบลายเซ็นดิจิทัล {{FileFormatUp}}",
    "description": "ตรวจสอบลายเซ็นอิเล็กทรอนิกส์ทุกรูปแบบที่รองรับได้อย่างมีประสิทธิภาพในหลายรูปแบบ เช่น PDF, Word, Excel, งานนำเสนอ, รูปภาพ หรือไฟล์ ZIP ด้วยฟีเจอร์ที่ครอบคลุมของ {{ProdFullName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดเวอร์ชันทดลอง"
  },
  "about": {
    "title": "แอปพลิเคชันหลักของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) รองรับความสามารถในการจัดการลายเซ็นเอกสารแบบ CRUD อย่างครบถ้วน คุณสามารถลงลายเซ็นในรูปแบบต่างๆ กว่า 60 รูปแบบ รวมถึง PDFs, ไฟล์ MS Office, รูปภาพ และ ZIP archives โดยใช้ประเภทลายเซ็นหลากหลาย เช่น ข้อความ, รูปภาพ, บาร์โค้ด, ใบรับรองดิจิทัล, เมตาดาต้า และแสตมป์ นอกเหนือจากการลงลายเซ็น ยังช่วยให้คุณค้นหา ยืนยัน อัปเดต หรือเอาลายเซ็นออกได้"
  },
  "more_features": {
    "title": "การลงลายเซ็นเอกสารขั้นสูง",
    "description": "{{ProdShortName}} เป็นโซลูชันที่ครอบคลุมที่ออกแบบมาเพื่อลดความยุ่งยากในการลงลายเซ็นและการรับรองเอกสารในรูปแบบที่ใช้กันอย่างแพร่หลาย มันเสนอประเภทลายเซ็น 7 ประเภทและการดำเนินการ CRUD แบบเต็มรูปแบบเพื่อให้แน่ใจว่าการปกป้องและการจัดการเนื้อหาเอกสารของคุณอย่างครบถ้วน",
    "image_description": "ฟีเจอร์การตรวจสอบลายเซ็น",
    "feature_1": {
      "title": "ทำให้การลงลายเซ็นเอกสารของบริษัทง่ายขึ้น",
      "content": "ลงลายเซ็นดิจิทัลที่ปรับแต่งได้ในทุกส่วนของเอกสารของคุณได้อย่างราบรื่น ด้วยการสนับสนุนสำหรับลายเซ็นประเภทข้อความ รูปภาพ บาร์โค้ด เมตาดาต้า แสตมป์ และใบรับรองดิจิทัล {{ProdFullName}} ทำให้เอกสารของคุณเป็นไปตามมาตรฐานบริษัท"
    },
    "feature_2": {
      "title": "การจัดการวงจรชีวิตของลายเซ็นแบบเต็ม",
      "content": "จัดการวงจรชีวิตทั้งหมดของลายเซ็นในเอกสารได้อย่างง่ายดาย เข้าถึง ยืนยัน อัปเดต หรือเอาลายเซ็นออกตามต้องการ ทำให้เอกสารของคุณทันสมัยและแม่นยำ"
    },
    "feature_3": {
      "title": "การปกป้องความสมบูรณ์ของเนื้อหาเอกสาร",
      "content": "ปกป้องเอกสารที่ละเอียดอ่อนของคุณโดยการฝังใบรับรองดิจิทัลเพื่อป้องกันการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต นอกจากนี้ยังสามารถเพิ่มเมตาดาต้าที่ซ่อนอยู่เพื่อปกป้องข้อมูลสำคัญและบังคับใช้ความสมบูรณ์ของเนื้อหา"
    },
    "feature_4": {
      "title": "ลายเซ็นที่ปรับแต่งตามเอกสาร",
      "content": "ใช้ประโยชน์จากประเภทลายเซ็นที่เฉพาะเจาะจงกับเอกสาร เช่น แสตมป์ PDF และลายน้ำ Word ลายเซ็นที่ปรับแต่งเหล่านี้เหมาะสำหรับการสร้างแบรนด์ การทำลายน้ำ หรือการปฏิบัติตามข้อกำหนด ทำให้เอกสารของบริษัทของคุณดูเป็นมืออาชีพ"
    }
  },
  "formats": {
    "title": "การตรวจสอบลายเซ็นระหว่างรูปแบบ",
    "description": "{{ProdFullName}} ช่วยให้คุณตรวจสอบลายเซ็นได้อย่างมีประสิทธิภาพในหลากหลายรูปแบบเอกสาร ตั้งค่าพารามิเตอร์การตรวจสอบที่ปรับแต่งได้เพื่อรับประกันความสมบูรณ์และความสอดคล้องของเอกสาร"
  },
  "operations": {
    "title": "การดำเนินการและประเภทลายเซ็นที่ครอบคลุม",
    "description": "สำรวจฟีเจอร์ที่หลากหลายและการดำเนินการในการจัดการลายเซ็นที่มีอยู่กับ {{ProdShortName}} ซึ่งรองรับการควบคุมเต็มรูปแบบในกระบวนการลายเซ็นของเอกสาร"
  },
  "examples": {
    "comment_1": "สร้างอินสแตนซ์ {{TextSignature}} ด้วยเอกสาร",
    "comment_2": "กำหนดค่า {{TextVerifyOptions}} เพื่อรับรองลายเซ็นที่ประกอบด้วยข้อความเฉพาะ",
    "comment_3": "ดำเนินการตรวจสอบลายเซ็นของเอกสาร",
    "comment_4": "วิเคราะห์และตีความผลลัพธ์ของการตรวจสอบ"
  },
  "steps": {
    "title": "คู่มือการตรวจสอบลายเซ็นใน {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) สามารถตรวจสอบการมีอยู่ของลายเซ็นเฉพาะในเอกสาร {{FileFormatUp}} นักพัฒนา {{EnvName}} สามารถปรับปรุงแอปพลิเคชันของตนได้อย่างง่ายดายโดยการรวมฟีเจอร์ที่มีให้โดยโซลูชันของเรา",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} เข้าสู่อินสแตนซ์ {{TextSignature}}",
      "step_2": "สร้างและกำหนดค่า {{VerifyOptions}} เพื่อให้ได้ผลลัพธ์การตรวจสอบที่ต้องการ",
      "step_3": "เริ่มกระบวนการตรวจสอบ",
      "step_4": "ตรวจสอบและตีความผลลัพธ์การตรวจสอบ"
    }
  },
  "code_1": {
    "title": "ตรวจสอบลายเซ็นบาร์โค้ด",
    "content": "ตัวอย่างนี้จะแสดงขั้นตอนการรับรองลายเซ็นบาร์โค้ดภายในเอกสาร",
    "comment_1": "ส่งเอกสารที่มีลายเซ็นบาร์โค้ด",
    "comment_2": "กำหนดค่าตัวเลือกการตรวจสอบเพื่อให้ตรงกับบาร์โค้ดด้วยข้อความเฉพาะ",
    "comment_3": "รับรองลายเซ็นที่ฝังอยู่ในเอกสาร",
    "comment_4": "แสดงผลลัพธ์ของกระบวนการรับรอง"
  }
}