{
  "head": {
    "title": "ตรวจสอบลายเซ็นอิเล็กทรอนิกส์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "{{ProdFullName}} ช่วยให้ตรวจสอบลายเซ็นที่วางในไฟล์ {{FileFormatUp}} เป็นไปได้ ตรวจสอบลายเซ็นในไฟล์ PDF, เอกสาร Word, แผ่น Excel, งานนำเสนอ, รูปภาพ หรือไฟล์ ZIP."
  },
  "header": {
    "title": "การตรวจสอบลายเซ็นอิเล็กทรอนิกส์สำหรับ {{FileFormatUp}}",
    "description": "ตรวจสอบลายเซ็นอิเล็กทรอนิกส์ที่สนับสนุนทั้งหมดในไฟล์ PDF, Word, Excel, งานนำเสนอ, รูปภาพ หรือไฟล์ ZIP ด้วย {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดเวอร์ชันฟรี"
  },
  "about": {
    "title": "การใช้งานของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) รองรับการดำเนินการ CRUD แบบเต็มรูปแบบสำหรับการลงนามในเอกสารและอื่น ๆ รองรับการลงนามในรูปแบบเอกสารมากกว่า 60 รูปแบบ รวมถึง PDF, ไฟล์ MS Office, รูปภาพ และไฟล์ ZIP โดยใช้งานลายเซ็นประเภทข้อความ, รูปภาพ, บาร์โค้ด, ใบรับรองดิจิทัล, เมตาดาต้า และตราประทับ นอกจากนี้ยังมีการดำเนินการเพิ่มเติม เช่น การค้นหา, ตรวจสอบ, แก้ไข หรือการลบลายเซ็นที่เหมาะสม."
  },
  "more_features": {
    "title": "โซลูชันการลงนามในเอกสารแบบครบวงจร",
    "description": "{{ProdShortName}} ช่วยเพิ่มรูปแบบเอกสารสำนักงานยอดนิยมด้วยลายเซ็น 7 ประเภทและการดำเนินการ CRUD แบบเต็มรูปแบบ มอบการปกป้องที่แข็งแกร่งสำหรับเนื้อหาเอกสารของคุณ.",
    "image_description": "การตรวจสอบลายเซ็น",
    "feature_1": {
      "title": "ลงนามในเอกสารของบริษัท",
      "content": "เพิ่มลายเซ็นดิจิทัลที่เป็นมืออาชีพลงในเอกสารใด ๆ โซลูชันของเรารองรับลายเซ็นหลายประเภท รวมถึงข้อความ, รูปภาพ, บาร์โค้ด, เมตาดาต้า, ตราประทับ, และใบรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "การดำเนินการ CRUD ของลายเซ็น",
      "content": "ในหลายกรณีเอกสารที่ลงนามจำเป็นต้องได้รับการประมวลผลเพิ่มเติม คืนค่ารายการของลายเซ็นทั้งหมดในเอกสาร, ตรวจสอบ, แก้ไขคุณสมบัติ หรือเอาออกเมื่อจำเป็น."
    },
    "feature_3": {
      "title": "ปกป้องเนื้อหาเอกสาร",
      "content": "ป้องกันเอกสารของบริษัทด้วยใบรับรองดิจิทัลเพื่อป้องกันการเปลี่ยนแปลงที่ไม่ได้รับอนุญาต ฝังเมตาดาต้าที่ซ่อนอยู่เพื่อปกป้องเนื้อหาเอกสารเพิ่มเติม."
    },
    "feature_4": {
      "title": "ลายเซ็นที่แท้จริง",
      "content": "ใช้ลายเซ็นข้อความที่เฉพาะเจาะจงกับเอกสาร เช่น ตราประทับใน PDF หรือเครื่องหมายลายน้ำใน Word เพื่อสร้างเอกสารที่ปรับแต่งและมืออาชีพเพื่อการใช้ในเชิงพาณิชย์."
    }
  },
  "formats": {
    "title": "การตรวจสอบลายเซ็นในรูปแบบไฟล์ต่าง ๆ",
    "description": "{{ProdFullName}} ทำให้กระบวนการตรวจสอบลายเซ็นทั้งหมดในเอกสารทำได้ง่ายขึ้น กำหนดพารามิเตอร์การตรวจสอบที่กำหนดเองเพื่อให้แน่ใจในความสมบูรณ์ของเอกสารที่ถูกลงนาม."
  },
  "operations": {
    "title": "การดำเนินการและประเภทลายเซ็นที่สนับสนุน",
    "description": "สำรวจคุณสมบัติและการดำเนินการลายเซ็นทั้งหมดที่ได้รับการสนับสนุนโดย {{ProdShortName}}."
  },
  "examples": {
    "comment_1": "สร้าง {{TextSignature}} ด้วยเอกสาร",
    "comment_2": "สร้าง {{TextVerifyOptions}} เพื่อตรวจสอบลายเซ็นที่มีข้อความเฉพาะ",
    "comment_3": "ตรวจสอบลายเซ็นในเอกสาร",
    "comment_4": "ประมวลผลผลลัพธ์การตรวจสอบ"
  },
  "steps": {
    "title": "ขั้นตอนการตรวจสอบลายเซ็นใน {{FileFormatUp}} ด้วย {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) สามารถตรวจสอบการมีอยู่ของลายเซ็นเฉพาะในเอกสาร {{FileFormatUp}} ได้ นักพัฒนา {{EnvName}} สามารถเสริมสร้างแอปพลิเคชันของตนเองโดยการเพิ่มฟีเจอร์ที่โซลูชันของเราเสนอ.",
      "step_1": "โหลดไฟล์ {{FileFormatUp}} ลงในอินสแตนซ์ {{TextSignature}}.",
      "step_2": "สร้างและกำหนดค่า {{VerifyOptions}} เพื่อให้ได้ผลลัพธ์ที่ต้องการ.",
      "step_3": "เริ่มกระบวนการตรวจสอบ.",
      "step_4": "ตรวจสอบผลลัพธ์การตรวจสอบ."
    }
  },
  "code_1": {
    "title": "ตรวจสอบลายเซ็นบาร์โค้ด",
    "content": "ตัวอย่างนี้แสดงวิธีการตรวจสอบลายเซ็นบาร์โค้ดในเอกสาร.",
    "comment_1": "ให้เอกสารที่มีลายเซ็นบาร์โค้ด",
    "comment_2": "กำหนดค่าตัวเลือกเพื่อตรวจสอบบาร์โค้ดตามข้อความเฉพาะ",
    "comment_3": "ตรวจสอบลายเซ็นที่ถูกนำไปใช้กับเอกสาร",
    "comment_4": "แสดงผลลัพธ์การตรวจสอบ"
  }
}