{
  "head": {
    "title": "ตรวจสอบลายเซ็นดิจิทัลใน {{FileFormatUp}} ผ่าน {{ProgLang}}",
    "description": "ด้วย {{ProdFullName}} คุณสามารถตรวจสอบความถูกต้องของลายเซ็นในเอกสาร {{FileFormatUp}} ได้อย่างมีประสิทธิภาพ ตรวจสอบลายเซ็นใน PDF, Word, Excel, งานนำเสนอ, รูปภาพ, ไฟล์ ZIP และอื่นๆ ได้อย่างราบรื่น"
  },
  "header": {
    "title": "ตรวจสอบลายเซ็นดิจิทัลใน {{FileFormatUp}}",
    "description": "มั่นใจในความถูกต้องและความมีอยู่ของลายเซ็นอิเล็กทรอนิกส์ที่รองรับในหลากหลายรูปแบบเอกสาร รวมถึง PDF, Word, Excel, งานนำเสนอ, รูปภาพ และ ZIP โดยใช้ {{ProdFullName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดเวอร์ชันฟรี"
  },
  "about": {
    "title": "การใช้งาน {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มอบการจัดการลายเซ็นเอกสารแบบครบวงจร รวมถึงความสามารถในการลงนามในรูปแบบไฟล์มากกว่า 60 รูปแบบ ด้วยการสนับสนุนข้อความ รูปภาพ บาร์โค้ด ใบรับรองดิจิทัล เมตาดาต้า แสตมป์ และอื่นๆ {{ProdFullName}} ช่วยให้คุณค้นหา ตรวจสอบ อัปเดต หรือเอาลายเซ็นออกได้อย่างง่ายดายในรูปแบบ เช่น PDF, เอกสาร MS Office, รูปภาพ, แฟ้ม ZIP และอื่นๆ"
  },
  "more_features": {
    "title": "เทคโนโลยีการลงนามเอกสารที่ทันสมัย",
    "description": "{{ProdShortName}} ให้โซลูชันแบบครบวงจรสำหรับการตรวจสอบและการจัดการลายเซ็นในรูปแบบเอกสารสำนักงานที่หลากหลาย โดยนำเสนอประเภทลายเซ็นเจ็ดแบบและการดำเนินการ CRUD แบบเต็มรูปแบบ ทำให้การจัดการเอกสารและความปลอดภัยของเนื้อหากลายเป็นเรื่องที่ง่ายดาย",
    "image_description": "ฟีเจอร์การตรวจสอบลายเซ็น",
    "feature_1": {
      "title": "ลงนามเอกสารองค์กรได้อย่างมืออาชีพ",
      "content": "ใช้ลายเซ็นดิจิทัล—ไม่ว่าจะเป็นลายเซ็นแบบข้อความ รูปภาพ บาร์โค้ด เมตาดาต้า แสตมป์ หรือใบรับรองดิจิทัล—ในเอกสารของคุณอย่างปลอดภัยและปรับแต่งตามที่ต้องการ {{ProdFullName}} ช่วยให้การลงนามเอกสารองค์กรเป็นไปอย่างราบรื่นและมีมาตรฐาน"
    },
    "feature_2": {
      "title": "การดำเนินการเกี่ยวกับวงจรชีวิตลายเซ็น",
      "content": "มีความสามารถในการควบคุมลายเซ็นเอกสารอย่างเต็มที่ สามารถแสดงรายชื่อทุกลายเซ็นในไฟล์ ตรวจสอบความถูกต้อง อัปเดตตามความต้องการ หรือเอาออกโดยสิ้นเชิงเมื่อจำเป็น ทำให้มั่นใจในกระบวนการเอกสารที่เหมาะสม"
    },
    "feature_3": {
      "title": "รับประกันความสมบูรณ์ของเอกสาร",
      "content": "ใช้ใบรับรองดิจิทัลเพื่อปกป้องเอกสารของคุณจากการเปลี่ยนแปลงโดยไม่ได้รับอนุญาต ใช้เมตาดาต้าเพื่อรักษาความปลอดภัยและติดตามเนื้อหาเอกสาร ทำให้มั่นใจได้ว่าเนื้อหายังคงไม่ถูกแตะต้องและเป็นความลับ"
    },
    "feature_4": {
      "title": "ลายเซ็นที่ปรับแต่งเอง",
      "content": "เพิ่มลายเซ็นที่ปรับแต่งเอง เช่น สติกเกอร์ใน PDF หรือลายน้ำในเอกสาร Word ตัวเลือกที่ปรับแต่งได้เหล่านี้ช่วยให้การจัดการเอกสารมีความเป็นมืออาชีพและปลอดภัย ซึ่งเหมาะสำหรับสภาพแวดล้อมขององค์กร"
    }
  },
  "formats": {
    "title": "การตรวจสอบลายเซ็นอย่างครอบคลุมในรูปแบบต่างๆ",
    "description": "{{ProdFullName}} ช่วยให้การตรวจสอบลายเซ็นในหลายรูปแบบเอกสารเป็นเรื่องง่าย โดยมีการควบคุมที่แข็งแกร่งสำหรับการตรวจสอบลายเซ็น ปรับแต่งกระบวนการตรวจสอบของคุณและมั่นใจได้ว่าเอกสารถูกลงนามอย่างเหมาะสม"
  },
  "operations": {
    "title": "ฟีเจอร์ที่ครอบคลุมและลายเซ็นที่รองรับ",
    "description": "สำรวจความสามารถขั้นสูงของ {{ProdShortName}} ซึ่งนำเสนอเครื่องมือและการดำเนินการจัดการลายเซ็นที่หลากหลายเพื่อปรับปรุงการทำงานกับเอกสาร"
  },
  "examples": {
    "comment_1": "สร้างอ็อบเจ็กต์ {{TextSignature}} พร้อมเอกสาร",
    "comment_2": "กำหนด {{TextVerifyOptions}} เพื่อยืนยันลายเซ็นที่มีข้อความที่กำหนด",
    "comment_3": "ดำเนินการตรวจสอบลายเซ็นในเอกสาร",
    "comment_4": "ตีความและประเมินผลของการตรวจสอบ"
  },
  "steps": {
    "title": "วิธีการตรวจสอบลายเซ็นใน {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) สามารถยืนยันการมีอยู่ของลายเซ็นที่เฉพาะเจาะจงในเอกสาร {{FileFormatUp}} นักพัฒนาจาก {{EnvName}} สามารถเสริมแอปพลิเคชันของตนได้อย่างไร้รอยต่อโดยการรวมฟีเจอร์การตรวจสอบของเรา",
      "step_1": "โหลดเอกสาร {{FileFormatUp}} ลงในอินสแตนซ์ {{TextSignature}}",
      "step_2": "สร้างและกำหนดค่า {{VerifyOptions}} เพื่อให้ได้ผลลัพธ์การตรวจสอบที่ต้องการ",
      "step_3": "เริ่มกระบวนการตรวจสอบ",
      "step_4": "ตรวจสอบและประเมินผลการตรวจสอบ"
    }
  },
  "code_1": {
    "title": "กระบวนการตรวจสอบลายเซ็นบาร์โค้ด",
    "content": "ตัวอย่างนี้อธิบายวิธีการตรวจสอบลายเซ็นบาร์โค้ดที่ซ่อนอยู่ในเอกสาร",
    "comment_1": "ส่งเอกสารที่มีลายเซ็นบาร์โค้ด",
    "comment_2": "กำหนดค่าพารามิเตอร์เพื่อตรวจสอบบาร์โค้ดกับข้อความที่กำหนด",
    "comment_3": "ตรวจสอบลายเซ็นที่เคยถูกติดไว้ในเอกสาร",
    "comment_4": "ตรวจสอบรายงานการตรวจสอบ"
  }
}