{
  "head": {
    "title": "Пошук електронних підписів для {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Використовуйте API {{ProdFullName}} для пошуку електронних підписів, вбудованих у формати, такі як PDF, Word, Excel, Презентації та Зображення."
  },
  "header": {
    "title": "Пошук цифрових підписів у {{FileFormatUp}}",
    "description": "Витягуйте повний список електронних підписів з різних форматів, включаючи PDF, Word, Excel, Презентації та Зображення, завдяки можливостям {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Завантажте зараз"
  },
  "about": {
    "title": "Розкрийте потенціал {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує розширені можливості для підписання та управління цифровими документами. Підтримується понад 60 форматів файлів, включаючи PDF, документи Office, зображення та ZIP-файли, дозволяючи вам додавати, шукати, перевіряти, змінювати або видаляти підписи, такі як текст, зображення, штрих-коди, QR-коди, цифрові сертифікати та штампи."
  },
  "more_features": {
    "title": "Комплексна платформа для підписання документів",
    "description": "Відчуйте потужне, багатофункціональне рішення для підписання, яке захищає ваші документи декількома типами підписів, охоплюючи різні формати файлів.",
    "image_description": "Пошук та управління підписами",
    "feature_1": {
      "title": "Підписуйте та захищайте бізнес-документи",
      "content": "Додавайте електронні підписи в будь-якому місці документа. {{ProdShortName}} підтримує декілька типів підписів, включаючи текст, зображення, штрих-коди, метадані, штампи та цифрові сертифікати, що забезпечує автентичність та безпеку документа."
    },
    "feature_2": {
      "title": "Комплексне управління підписами",
      "content": "Після підписання документа, використовуйте функцію пошуку, щоб знайти всі вбудовані підписи. Ви можете змінювати або видаляти підписи за потреби, отримуючи повний контроль над цілісністю документа."
    },
    "feature_3": {
      "title": "Забезпечте цілісність документа",
      "content": "Використовуйте розширені інструменти для управління прихованими метаданими у документах. Додавайте або видаляйте метадані, та застосовуйте цифрові сертифікати, щоб захистити ваші документи від несанкціонованих змін, забезпечуючи їх автентичність."
    }
  },
  "formats": {
    "title": "Витягуйте підписи з різних форматів файлів",
    "description": "API {{ProdFullName}} дозволяє вам витягувати та управляти підписами з різноманітних форматів документів. Простий процес отримання вбудованих підписів з основних типів файлів для подальшого аналізу або обробки."
  },
  "operations": {
    "title": "Основні функції",
    "description": "Наш API пропонує значну гнучкість, що дозволяє користувачам підписувати документи та виконувати операції після підписання, такі як пошук, перевірка та редагування підписів."
  },
  "examples": {
    "comment_1": "Ініціалізуйте об'єкт {{TextSignature}} з шляхом до файлу документа",
    "comment_2": "Створіть екземпляр {{TextSearchOptions}} для пошуку на всіх сторінках",
    "comment_3": "Запустіть пошук, щоб знайти будь-які підписи на основі тексту в документі",
    "comment_4": "Складіть список знайдених підписів для детального перегляду"
  },
  "steps": {
    "title": "Як шукати підписи у {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) пропонує потужний механізм для виявлення цифрових підписів у файлах {{FileFormatUp}}. Розробники {{EnvName}} можуть легко покращити свої додатки за цим функціоналом.",
      "step_1": "Вкажіть шлях до файлу {{FileFormatUp}} для пошуку підписів.",
      "step_2": "Використовуйте {{SearchOptions}}, щоб уточнити критерії пошуку.",
      "step_3": "Викликайте метод Search для отримання результатів.",
      "step_4": "Перегляньте список виявлених підписів."
    }
  },
  "code_1": {
    "title": "Пошук підписів зображень",
    "content": "Цей приклад демонструє, як знайти підпис зображення в конкретному документі.",
    "comment_1": "Передайте вихідний документ конструктору",
    "comment_2": "Шукайте будь-які підписи на основі тексту",
    "comment_3": "Відобразіть детальні властивості виявлених підписів"
  }
}