{
  "head": {
    "title": "ค้นหาลายเซ็นอิเล็กทรอนิกส์ในไฟล์ {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ใช้ประโยชน์จากพลังของ API {{ProdFullName}} เพื่อค้นหาและตรวจสอบลายเซ็นอิเล็กทรอนิกส์ในเอกสาร PDF, Word, Excel, งานนำเสนอ และรูปภาพต่างๆ"
  },
  "header": {
    "title": "ค้นหาลายเซ็นอิเล็กทรอนิกส์ใน {{FileFormatUp}}",
    "description": "ค้นพบและดึงข้อมูลรายละเอียดเกี่ยวกับลายเซ็นที่ฝังอยู่ในไฟล์ PDF, Word, Excel, งานนำเสนอ และรูปภาพ โดยใช้เครื่องมือขั้นสูงที่จัดเตรียมโดย {{ProdFullName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "เริ่มต้นใช้งานฟรี"
  },
  "about": {
    "title": "ภาพรวมของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีเฟรมเวิร์กที่แข็งแกร่งสำหรับการจัดการลายเซ็นดิจิทัลในหลากหลายประเภทไฟล์ สนับสนุนมากกว่า 60 รูปแบบ เช่น PDF, เอกสาร Microsoft Office, รูปภาพ และไฟล์ ZIP API นี้ช่วยให้ผู้ใช้สามารถใช้, ค้นหา, ตรวจสอบ, อัปเดต หรือลบประเภทลายเซ็นต่างๆ รวมถึงข้อความ, รูปภาพ, บาร์โค้ด, ใบรับรองดิจิทัล และอื่นๆ"
  },
  "more_features": {
    "title": "โซลูชั่นการจัดการลายเซ็นที่ครบถ้วน",
    "description": "{{ProdFullName}} ให้โซลูชั่นแบบครบวงจรสำหรับการเพิ่ม, แก้ไข, ค้นหา และตรวจสอบลายเซ็นอิเล็กทรอนิกส์ในรูปแบบเอกสารที่เป็นที่นิยม เพิ่มประสิทธิภาพการทำงานของคุณด้วยฟีเจอร์การลงนามเอกสารที่ทันสมัย",
    "image_description": "ฟีเจอร์การตรวจจับลายเซ็น",
    "feature_1": {
      "title": "ลงนามดิจิทัลในไฟล์ธุรกิจ",
      "content": "เพิ่มลายเซ็นอิเล็กทรอนิกส์ เช่น ข้อความ, รูปภาพ, บาร์โค้ด, และใบรับรองดิจิทัลไปยังสถานที่ใดๆ ภายในเอกสารของคุณ {{ProdShortName}} รองรับการลงนามในไฟล์ PDF, Word, Excel, รูปภาพ และอื่นๆ ทำให้การจัดการเอกสารมีความยืดหยุ่น"
    },
    "feature_2": {
      "title": "การจัดการลายเซ็นที่มีประสิทธิภาพ",
      "content": "หลังจากการลงนาม, สามารถค้นหาลายเซ็นที่ฝังอยู่ในเอกสารได้อย่างง่ายดาย API อนุญาตให้มีการค้นหาและดึงลายเซ็น รวมถึงความสามารถในการอัปเดตหรือลบลายเซ็นได้"
    },
    "feature_3": {
      "title": "ความปลอดภัยของเอกสารและการจัดการเมตาดาต้า",
      "content": "รักษาความสมบูรณ์ของเอกสารของคุณโดยการฝังหรือเอาเมตาดาต้าออก ปกป้องไฟล์ของคุณจากการเปลี่ยนแปลงที่ไม่อนุญาตโดยใช้ใบรับรองดิจิทัลเพื่อปิดผนึกและตรวจสอบเนื้อหาเอกสาร"
    }
  },
  "formats": {
    "title": "ค้นหาลายเซ็นในหลายรูปแบบไฟล์",
    "description": "ด้วย API {{ProdFullName}} คุณสามารถค้นหาและดึงลายเซ็นอิเล็กทรอนิกส์จากรูปแบบไฟล์ที่สนับสนุนได้อย่างมีประสิทธิภาพ ช่วยให้การรวมเข้ากับกระบวนการทำงานเอกสารของคุณราบรื่น"
  },
  "operations": {
    "title": "ฟังก์ชันหลัก",
    "description": "API ที่ครอบคลุมของเรานำเสนอการดำเนินการที่หลากหลายซึ่งออกแบบมาเพื่อทำให้การจัดการลายเซ็นในเอกสารเป็นไปอย่างราบรื่น ตั้งแต่การลงนามไปจนถึงการประมวลผลหลังและการตรวจสอบ"
  },
  "examples": {
    "comment_1": "สร้างอ็อบเจ็กต์ {{TextSignature}} โดยใช้พาธของเอกสาร",
    "comment_2": "กำหนดค่า {{TextSearchOptions}} เพื่อรวมทุกหน้า",
    "comment_3": "ทำการค้นหาเพื่อหาลายเซ็นข้อความทั้งหมดในเอกสาร",
    "comment_4": "รวบรวมลายเซ็นที่ค้นพบสำหรับการวิเคราะห์ที่ครบถ้วน"
  },
  "steps": {
    "title": "คู่มือการค้นหาลายเซ็นใน {{FileFormatUp}} ด้วย {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) ให้เครื่องมือที่มีประสิทธิภาพสำหรับการค้นหาลายเซ็นดิจิทัลในไฟล์ {{FileFormatUp}} นักพัฒนาที่ใช้ {{EnvName}} สามารถขยายฟังก์ชันการทำงานของแอปพลิเคชันได้อย่างง่ายดายด้วยโซลูชันของเรา",
      "step_1": "ระบุพาธของไฟล์ {{FileFormatUp}} สำหรับการค้นหาลายเซ็น",
      "step_2": "ใช้ {{SearchOptions}} เพื่อกรองผลลัพธ์การค้นหา",
      "step_3": "เรียกใช้งานเมธอด Search เพื่อตรวจหาลายเซ็น",
      "step_4": "ตรวจสอบรายการลายเซ็นที่ค้นพบ"
    }
  },
  "code_1": {
    "title": "การระบุลายเซ็นภาพ",
    "content": "ตัวอย่างนี้แสดงให้เห็นถึงวิธีการตรวจจับลายเซ็นภาพภายในเอกสารเฉพาะ",
    "comment_1": "กำหนดเอกสารต้นฉบับเป็นพารามิเตอร์ในคอนสตรัคเตอร์",
    "comment_2": "ค้นหาลายเซ็นใดๆ ที่มีประเภทเป็นข้อความ",
    "comment_3": "แสดงผลลัพธ์ด้วยคุณสมบัติที่ครบถ้วนของลายเซ็นที่ตรวจจับได้"
  }
}