{
  "head": {
    "title": "ค้นหาลายเซ็นอิเล็กทรอนิกส์ใน {{FileFormatUp}} ด้วย {{ProgLang}}",
    "description": "ใช้ความสามารถของ API {{ProdFullName}} ในการค้นหาลายเซ็นที่ฝังอยู่ใน PDF, Word, Excel, การนำเสนอ และภาพ"
  },
  "header": {
    "title": "ค้นหาลายเซ็นดิจิทัลใน {{FileFormatUp}}",
    "description": "ดึงข้อมูลลายเซ็นอิเล็กทรอนิกส์ที่ฝังอยู่ในรูปแบบต่าง ๆ เช่น PDF, Word, Excel, การนำเสนอ และภาพโดยใช้ {{ProdFullName}}",
    "subtitle": "{{ProdFullName}}",
    "action_title": "เริ่มดาวน์โหลดฟรีของคุณ"
  },
  "about": {
    "title": "สำรวจความสามารถของ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มอบฟังก์ชันการใช้งานที่ทันสมัยสำหรับการเซ็นเอกสารดิจิทัล โดยรองรับรูปแบบไฟล์มากกว่า 60 รูปแบบ รวมถึง PDF, เอกสาร MS Office, ภาพ และไฟล์ ZIP ช่วยให้คุณเพิ่ม ค้นหา ยืนยัน แก้ไข หรือเอาลายเซ็นที่แตกต่างกัน เช่น ข้อความ รูปภาพ บาร์โค้ด QR โค้ด ใบรับรองดิจิทัล และตราประทับ"
  },
  "more_features": {
    "title": "ระบบนิเวศการเซ็นเอกสารที่สมบูรณ์",
    "description": "ค้นพบโซลูชันการเซ็นเอกสารที่มีฟีเจอร์ครบครัน ซึ่งออกแบบมาเพื่อเพิ่มและปกป้องเอกสารของคุณด้วยประเภทลายเซ็นที่หลากหลายทั่วทั้งรูปแบบต่างๆ",
    "image_description": "การค้นหาและการจัดการลายเซ็น",
    "feature_1": {
      "title": "เซ็นและปกป้องเอกสารทางธุรกิจ",
      "content": "เพิ่มลายเซ็นดิจิทัลไปยังตำแหน่งใดก็ได้ภายในเอกสาร {{ProdShortName}} รองรับลายเซ็นประเภทต่าง ๆ รวมถึง ข้อความ รูปภาพ บาร์โค้ด เมตาดาต้า ตราประทับ และใบรับรองดิจิทัล เพื่อให้แน่ใจว่าเอกสารมีความถูกต้องและเป็นไปตามมาตรฐาน"
    },
    "feature_2": {
      "title": "การจัดการลายเซ็นอย่างสมบูรณ์",
      "content": "หลังจากเซ็นแล้ว ใช้ฟีเจอร์การค้นหาเพื่อนำลายเซ็นที่ฝังอยู่ทั้งหมดกลับมา ปรับเปลี่ยนหรือลบลายเซ็นตามที่ต้องการ ทำให้คุณควบคุมความสมบูรณ์ของเอกสารได้อย่างเต็มที่"
    },
    "feature_3": {
      "title": "รักษาความสมบูรณ์ของเอกสารของคุณ",
      "content": "ใช้เครื่องมือที่ทันสมัยในการจัดการเมตาดาต้าที่ซ่อนอยู่ภายในเอกสาร เพิ่มหรือลบรายการเมตาดาต้า และใช้ใบรับรองดิจิทัลขององค์กรเพื่อป้องกันการแก้ไขที่ไม่ได้รับอนุญาตและรับรองความถูกต้องของเอกสาร"
    }
  },
  "formats": {
    "title": "ดึงลายเซ็นจากรูปแบบไฟล์ที่หลากหลาย",
    "description": "API {{ProdFullName}} ช่วยให้คุณสามารถดึงและจัดการลายเซ็นจากประเภทเอกสารที่หลากหลาย เข้าถึงลายเซ็นที่ฝังอยู่ในรูปแบบไฟล์หลักทั้งหมดเพื่อการวิเคราะห์หรือตรวจสอบต่อได้อย่างง่ายดาย"
  },
  "operations": {
    "title": "ฟังก์ชันการทำงานหลัก",
    "description": "API ของเรามีความยืดหยุ่นสูง ช่วยให้ผู้ใช้สามารถเซ็นเอกสารและดำเนินการหลังเซ็นได้อย่างละเอียด เช่น การค้นหา ยืนยัน และแก้ไขลายเซ็น"
  },
  "examples": {
    "comment_1": "เริ่มต้นด้วยการสร้างอ็อบเจ็กต์ {{TextSignature}} พร้อมกับเส้นทางเอกสารที่กำหนด",
    "comment_2": "สร้างอินสแตนซ์ของ {{TextSearchOptions}} เพื่อรวมทุกหน้า",
    "comment_3": "ดำเนินการค้นหาเพื่อตรวจสอบลายเซ็นที่เป็นข้อความในเอกสาร",
    "comment_4": "รวบรวมรายการลายเซ็นที่ตรวจพบเพื่อการตรวจสอบโดยละเอียด"
  },
  "steps": {
    "title": "วิธีค้นหาลายเซ็น {{FileFormatUp}} ด้วย {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) มีเอ็นจิ้นที่แข็งแกร่งสำหรับการค้นหาลายเซ็นดิจิทัลภายในไฟล์ {{FileFormatUp}} นักพัฒนาที่ใช้ {{EnvName}} สามารถยกระดับแอปพลิเคชันของตนด้วยโซลูชันของเราได้อย่างง่ายดาย",
      "step_1": "ระบุเส้นทางไฟล์ {{FileFormatUp}} สำหรับการค้นหาลายเซ็น",
      "step_2": "ใช้ {{SearchOptions}} เพื่อปรับปรุงเกณฑ์การค้นหา",
      "step_3": "เรียกใช้เมธอด Search เพื่อนำผลลัพธ์กลับมา",
      "step_4": "ประเมินรายการลายเซ็นที่ระบุ"
    }
  },
  "code_1": {
    "title": "ค้นหาลายเซ็นจากภาพ",
    "content": "ตัวอย่างนี้แสดงกระบวนการตรวจจับลายเซ็นจากภาพภายในเอกสารที่กำหนด",
    "comment_1": "จัดเตรียมเอกสารต้นฉบับเป็นอาร์กิวเมนต์ให้กับคอนสตรัคเตอร์",
    "comment_2": "ค้นหาลายเซ็นที่มีประเภทเป็นข้อความ",
    "comment_3": "แสดงผลลัพธ์พร้อมคุณสมบัติของลายเซ็นที่ตรวจพบอย่างละเอียด"
  }
}