{
  "head": {
    "title": "Пошук електронних підписів у {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Використовуйте можливості API {{ProdFullName}} для пошуку підписів, вбудованих у PDF, Word, Excel, презентації та зображення."
  },
  "header": {
    "title": "Пошук цифрових підписів у {{FileFormatUp}}",
    "description": "Безперешкодно витягуйте всебічний список електронних підписів, вбудованих у різних форматах, таких як PDF, Word, Excel, презентації та зображення, підтримувані {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Почати безкоштовне завантаження"
  },
  "about": {
    "title": "Ознайомтеся з можливостями {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) надає передову функціональність для цифрового підписування документів. Завдяки підтримці понад 60 форматів файлів, включаючи PDF, документи MS Office, зображення та ZIP-файли, він дозволяє додавати, шукати, перевіряти, змінювати або видаляти різні підписи, такі як текст, зображення, штрих-коди, QR-коди, цифрові сертифікати та штампи."
  },
  "more_features": {
    "title": "Комплексна екосистема підписання документів",
    "description": "Відкрийте для себе розширене, функціонально насичене рішення для підписання документів, спеціально розроблене для поліпшення та захисту ваших документів за допомогою декількох типів підписів у різних форматах.",
    "image_description": "Пошук та управління підписами",
    "feature_1": {
      "title": "Підписувати та захищати ділові документи",
      "content": "Додавайте цифрові підписи у будь-яке місце документа. {{ProdShortName}} підтримує багато типів підписів, включаючи текст, зображення, штрих-коди, метадані, штампи та цифрові сертифікати, забезпечуючи автентичність та відповідність документів."
    },
    "feature_2": {
      "title": "Комплексне управління підписами",
      "content": "Після підписання використовуйте функцію пошуку для отримання всіх вбудованих підписів. Змініть або видаліть підписи за потреби, надаючи вам повний контроль над цілісністю документа."
    },
    "feature_3": {
      "title": "Забезпечте цілісність вашого документа",
      "content": "Використовуйте розширені інструменти для управління прихованими метаданими, вбудованими в документи. Додавайте або видаляйте записи метаданих та застосовуйте корпоративні цифрові сертифікати для захисту від несанкціонованих змін та забезпечення автентичності документа."
    }
  },
  "formats": {
    "title": "Отримуйте підписи з різних форматів файлів",
    "description": "API {{ProdFullName}} надає можливість витягувати та управляти підписами з широкого спектра типів документів. Легко отримайте вбудовані підписи з усіх основних форматів файлів для подальшого аналізу або обробки."
  },
  "operations": {
    "title": "Основні функціональні можливості",
    "description": "Наш API пропонує значну гнучкість, що дозволяє користувачам підписувати документи та виконувати всеоб'ємні операції після підписання, такі як пошук, перевірка та модифікація підписів."
  },
  "examples": {
    "comment_1": "Ініціалізуйте об'єкт {{TextSignature}} з вказаним шляхом до документа",
    "comment_2": "Створіть екземпляр {{TextSearchOptions}}, щоб охопити всі сторінки",
    "comment_3": "Виконайте пошук, щоб виявити будь-які підписи на основі тексту в документі",
    "comment_4": "Складіть список виявлених підписів для детального аналізу"
  },
  "steps": {
    "title": "Як шукати підписи {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) пропонує потужний механізм для знаходження цифрових підписів у файлах {{FileFormatUp}}. Розробники {{EnvName}} можуть вдосконалити свої застосунки за допомогою нашого рішення.",
      "step_1": "Надайте шлях до файлу {{FileFormatUp}} для пошуку підписів.",
      "step_2": "Використовуйте {{SearchOptions}}, щоб уточнити критерії пошуку.",
      "step_3": "Викличте метод Search для отримання результатів.",
      "step_4": "Оцініть список виявлених підписів."
    }
  },
  "code_1": {
    "title": "Пошук підписів зображень",
    "content": "Цей приклад демонструє процес виявлення підпису зображення в зазначеному документі.",
    "comment_1": "Надайте вихідний документ як аргумент конструкторові",
    "comment_2": "Пошукайте будь-які підписи типу текст",
    "comment_3": "Представте результати з детальними властивостями виявлених підписів"
  }
}