{
  "head": {
    "title": "Search for e-signatures in {{FileFormatUp}} files with {{ProgLang}}",
    "description": "Harness the power of the {{ProdFullName}} API to detect and search for electronic signatures across PDFs, Word documents, Excel spreadsheets, Presentations, and Images."
  },
  "header": {
    "title": "Search for e-signatures in {{FileFormatUp}}",
    "description": "Discover and retrieve detailed information about all embedded signatures in PDFs, Word, Excel, Presentations, and Image files using the advanced tools provided by {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Get started for free"
  },
  "about": {
    "title": "Overview of {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) offers a robust framework for managing digital signatures across a wide spectrum of file types. Supporting over 60 formats such as PDF, Microsoft Office documents, Images, and ZIP files, the API enables users to apply, locate, verify, update, or remove a variety of signature types, including text, images, barcodes, digital certificates, and more."
  },
  "more_features": {
    "title": "Complete signature management solution",
    "description": "{{ProdFullName}} provides an all-in-one solution for adding, modifying, searching, and verifying electronic signatures across popular document formats. Empower your workflows with advanced document signing features.",
    "image_description": "Signature detection features",
    "feature_1": {
      "title": "Digitally sign business files",
      "content": "Add electronic signatures such as text, image, barcode, and digital certificates to any location within your documents. {{ProdShortName}} supports signing in PDFs, Word, Excel, Images, and more, ensuring flexible document management."
    },
    "feature_2": {
      "title": "Efficient signature management",
      "content": "After signing, easily locate all signatures embedded within a document. The API allows for comprehensive searching and retrieval of signatures, as well as the ability to update or remove them."
    },
    "feature_3": {
      "title": "Document security and metadata management",
      "content": "Secure the integrity of your documents by embedding or removing hidden metadata. Protect your files from unauthorized changes by utilizing digital certificates to seal and authenticate document content."
    }
  },
  "formats": {
    "title": "Locate signatures across multiple file types",
    "description": "With {{ProdFullName}} API, you can efficiently search and retrieve electronic signatures from a wide range of supported file formats, facilitating seamless integration into your document workflows."
  },
  "operations": {
    "title": "Key functionalities",
    "description": "Our comprehensive API delivers a range of operations designed to streamline the management of document signatures, from signing to post-processing and verification."
  },
  "examples": {
    "comment_1": "Instantiate a {{TextSignature}} object using the document path",
    "comment_2": "Configure {{TextSearchOptions}} to include every page",
    "comment_3": "Perform a search to locate all text signatures within the document",
    "comment_4": "Aggregate the discovered signatures for comprehensive analysis"
  },
  "steps": {
    "title": "Guide to searching for signatures in {{FileFormatUp}} using {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) provides a powerful tool for locating digital signatures within {{FileFormatUp}} files. {{EnvName}} developers can easily extend their application functionality with our solution.",
      "step_1": "Specify the path of the {{FileFormatUp}} file for signature search.",
      "step_2": "Use {{SearchOptions}} to filter the search results.",
      "step_3": "Execute the Search method to find the signatures.",
      "step_4": "Review the list of discovered signatures."
    }
  },
  "code_1": {
    "title": "Identifying image signatures",
    "content": "This example elucidates how to detect an image signature within a specific document.",
    "comment_1": "Supply the source document as a parameter to the constructor",
    "comment_2": "Search for any signatures that are of the text type",
    "comment_3": "Display the findings with comprehensive properties of the detected signatures"
  }
}