{
  "head": {
    "title": "Search electronic signatures in {{FileFormatUp}} with {{ProgLang}}",
    "description": "Utilize the robust capabilities of the {{ProdFullName}} API to efficiently search and retrieve signatures embedded in {{FileFormatUp}} documents, including PDFs, Word, Excel, Presentations, and Images."
  },
  "header": {
    "title": "Effortlessly search for electronic signatures in {{FileFormatUp}} files",
    "description": "Seamlessly extract a comprehensive list of electronic signatures embedded across various formats like PDFs, Word, Excel, Presentations, and Images, all powered by {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Start your free download"
  },
  "about": {
    "title": "Explore {{ProdFullName}} capabilities",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) delivers cutting-edge functionality for digital document signing. With support for over 60 file formats, including PDFs, MS Office documents, Images, and ZIP files, it allows you to add, search, verify, modify, or remove various signatures, such as text, images, barcodes, QR codes, digital certificates, and stamps."
  },
  "more_features": {
    "title": "Complete document signing ecosystem",
    "description": "Discover an advanced, feature-rich document signing solution, specifically designed to enhance and secure your documents with multiple signature types across various formats.",
    "image_description": "Signature search and management",
    "feature_1": {
      "title": "Sign and secure business documents",
      "content": "Add digital signatures to any position within a document. {{ProdShortName}} supports an array of signature types, including text, images, barcodes, metadata, stamps, and digital certificates, ensuring document authenticity and compliance."
    },
    "feature_2": {
      "title": "Comprehensive signature management",
      "content": "After signing, leverage the search feature to retrieve all embedded signatures. Modify or delete signatures as needed, providing you with complete control over document integrity."
    },
    "feature_3": {
      "title": "Safeguard your document's integrity",
      "content": "Utilize advanced tools to manage hidden metadata embedded within documents. Add or remove metadata entries and apply corporate digital certificates to protect against unauthorized edits and ensure document authenticity."
    }
  },
  "formats": {
    "title": "Retrieve signatures from a variety of file formats",
    "description": "The {{ProdFullName}} API empowers you to extract and manage signatures from a wide array of document types. Effortlessly retrieve embedded signatures from all major file formats for further analysis or processing."
  },
  "operations": {
    "title": "Core functionalities",
    "description": "Our API offers extensive flexibility, enabling users to sign documents and conduct comprehensive post-signing operations, such as searching, verifying, and modifying signatures."
  },
  "examples": {
    "comment_1": "Initialize a {{TextSignature}} object with the specified document path",
    "comment_2": "Create an instance of {{TextSearchOptions}} to encompass all pages",
    "comment_3": "Execute a search to identify any text-based signatures in the document",
    "comment_4": "Compile a list of detected signatures for detailed examination"
  },
  "steps": {
    "title": "Steps for search signatures in {{FileFormatUp}} using {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) offers a robust engine for locating digital signatures within {{FileFormatUp}} files. {{EnvName}} developers can effortlessly enhance their applications with our solution.",
      "step_1": "Supply the {{FileFormatUp}} file path for the signature search.",
      "step_2": "Employ {{TextSearchOptions}} to refine the search criteria.",
      "step_3": "Invoke the Search method to retrieve the results.",
      "step_4": "Assess the list of identified signatures."
    }
  },
  "code_1": {
    "title": "Search image signatures",
    "content": "This example illustrates the process of detecting an image signature within a specified document.",
    "comment_1": "Provide the source document as an argument to the constructor",
    "comment_2": "Search for any signatures of the text type",
    "comment_3": "Present the results with detailed properties of the identified signatures"
  }
}