{
  "head": {
    "title": "Поиск электронных подписей в файлах {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "Используйте мощь API {{ProdFullName}} для обнаружения и поиска электронных подписей в PDF, документах Word, электронных таблицах Excel, презентациях и изображениях."
  },
  "header": {
    "title": "Поиск электронных подписей в {{FileFormatUp}}",
    "description": "Исследуйте и получайте подробную информацию обо всех встроенных подписях в PDF, Word, Excel, презентациях и изображениях с помощью продвинутых инструментов, предоставляемых {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Начать бесплатно"
  },
  "about": {
    "title": "Обзор {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предлагает надежную платформу для управления цифровыми подписями в широком спектре типов файлов. Поддерживая более 60 форматов, таких как PDF, документы Microsoft Office, изображения и ZIP-файлы, этот API позволяет пользователям применять, находить, проверять, обновлять или удалять различные типы подписей, включая текст, изображения, штрих-коды, цифровые сертификаты и многое другое."
  },
  "more_features": {
    "title": "Полное решение для управления подписями",
    "description": "{{ProdFullName}} предоставляет единое решение для добавления, изменения, поиска и проверки электронных подписей в популярных форматах документов. Усовершенствуйте свои рабочие процессы с помощью продвинутых возможностей подписания документов.",
    "image_description": "Функции обнаружения подписей",
    "feature_1": {
      "title": "Цифровая подпись бизнес-файлов",
      "content": "Добавляйте электронные подписи, такие как текст, изображение, штрих-код и цифровые сертификаты, в любое место ваших документов. {{ProdShortName}} поддерживает подписку в PDF, Word, Excel, изображениях и других форматах, обеспечивая гибкое управление документами."
    },
    "feature_2": {
      "title": "Эффективное управление подписями",
      "content": "После подписания легко находите все подписи, встроенные в документ. API позволяет выполнять всесторонний поиск и извлечение подписей, а также обновление или удаление их."
    },
    "feature_3": {
      "title": "Безопасность документов и управление метаданными",
      "content": "Обеспечьте целостность ваших документов, встраивая или удаляя скрытые метаданные. Защитите свои файлы от несанкционированных изменений, используя цифровые сертификаты для герметизации и аутентификации содержимого документов."
    }
  },
  "formats": {
    "title": "Поиск подписей в различных типах файлов",
    "description": "С API {{ProdFullName}} вы можете эффективно искать и извлекать электронные подписи из широкого спектра поддерживаемых форматов файлов, что облегчает интеграцию в ваши документные рабочие процессы."
  },
  "operations": {
    "title": "Ключевые функциональные возможности",
    "description": "Наш обширный API предлагает ряд операций, предназначенных для упрощения управления подписями документов, от подписания до постобработки и проверки."
  },
  "examples": {
    "comment_1": "Создайте объект {{TextSignature}} с помощью пути к документу",
    "comment_2": "Настройте {{TextSearchOptions}}, чтобы включить каждую страницу",
    "comment_3": "Выполните поиск, чтобы найти все текстовые подписи в документе",
    "comment_4": "Соберите найденные подписи для комплексного анализа"
  },
  "steps": {
    "title": "Руководство по поиску подписей в {{FileFormatUp}} с использованием {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) предоставляет мощный инструмент для поиска цифровых подписей в файлах {{FileFormatUp}}. Разработчики {{EnvName}} могут легко расширить функциональность своих приложений с нашим решением.",
      "step_1": "Укажите путь к файлу {{FileFormatUp}} для поиска подписей.",
      "step_2": "Используйте {{SearchOptions}}, чтобы отфильтровать результаты поиска.",
      "step_3": "Выполните метод Search для нахождения подписей.",
      "step_4": "Просмотрите список найденных подписей."
    }
  },
  "code_1": {
    "title": "Идентификация изображений подписей",
    "content": "Этот пример показывает, как обнаружить изображение подписи в конкретном документе.",
    "comment_1": "Передайте исходный документ как параметр в конструктор",
    "comment_2": "Искать любые подписи, которые являются текстовыми",
    "comment_3": "Вывести результаты с полными свойствами обнаруженных подписей"
  }
}