{
  "head": {
    "title": "Поиск электронных подписей для {{FileFormatUp}} с использованием {{ProgLang}}",
    "description": "Используйте API {{ProdFullName}} для поиска электронных подписей, встроенных в такие форматы, как PDFs, Word, Excel, Презентации и Изображения."
  },
  "header": {
    "title": "Поиск цифровых подписей в {{FileFormatUp}}",
    "description": "Извлекайте полный список электронных подписей из различных форматов, включая PDFs, Word, Excel, Презентации и Изображения, с помощью {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Скачать сейчас"
  },
  "about": {
    "title": "Раскройте потенциал {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предлагает продвинутые возможности для подписания и управления цифровыми документами. С поддержкой более 60 форматов файлов, включая PDFs, офисные документы, Изображения и ZIP-файлы, вы можете добавлять, искать, проверять, изменять или удалять подписи, такие как текст, изображения, штрих-коды, QR-коды, цифровые сертификаты и штампы."
  },
  "more_features": {
    "title": "Полноценная платформа для подписания документов",
    "description": "Испытайте мощное решение для подписания с множеством функций, которое обеспечивает безопасность ваших документов с использованием различных типов подписей для различных форматов файлов.",
    "image_description": "Поиск и управление подписями",
    "feature_1": {
      "title": "Подписывайте и защищайте бизнес-документы",
      "content": "Добавляйте электронные подписи в любом месте документа. {{ProdShortName}} поддерживает множество типов подписей, включая текст, изображения, штрих-коды, метаданные, штампы и цифровые сертификаты, обеспечивая аутентичность и безопасность документа."
    },
    "feature_2": {
      "title": "Комплексное управление подписями",
      "content": "После подписания документа используйте функцию поиска для нахождения всех встроенных подписей. Вы можете изменять или удалять подписи по мере необходимости, получая полный контроль над целостностью документа."
    },
    "feature_3": {
      "title": "Обеспечение целостности документа",
      "content": "Используйте продвинутые инструменты для управления скрытыми метаданными внутри документов. Добавляйте или удаляйте метаданные и применяйте цифровые сертификаты, чтобы защитить ваши документы от несанкционированных изменений, обеспечивая их подлинность."
    }
  },
  "formats": {
    "title": "Извлечение подписей из нескольких форматов файлов",
    "description": "API {{ProdFullName}} позволяет извлекать и управлять подписями из широкого спектра форматов документов. Легко извлекайте встроенные подписи из основных типов файлов для последующего анализа или обработки."
  },
  "operations": {
    "title": "Ключевые функции",
    "description": "Наш API предоставляет обширную гибкость, позволяя пользователям подписывать документы и выполнять операции после подписания, такие как поиск, проверка и редактирование подписей."
  },
  "examples": {
    "comment_1": "Инициализируйте объект {{TextSignature}} с путем к файлу документа",
    "comment_2": "Создайте экземпляр {{TextSearchOptions}} для поиска на всех страницах",
    "comment_3": "Запустите поиск, чтобы найти любые текстовые подписи в документе",
    "comment_4": "Составьте список найденных подписей для детального обзора"
  },
  "steps": {
    "title": "Как искать подписи в {{FileFormatUp}} с использованием {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) предоставляет мощный механизм для обнаружения цифровых подписей в файлах {{FileFormatUp}}. Разработчики {{EnvName}} могут легко улучшить свои приложения этой функциональностью.",
      "step_1": "Укажите путь к файлу {{FileFormatUp}} для поиска подписей.",
      "step_2": "Используйте {{SearchOptions}} для уточнения критериев поиска.",
      "step_3": "Вызовите метод Search для извлечения результатов.",
      "step_4": "Просмотрите список выявленных подписей."
    }
  },
  "code_1": {
    "title": "Поиск изображений подписей",
    "content": "Этот пример демонстрирует, как найти изображение подписи в конкретном документе.",
    "comment_1": "Передайте исходный документ в конструктор",
    "comment_2": "Ищите любые текстовые подписи",
    "comment_3": "Отобразите подробные свойства идентифицированных подписей"
  }
}