{
  "head": {
    "title": "Rechercher des signatures électroniques dans des fichiers {{FileFormatUp}} avec {{ProgLang}}",
    "description": "Exploitez la puissance de l'API {{ProdFullName}} pour détecter et rechercher des signatures électroniques dans des PDF, documents Word, feuilles de calcul Excel, présentations et images."
  },
  "header": {
    "title": "Rechercher des signatures électroniques dans {{FileFormatUp}}",
    "description": "Découvrez et récupérez des informations détaillées sur toutes les signatures intégrées dans des fichiers PDF, Word, Excel, présentations et images grâce aux outils avancés fournis par {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Commencer gratuitement"
  },
  "about": {
    "title": "Aperçu de {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) propose un cadre robuste pour la gestion des signatures numériques sur un large éventail de types de fichiers. Supportant plus de 60 formats comme PDF, documents Microsoft Office, images et fichiers ZIP, l'API permet aux utilisateurs d'appliquer, localiser, vérifier, mettre à jour ou supprimer divers types de signatures, y compris des textes, images, codes-barres, certificats numériques, et plus encore."
  },
  "more_features": {
    "title": "Solution complète de gestion des signatures",
    "description": "{{ProdFullName}} offre une solution tout-en-un pour ajouter, modifier, rechercher et vérifier des signatures électroniques sur des formats de documents populaires. Optimisez vos flux de travail avec des fonctionnalités avancées de signature de documents.",
    "image_description": "Fonctionnalités de détection des signatures",
    "feature_1": {
      "title": "Signer numériquement des fichiers professionnels",
      "content": "Ajoutez des signatures électroniques telles que du texte, des images, des codes-barres et des certificats numériques à n'importe quel emplacement de vos documents. {{ProdShortName}} prend en charge la signature dans des PDF, Word, Excel, images, et plus, garantissant une gestion flexible des documents."
    },
    "feature_2": {
      "title": "Gestion efficace des signatures",
      "content": "Après la signature, localisez facilement toutes les signatures intégrées dans un document. L'API permet une recherche et une récupération complètes des signatures, ainsi que la possibilité de les mettre à jour ou de les supprimer."
    },
    "feature_3": {
      "title": "Sécurité des documents et gestion des métadonnées",
      "content": "Préservez l'intégrité de vos documents en intégrant ou en supprimant des métadonnées cachées. Protégez vos fichiers contre les modifications non autorisées en utilisant des certificats numériques pour sceller et authentifier le contenu des documents."
    }
  },
  "formats": {
    "title": "Localiser des signatures à travers plusieurs types de fichiers",
    "description": "Avec l'API {{ProdFullName}}, vous pouvez rechercher et récupérer efficacement des signatures électroniques dans une large gamme de formats de fichiers supportés, facilitant une intégration transparente dans vos flux de travail documentaires."
  },
  "operations": {
    "title": "Fonctionnalités clés",
    "description": "Notre API complète propose une gamme d'opérations conçues pour rationaliser la gestion des signatures de documents, de la signature à l'après-traitement et à la vérification."
  },
  "examples": {
    "comment_1": "Instanciez un objet {{TextSignature}} en utilisant le chemin du document",
    "comment_2": "Configurez {{TextSearchOptions}} pour inclure chaque page",
    "comment_3": "Effectuez une recherche pour localiser toutes les signatures textuelles dans le document",
    "comment_4": "Regroupez les signatures découvertes pour une analyse complète"
  },
  "steps": {
    "title": "Guide pour rechercher des signatures dans {{FileFormatUp}} en utilisant {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) fournit un outil puissant pour localiser des signatures numériques dans des fichiers {{FileFormatUp}}. Les développeurs {{EnvName}} peuvent facilement étendre les fonctionnalités de leur application avec notre solution.",
      "step_1": "Spécifiez le chemin du fichier {{FileFormatUp}} pour la recherche de signatures.",
      "step_2": "Utilisez {{SearchOptions}} pour filtrer les résultats de recherche.",
      "step_3": "Exécutez la méthode Search pour trouver les signatures.",
      "step_4": "Examinez la liste des signatures découvertes."
    }
  },
  "code_1": {
    "title": "Identifier des signatures d'image",
    "content": "Cet exemple illustre comment détecter une signature d'image dans un document spécifique.",
    "comment_1": "Fournissez le document source comme paramètre au constructeur",
    "comment_2": "Cherchez toutes les signatures de type texte",
    "comment_3": "Affichez les résultats avec les propriétés complètes des signatures détectées"
  }
}