{
  "head": {
    "title": "Пошук електронних підписів у файлах {{FileFormatUp}} за допомогою {{ProgLang}}",
    "description": "Скористайтеся потужністю API {{ProdFullName}} для виявлення та пошуку електронних підписів у PDF, документах Word, електронних таблицях Excel, презентаціях та зображеннях."
  },
  "header": {
    "title": "Пошук електронних підписів у {{FileFormatUp}}",
    "description": "Відкрийте для себе та отримайте детальну інформацію про всі вбудовані підписи у PDF, Word, Excel, презентаціях та зображеннях, використовуючи розширені інструменти, надані {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Розпочати безкоштовно"
  },
  "about": {
    "title": "Огляд {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) пропонує надійну платформу для управління цифровими підписами у широкому спектрі форматів файлів. Підтримуючи більше 60 форматів, таких як PDF, документи Microsoft Office, зображення та ZIP-файли, API дозволяє користувачам застосовувати, знаходити, перевіряти, оновлювати або видаляти різні типи підписів, включаючи текст, зображення, штрих-коди, цифрові сертифікати та інше."
  },
  "more_features": {
    "title": "Повноцінне рішення для управління підписами",
    "description": "{{ProdFullName}} надає комплексне рішення для додавання, зміни, пошуку та перевірки електронних підписів в популярних форматах документів. Увімкніть свої робочі процеси з передовими функціями підписання документів.",
    "image_description": "Функції виявлення підписів",
    "feature_1": {
      "title": "Цифрове підписування бізнес-файлів",
      "content": "Додавайте електронні підписи, такі як текст, зображення, штрих-коди та цифрові сертифікати, у будь-якому місці ваших документів. {{ProdShortName}} підтримує підписання в PDF, Word, Excel, зображеннях та інших форматах, що забезпечує гнучкість в управлінні документами."
    },
    "feature_2": {
      "title": "Ефективне управління підписами",
      "content": "Після підписання легко знаходьте всі підписи, вбудовані в документ. API дозволяє всесторонній пошук та витяг підписів, а також можливість їх оновлення або видалення."
    },
    "feature_3": {
      "title": "Безпека документів та управління метаданими",
      "content": "Забезпечте цілісність ваших документів, вбудовуючи або видаляючи приховані метадані. Захистіть свої файли від несанкціонованих змін, використовуючи цифрові сертифікати для пломбування та автентифікації вмісту документа."
    }
  },
  "formats": {
    "title": "Знайдіть підписи у кількох типах файлів",
    "description": "З API {{ProdFullName}} ви можете ефективно шукати та отримувати електронні підписи з широкого спектру підтримуваних форматів файлів, що сприяє безперешкодній інтеграції у ваші документи."
  },
  "operations": {
    "title": "Ключові функціональні можливості",
    "description": "Наш комплексний API надає ряд операцій, спрямованих на оптимізацію управління підписами документів, від підписання до подальшої обробки та перевірки."
  },
  "examples": {
    "comment_1": "Створіть об'єкт {{TextSignature}} за допомогою шляху до документа",
    "comment_2": "Налаштуйте {{TextSearchOptions}}, щоб включити кожну сторінку",
    "comment_3": "Виконайте пошук для виявлення всіх текстових підписів у документі",
    "comment_4": "Агрегуйте виявлені підписи для всебічного аналізу"
  },
  "steps": {
    "title": "Посібник по пошуку підписів у {{FileFormatUp}} за допомогою {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) пропонує потужний інструмент для виявлення цифрових підписів у файлах {{FileFormatUp}}. Розробники {{EnvName}} можуть легко розширити функціональність своїх додатків за допомогою нашого рішення.",
      "step_1": "Вкажіть шлях до файлу {{FileFormatUp}} для пошуку підписів.",
      "step_2": "Використовуйте {{SearchOptions}} для фільтрації результатів пошуку.",
      "step_3": "Виконайте метод пошуку для знаходження підписів.",
      "step_4": "Перегляньте список виявлених підписів."
    }
  },
  "code_1": {
    "title": "Виявлення підписів на зображеннях",
    "content": "Цей приклад пояснює, як виявити підпис на зображенні в конкретному документі.",
    "comment_1": "Передайте вихідний документ як параметр до конструктора",
    "comment_2": "Шукайте підписи типу текст",
    "comment_3": "Відобразіть результати з усіма властивостями виявлених підписів"
  }
}