{
  "head": {
    "title": "Ищите электронные подписи в {{FileFormatUp}} с помощью {{ProgLang}}",
    "description": "Используйте возможности API {{ProdFullName}} для поиска подписей, встроенных в PDF, Word, Excel, Презентации и Изображения."
  },
  "header": {
    "title": "Поиск цифровых подписей в {{FileFormatUp}}",
    "description": "Без проблем извлекайте полный список электронных подписей, встроенных в различные форматы, такие как PDF, Word, Excel, Презентации и Изображения, с поддержкой {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "Начните бесплатную загрузку"
  },
  "about": {
    "title": "Изучите возможности {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) предоставляет современные функции для подписания цифровых документов. С поддержкой более 60 форматов файлов, включая PDF, документы MS Office, Изображения и ZIP-файлы, он позволяет добавлять, искать, проверять, изменять или удалять различные подписи, такие как текст, изображения, штрих-коды, QR-коды, цифровые сертификаты и печати."
  },
  "more_features": {
    "title": "Полная экосистема подписания документов",
    "description": "Откройте для себя продвинутое решение для подписания документов, специально разработанное для улучшения и защиты ваших документов с помощью различных типов подписей в различных форматах.",
    "image_description": "Поиск и управление подписями",
    "feature_1": {
      "title": "Подписывайте и защищайте деловые документы",
      "content": "Добавляйте цифровые подписи в любое место документа. {{ProdShortName}} поддерживает множество типов подписей, включая текст, изображения, штрих-коды, метаданные, печати и цифровые сертификаты, обеспечивая подлинность документов и соблюдение норм."
    },
    "feature_2": {
      "title": "Комплексное управление подписями",
      "content": "После подписания используйте функцию поиска, чтобы получить все встроенные подписи. Изменяйте или удаляйте подписи по мере необходимости, предоставляя полный контроль над целостностью документа."
    },
    "feature_3": {
      "title": "Защитите целостность вашего документа",
      "content": "Используйте продвинутые инструменты для управления скрытыми метаданными, встроенными в документы. Добавляйте или удаляйте записи метаданных и применяйте корпоративные цифровые сертификаты, чтобы защитить от несанкционированных правок и обеспечить подлинность документа."
    }
  },
  "formats": {
    "title": "Извлечение подписей из различных форматов файлов",
    "description": "API {{ProdFullName}} позволяет извлекать и управлять подписями из широкого спектра типов документов. Легко извлекайте встроенные подписи из всех основных форматов файлов для дальнейшего анализа или обработки."
  },
  "operations": {
    "title": "Основные функциональные возможности",
    "description": "Наш API предлагает широкую гибкость, позволяя пользователям подписывать документы и выполнять комплексные операции после подписания, такие как поиск, проверка и изменение подписей."
  },
  "examples": {
    "comment_1": "Инициализируйте объект {{TextSignature}} с указанным путем к документу",
    "comment_2": "Создайте экземпляр {{TextSearchOptions}}, чтобы охватить все страницы",
    "comment_3": "Выполните поиск, чтобы идентифицировать любые текстовые подписи в документе",
    "comment_4": "Соберите список обнаруженных подписей для детального анализа"
  },
  "steps": {
    "title": "Как искать подписи в {{FileFormatUp}} с помощью {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) предлагает надежный механизм для нахождения цифровых подписей в файлах {{FileFormatUp}}. Разработчики {{EnvName}} могут легко улучшить свои приложения с нашим решением.",
      "step_1": "Укажите путь к файлу {{FileFormatUp}} для поиска подписей.",
      "step_2": "Используйте {{SearchOptions}} для уточнения критериев поиска.",
      "step_3": "Вызовите метод Search для получения результатов.",
      "step_4": "Оцените список идентифицированных подписей."
    }
  },
  "code_1": {
    "title": "Поиск подписей изображений",
    "content": "Этот пример иллюстрирует процесс обнаружения изображений подписи в указанном документе.",
    "comment_1": "Предоставьте исходный документ в качестве аргумента конструктору",
    "comment_2": "Ищите любые подписи текстового типа",
    "comment_3": "Представьте результаты с детальными свойствами идентифицированных подписей"
  }
}