{
  "head": {
    "title": "ค้นหาลายเซ็นดิจิทัลใน {{FileFormatUp}} โดย {{ProgLang}}",
    "description": "ใช้ API {{ProdFullName}} เพื่อค้นหาลายเซ็นภายในไฟล์ {{FileFormatUp}} ค้นหาลายเซ็นใน PDFs, Word, Excel, การนำเสนอ และภาพ."
  },
  "header": {
    "title": "ค้นหาลายเซ็นดิจิทัลใน {{FileFormatUp}}",
    "description": "ดึงรายการลายเซ็นอิเล็กทรอนิกส์ทั้งหมดที่ฝังอยู่ในไฟล์ PDF, Word, Excel, การนำเสนอ หรือไฟล์ภาพโดยใช้ {{ProdFullName}}.",
    "subtitle": "{{ProdFullName}}",
    "action_title": "ดาวน์โหลดฟรี"
  },
  "about": {
    "title": "เกี่ยวกับ {{ProdFullName}}",
    "content": "[{{ProdFullName}}]({{PlatformLink}}) มีฟีเจอร์ที่ทรงพลังสำหรับการลงนามเอกสาร รองรับการเพิ่มข้อความ รูปภาพ บาร์โค้ด ใบรับรองดิจิทัล และตราประทับในไฟล์มากกว่า 60 รูปแบบ รวมถึง PDFs, เอกสาร MS Office, รูปภาพ, ไฟล์ ZIP และรูปแบบธุรกิจทั่วไปอื่นๆ นอกจากนี้ คุณยังสามารถค้นหา ตรวจสอบ แก้ไข หรือลบลายเซ็นได้ทุกเมื่อ."
  },
  "more_features": {
    "title": "โซลูชันการลงนามเอกสารที่ครบถ้วน",
    "description": "เราภูมิใจเสนอโซลูชันการลงนามเอกสารที่เข้ากันได้กับรูปแบบเอกสารหลักทั้งหมด เพิ่มลายเซ็นที่หลากหลายเพื่อเสริมเอกสารของคุณหรือรักษาความปลอดภัยให้กับเนื้อหา.",
    "image_description": "ค้นหาลายเซ็น",
    "feature_1": {
      "title": "ลงนามเอกสารทางธุรกิจ",
      "content": "แทรกลายเซ็นดิจิทัลที่ตำแหน่งใดก็ได้ในหน้าใดก็ได้ของเอกสาร ใช้ลายเซ็นประเภทต่างๆ เช่น ข้อความ รูปภาพ บาร์โค้ด เมตาดาต้า ตราประทับ หรือใบรับรองดิจิทัล."
    },
    "feature_2": {
      "title": "จัดการลายเซ็น",
      "content": "เอกสารที่ลงนามแล้วอาจต้องการการประมวลผลเพิ่มเติม ค้นหาลายเซ็นทั้งหมดที่มีอยู่ และปรับปรุงหรือลบเมื่อจำเป็น."
    },
    "feature_3": {
      "title": "ปกป้องเนื้อหาเอกสาร",
      "content": "จัดการเมตาดาต้าที่ซ่อนไว้ภายในเอกสาร เพิ่มเมตาดาต้าใหม่หรือเอาเอ็นทรีที่มีอยู่ ออกใบรับรองดิจิทัลขององค์กรเพื่อรักษาความปลอดภัยให้กับเนื้อหาของเอกสารจากการเปลี่ยนแปลงโดยไม่ได้รับอนุญาต."
    }
  },
  "formats": {
    "title": "ค้นหาลายเซ็นในรูปแบบไฟล์ต่างๆ",
    "description": "API {{ProdFullName}} ช่วยให้คุณสามารถดึงรายการลายเซ็นจากไฟล์ที่ลงนามใดๆ ได้ สกัดลายเซ็นจากไฟล์รูปแบบที่นิยมสำหรับการประมวลผลต่อไป."
  },
  "operations": {
    "title": "การดำเนินการที่รองรับ",
    "description": "ผลิตภัณฑ์ของเรามี API ที่ยืดหยุ่นสำหรับการลงนามเอกสารและการจัดการลายเซ็นหลังจากการลงนาม."
  },
  "examples": {
    "comment_1": "สร้างอินสแตนซ์ของ {{TextSignature}} ด้วยเส้นทางเอกสาร",
    "comment_2": "ทำการสร้าง {{TextSearchOptions}} เพื่อค้นหาทุกหน้า",
    "comment_3": "ค้นหาลายเซ็นข้อความในเอกสาร",
    "comment_4": "รายการลายเซ็นที่พบเพื่อการวิเคราะห์ต่อไป"
  },
  "steps": {
    "title": "ขั้นตอนสำหรับการค้นหาลายเซ็น {{FileFormatUp}} โดยใช้ {{ProgLang}}",
    "content": {
      "title": "[{{ProdShortName}}]({{PlatformLink}}) มีเครื่องมือที่ทรงพลังในการค้นหาลายเซ็นดิจิทัลทุกแบบภายในไฟล์ {{FileFormatUp}} นักพัฒนาที่ใช้ {{EnvName}} สามารถยกระดับแอปพลิเคชันของตนด้วยโซลูชันของเรา.",
      "step_1": "ระบุเส้นทางไฟล์ {{FileFormatUp}} เพื่อค้นหาลายเซ็น.",
      "step_2": "ใช้ {{SearchOptions}} เพื่อปรับปรุงผลลัพธ์การค้นหา.",
      "step_3": "เรียกใช้วิธีการ Search เพื่อรับผลลัพธ์.",
      "step_4": "วิเคราะห์รายการลายเซ็นที่พบ."
    }
  },
  "code_1": {
    "title": "ค้นหาเซ็นชื่อภาพ",
    "content": "ตัวอย่างนี้แสดงให้เห็นว่าคุณจะค้นหาลายเซ็นรูปภาพในเอกสารเฉพาะได้อย่างไร.",
    "comment_1": "ส่งเอกสารต้นทางเป็นพารามิเตอร์ในคอนสตรัคเตอร์",
    "comment_2": "ค้นหาลายเซ็นที่เป็นข้อความใดๆ",
    "comment_3": "แสดงผลลัพธ์พร้อมคุณสมบัติของลายเซ็นที่พบ"
  }
}